{
	"dicionario_ajuda": {
		"ferramentas": {
			"1": {
				"titulo": {
					"pt": "Filtro de cores",
					"es": "Filtro de colores",
					"en": "Color Filter"
				},
				"diretorio": "i3geo/ferramentas/tipoimagem",
				"categoria": "1",
				"pt": "O filtro possibilita gerar efeitos de colora&ccedil;&atilde;o no mapa. &Eacute; aplicado sobre a imagem gerada toda vez que o mapa &eacute; alterado. No caso de temas baseados em dados RASTER, os n&iacute;veis de cores obtidos com a ferramenta de identifica&ccedil;&atilde;o n&atilde;o s&atilde;o alterados.<br>Os filtros podem provocar um tempo maior de desenho do mapa, devendo ser utilizados com cuidado. As op&ccedil;&otilde;es s&eacute;pia e tons de cinza utilizam algor&iacute;tmos pr&oacute;prios do i3Geo, j&aacute; as demais, utilizam a op&ccedil;&atilde;o de filtro dispon&iacute;vel com o PHP 5. Mais detalhes <a href='http://www.php.net/manual/pt_BR/function.imagefilter.php' >aqui</a>.",
				"es": "El filtro permite generar efectos de colores en el mapa. Se aplica sobre la imagen generada cada vez que se cambia el mapa. En el caso de temas basados en datos RASTER los niveles de colores obtenidos con la herramienta de identificaci&oacute;n no cambian.<br>Los filtros deben utilizarse con cuidado ya que pueden hacer que el tiempo de renderizaci&oacute;n del mapa sea mayor. Las opciones sepia y los tonos grises utilizan algoritmos propios de i3Geo, el resto utiliza la opci&oacute;n de filtro disponible en PHP 5. M&aacute;s detalles <a href='http://www.php.net/manual/pt_BR/function.imagefilter.php'>aqu&iacute;</a>.",
				"en": "The filter allows you to generate color effects on the map. It is applied on the generated image every time the map is changed. In the case of themes based on RASTER dataset, the color levels obtained with the identification tool are not changed.<br>Filters can generate delays in map rendering so they should be used with care. Sepia and grayscale options use i3Geo algorithms, while others use the filter option available with PHP 5. More details <a href='http://www.php.net/manual/pt_BR/function.imagefilter.php'>here</a>.",
				"apijs": "i3GEO.mapa.dialogo.tipoimagem()"
			},
			"2": {
				"titulo": {
					"pt": "Legenda",
					"es": "Leyenda",
					"en": "Legend"
				},
				"diretorio": "i3geo/ferramentas/opcoes_legenda",
				"categoria": "1",
				"pt": "A legenda do mapa &eacute; utilizada em v&aacute;rias op&ccedil;&otilde;es do i3Geo e pode tamb&eacute;m ficar inserida na pr&oacute;pria imagem do mapa. A legenda mostra os s&iacute;mbolos utilizados no desenho de cada tema, podendo-se alterar caracter&iacute;sticas como fonte, tamanho dos textos, tamanho dos ret&acirc;ngulos com os s&iacute;mbolos, etc.<br>Antes de aplicar uma altera&ccedil;&atilde;o, voc&ecirc; pode testar os par&acirc;metros escolhidos para avaliar o resultado. No caso dos par&acirc;metros que definem cores, utilize -1,-1,-1 para anular seu efeito.",
				"es": "La leyenda del mapa se utiliza en varias opciones de i3Geo y tambi&eacute;n se puede insertar en la propia imagen del mapa. La leyenda muestra los s&iacute;mbolos utilizados en cada tema, pudiendo ser alteradas caracter&iacute;sticas como la fuente, tama&ntilde;o de los textos, tama&ntilde;o de los rect&aacute;ngulos con los s&iacute;mbolos, etc.<br>Antes de aplicar un cambio, usted puede probar los par&aacute;metros elegidos para evaluar el resultado. En el caso de los par&aacute;metros que definen colores utilice -1, -1, -1 para anular su efecto.",
				"en": "The map legend is used for various i3Geo options and can also be inserted into the map image itself. The legend shows symbols used for drawing each theme. You will be able to change characteristics like font, text size, rectangle size with symbols, etc.<br>Before applying changes, you can test the parameters you selected to evaluate the result. For parameters that define colors, use -1, -1, -1 to cancel their effect.",
				"apijs": "i3GEO.mapa.dialogo.opcoesLegenda()"
			},
			"3": {
				"titulo": {
					"pt": "Barra de escala",
					"es": "Barra de escala",
					"en": "Scale bar"
				},
				"diretorio": "i3geo/ferramentas/opcoes_escala",
				"categoria": "1",
				"pt": "A barra de escala &eacute; uma imagem inserida no mapa que mostra a rela&ccedil;&atilde;o entre uma medida feita no mapa e no mundo real. A barra pode ser modificada especificando-se seu tamanho, n&uacute;mero de divis&otilde;es e cores.<br>Existem dois modelos b&aacute;sicos para a escala: linear e bloco. Para n&atilde;o mostrar a escala no mapa, escolha a 'sem escala' na op&ccedil;&atilde;o estilo.",
				"es": "La barra de escala es una imagen insertada en el mapa que muestra la relaci&oacute;n entre una medida hecha en el mapa y la del mundo real. La barra se puede modificar especificando su tama&ntilde;o, n&uacute;mero de divisiones y colores.<br>Existen dos modelos b&aacute;sicos de escala: lineal y bloque. Para no mostrar la escala en el mapa elija 'sin escala' en la opci&oacute;n estilo.",
				"en": "The scale bar is an image embedded on the map that shows the ratio of a distance on the map to the corresponding distance on the ground. The bar can be modified by specifying its size, number of divisions and colors.<br>There are two basic types of scale: linear and block. Choose 'no scale' in the style option to exclude the scale from the map.",
				"apijs": "i3GEO.mapa.dialogo.opcoesEscala()"
			},
			"4": {
				"titulo": {
					"pt": "Tamanho do mapa",
					"es": "Tama&ntilde;o del mapa",
					"en": "Map size"
				},
				"diretorio": "i3geo/ferramentas/opcoes_tamanho",
				"categoria": "1",
				"pt": "O tamanho do mapa &eacute; definido automaticamente quando o i3Geo &eacute; aberto, buscando-se otimizar o uso do espa&ccedil;o dispon&iacute;vel no monitor. A op&ccedil;&atilde;o de modifica&ccedil;&atilde;o do tamanho altera apenas o corpo do mapa, for&ccedil;ando o ajuste dos outros elementos, o que nem sempre provoca bons resultados.<br>O ajuste do tamanho do mapa pode ser utilizado para gerar imagens em tamanhos espec&iacute;ficos, principalmente para efeitos de impress&atilde;o. A medida do tamanho utilizado &eacute; pixel, que corresponde ao tamanho m&iacute;nimo de uma c&eacute;lula da imagem do mapa. Para calcular o tamanho do mapa em outra unidade de medida, necess&aacute;rio nos casos em que se deseja imprimir o mapa, deve ser feito considerando-se a resolu&ccedil;&atilde;o de impress&atilde;o desejada.",
				"es": "Con el fin de optimizar el uso del espacio disponible en el monitor, el tama&ntilde;o del mapa se define autom&aacute;ticamente cuando se abre el i3Geo. La opci&oacute;n de modificaci&oacute;n del tama&ntilde;o cambia solo el cuerpo del mapa, forzando el ajuste de los otros elementos, lo que no siempre genera buenos resultados.<br>El ajuste del tama&ntilde;o del mapa se puede utilizar para generar im&aacute;genes en tama&ntilde;os espec&iacute;ficos principalmente para impresi&oacute;n. La medida del tama&ntilde;o utilizado es el p&iacute;xel, que corresponde al tama&ntilde;o m&iacute;nimo de una celda de la imagen del mapa. En los casos en que se desea imprimir el mapa, se debe considerar la resoluci&oacute;n de impresi&oacute;n deseada para c&aacute;lculo del tama&ntilde;o del mapa en otra unidad de medida.",
				"en": "In order to optimize the use of the available space on the monitor, the size of the map will be automatically set when i3Geo starts. The option to change the size only changes the body of the map, forcing the adjustment of other elements, which does not always produce pleasant results.<br>Map size adjustment can be used to generate images at specific sizes, especially for printing purposes. The unit for measuring the size is the pixel which is the smallest element of a map image. If you want to print the map, you must take into account the desired print resolution to calculate the map size in another unit of measurement.",
				"apijs": "i3GEO.mapa.dialogo.tamanho()"
			},
			"5": {
				"titulo": {
					"pt": "Cor da sele&ccedil;&atilde;o",
					"es": "Color de la selecci&oacute;n",
					"en": "Selection color"
				},
				"diretorio": "i3geo/ferramentas/opcoes_querymap",
				"categoria": "1",
				"pt": "A cor da sele&ccedil;&atilde;o &eacute; utilizada para mostrar no mapa os elementos de um determinado tema que est&atilde;o selecionados. A sele&ccedil;&atilde;o consiste em destacar elementos para uso em determinadas opera&ccedil;&otilde;es, como por exemplo o c&aacute;lculo de entorno (buffer). A defini&ccedil;&atilde;o da cor &eacute; baseada no modelo R,G,B, sendo que cada componente varia de 0 a 255.<br>Ao definir os valores de RGB, separe-os com ','. Quando um tema possuir elementos selecionados, &eacute; inclu&iacute;da uma marca antes do nome do tema na lista de camadas dispon&iacute;veis no mapa.",
				"es": "El color de la selecci&oacute;n se utiliza para mostrar en el mapa las entidades de un tema determinado que est&aacute;n seleccionados. La selecci&oacute;n consiste en destacar entidades para su uso en determinadas operaciones, como por ejemplo el c&aacute;lculo de zona de influencia (buffer). La definici&oacute;n del color se basa en el modelo R, G, B donde cada componente var&iacute;a entre 0 y 255.<br>Separe los valores RGB con ',' al momento de definirlos. Cuando un tema tiene entidades seleccionadas se incluye una marca antes del nombre del tema en la lista de capas disponibles en el mapa.",
				"en": "The selection color is used to show on the map selected features of a particular theme. The selection consists of highlighting elements for use in some operations such as buffer. The color definition is based on the R, G, B model, where each component ranges from 0 to 255.<br>Separate RGB values with ','. When a theme has selected features, a check mark is added before the theme name in the list of layers available on the map.",
				"apijs": "i3GEO.mapa.dialogo.queryMap()"
			},
			"6": {
				"titulo": {
					"pt": "Cor do fundo",
					"es": "Color del fondo",
					"en": "Background color"
				},
				"diretorio": "i3geo/ferramentas/opcoes_fundo",
				"categoria": "1",
				"pt": "O corpo do mapa &eacute; constitu&iacute;do por uma imagem gerada com tamanho fixo. Essa imagem possu&iacute; uma cor padr&atilde;o, sobre a qual s&atilde;o sobrepostas as camadas. Por padr&atilde;o, a cor do fundo &eacute; definida como azul. A defini&ccedil;&atilde;o da cor &eacute; baseada no modelo R,G,B, sendo que cada componente varia de 0 a 255.<br>Ao definir os valores de RGB, separe-os com ','. Ao utilizar as op&ccedil;&otilde;es de convers&atilde;o do mapa atual para kml ou WMS, a altera&ccedil;&atilde;o da cor do fundo para 255,255,255 oferece melhores resultados na visualiza&ccedil;&atilde;o dos dados.",
				"es": "El cuerpo del mapa est&aacute; constituido por una imagen generada con un tama&ntilde;o fijo. Esta imagen tiene un color est&aacute;ndar sobre el que se superponen las capas. De forma predeterminada el color del fondo se establece en azul. La definici&oacute;n del color se basa en el modelo R, G, B donde cada componente var&iacute;a entre 0 y 255.<br>Separe los valores RGB con ',' al momento de definirlos. Al utilizar las opciones de conversi&oacute;n del mapa actual a kml o WMS, el cambio del color del fondo a 255,255,255 ofrece mejores resultados en la visualizaci&oacute;n de los datos.",
				"en": "The map body is made up of a generated image with a fixed size. This image has a default color over which the layers are overlapped. By default the background color is set to blue. The color definition is based on the R, G, B model, where each component ranges from 0 to 255.<br>Separate RGB values with ','. When using the conversion options to convert the current map to kml or WMS, change the background color to 255,255,255 to obtain better results in data visualization.",
				"apijs": "i3GEO.mapa.dialogo.corFundo()"
			},
			"7": {
				"titulo": {
					"pt": "Grade de coordenadas",
					"es": "Cuadr&iacute;cula de coordenadas",
					"en": "Coordinate grid"
				},
				"diretorio": "i3geo/ferramentas/gradecoord",
				"categoria": "1",
				"pt": "A grade de coordenadas &eacute; formada por linhas verticais e horizontais representando determinadas latitudes e longitudes. A grade &eacute; um dos elementos principais na defini&ccedil;&atilde;o de um mapa, sendo utilizada na impress&atilde;o ou gera&ccedil;&atilde;o de figuras.<br>Ao adicionar uma grade, &eacute; criado uma nova camada no mapa, possibilitando que mais de uma grade seja criada. Uma grade pode ou n&atilde;o conter os textos indicando os valores de lat long, permitindo que se crie uma grade com espa&ccedil;amento de linhas diferente do espa&ccedil;amento dos textos.",
				"es": "La cuadr&iacute;cula de coordenadas est&aacute; formada por l&iacute;neas verticales y horizontales que representan determinadas latitudes y longitudes. La cuadr&iacute;cula es uno de los elementos principales en la definici&oacute;n de un mapa, siendo utilizada en la impresi&oacute;n o generaci&oacute;n de figuras.<br>Al agregar una cuadr&iacute;cula se crea una  capa nueva en el mapa, lo que permite que m&aacute;s de una cuadr&iacute;cula se cree. Una cuadr&iacute;cula puede o no contener textos indicando de los valores de latitud y longitud, permitiendo que se cree una cuadr&iacute;cula con espaciado de l&iacute;neas diferente a &eacute;l de los textos.",
				"en": "A coordinate grid is made up of vertical and horizontal lines representing latitudes and longitudes. The grid is one of the main elements in map definition, and is used for printing or picture creation.<br>When you add a grid, a new layer is created on the map, allowing you to create more than one grid. A grid may or may not contain texts indicating lat and long values, allowing you to create a grid with line spacing different from the spacing of the texts.",
				"apijs": "i3GEO.mapa.dialogo.gradeCoord()"
			},
			"8": {
				"titulo": {
					"pt": "Templates",
					"es": "Plantillas",
					"en": "Templates"
				},
				"diretorio": "i3geo/ferramentas/template",
				"categoria": "1",
				"pt": "Um template define como os componentes de um mapa s&atilde;o organizados no navegador. O administrador do i3Geo pode criar templates diferentes conforme as necessidades do usu&aacute;rio, sendo que alguns templates s&atilde;o fornecidos com o pr&oacute;prio i3Geo.<br>A cria&ccedil;&atilde;o de templates &eacute; uma tarefa do administrador do i3Geo. Para abrir um template espec&iacute;fico diretamente, utilize a URL que &eacute; mostrada no navegador quando um template &eacute; escolhido.",
				"es": "Una plantilla define c&oacute;mo se organizan los componentes de un mapa en el explorador. El administrador de i3Geo puede crear plantillas diferentes seg&uacute;n las necesidades del usuario. Algunas plantillas se suministran con el propio i3Geo.<br>La creaci&oacute;n de plantillas es una tarea del administrador de i3Geo. Para abrir una plantilla espec&iacute;fica directamente utilice la URL que se muestra en el navegador cuando se elige una plantilla.",
				"en": "A template defines how map components are organized in the browser. The i3Geo administrator can create different templates according to the user goals, and some templates are provided with i3Geo itself.<br>The i3Geo administrator is responsible for creating templates. Use the URL that is displayed in the browser when a template is selected to open a specific template directly.",
				"apijs": "i3GEO.mapa.dialogo.template()"
			},
			"9": {
				"titulo": {
					"pt": "Temporizador",
					"es": "Temporizador",
					"en": "Timer"
				},
				"diretorio": "i3geo/ferramentas/opcoes_autoredesenha",
				"categoria": "1",
				"pt": "O temporizador permite definir um intervalo de tempo em segundos que ir&aacute; disparar o redesenho do mapa.<br>Quando o mapa &eacute; redesenhado, as camadas existentes s&atilde;o lidas novamente para compor o novo mapa. Essa op&ccedil;&atilde;o &eacute; &uacute;til quando existirem camadas no mapa que sofrem atualiza&ccedil;&otilde;es frequentes, como por exemplo o deslocamento de aeronaves, carros ou navios.",
				"es": "El temporizador permite definir un intervalo de tiempo en segundos que hace que el mapa se vuelva a renderizar.<br>Cuando el mapa se vuelve a renderizar las capas existentes se leen de nuevo para componer el nuevo mapa. Esta opci&oacute;n es &uacute;til cuando hay capas en el mapa que sufren actualizaciones frecuentes, como por ejemplo el desplazamiento de aeronaves, coches o barcos.",
				"en": "The timer allows you to define a time interval in seconds that will trigger the re-rendering of the map.<br>When the map is re-rendered the existing layers are read again to compose a new map. This option is useful when there are layers on the map that are frequently updated as the movement of aircrafts, cars or ships.",
				"apijs": "i3GEO.mapa.dialogo.autoredesenha()"
			},
			"10": {
				"titulo": {
					"pt": "Salvar mapa",
					"es": "Guardar en el mapa",
					"en": "Save map"
				},
				"diretorio": "i3geo/ferramentas/salvamapa",
				"categoria": "2",
				"pt": "O mapa que o usu&aacute;rio est&aacute; utilizando pode ser salvo localmente (na m&aacute;quina do usu&aacute;rio) ou no banco de dados no servidor onde o i3Geo est&aacute; instalado. para ser aberto posteriormente. Isso permite que um trabalho seja continuado em outro momento, uma vez que o mapa em uso &eacute; sempre perdido quando o usu&aacute;rio fecha o navegador.<br>Os dados locais que foram criados n&atilde;o s&atilde;o salvos, sendo necess&aacute;rio o seu download quando desejado. Isso afeta as op&ccedil;&otilde;es de inclus&atilde;o de pontos ou convers&atilde;o de elementos selecionados em camadas.",
				"es": "El mapa que el usuario est&aacute; utilizando puede guardarse localmente (en la m&aacute;quina del usuario) o en la base de datos en el servidor donde est&aacute; instalado i3Geo, para ser abierto posteriormente. Esto permite que un trabajo contin&uacute;e en otro momento, ya que el mapa en uso siempre se pierde cuando el usuario cierra el navegador.<br>Los datos locales que se han creado no se guardan, por lo que es necesario descargarlos cuando se desee. Esto afecta a las opciones de inclusi&oacute;n de puntos o conversi&oacute;n de las entidades seleccionadas en capas.",
				"en": "In order to open later a map that a user is visualizing, the map can be saved locally (on the user's computer) or in the database on the server where i3Geo is installed. This allows a task to continue at another time since the map in use is always lost when the user closes the browser.<br>Local data that has been created is not saved, so it is necessary to download it whenever you want. This affects the options for adding points or converting selected features in layers.",
				"apijs": "i3GEO.mapa.dialogo.salvaMapa()"
			},
			"11": {
				"titulo": {
					"pt": "Carregar mapa",
					"es": "Cargar mapa",
					"en": "Upload map"
				},
				"diretorio": "i3geo/ferramentas/carregamapa",
				"categoria": "2",
				"pt": "O mapa que o usu&aacute;rio est&aacute; utilizando pode ser salvo localmente (na m&aacute;quina do usu&aacute;rio) para ser aberto posteriormente. Isso permite que um trabalho seja continuado em outro momento, uma vez que o mapa em uso &eacute; sempre perdido quando o usu&aacute;rio fecha o navegador.<br>A op&ccedil;&atilde;o de carregar um mapa permite enviar para o servidor, onde o i3Geo est&aacute; instalado, o mapa que foi salvo anteriormente.",
				"es": "El mapa que el usuario est&aacute; utilizando puede ser guardado localmente (en la m&aacute;quina del usuario) para ser abierto posteriormente. Esto permite que un trabajo se contin&uacute;e en otro momento, ya que el mapa en uso siempre se pierde cuando el usuario cierra el navegador.<br>La opci&oacute;n de cargar un mapa permite enviar al servidor (donde i3Geo est&aacute; instalado) el mapa que se guard&oacute; anteriormente.",
				"en": "In order to open later a map that a user is visualizing, the map can be saved locally (on the user's computer). This allows a task to continue at another time since the map in use is always lost when the user closes the browser.<br>The option to load a map allows you to send to the server (where i3Geo is installed) the map that was previously saved.",
				"apijs": "i3GEO.mapa.dialogo.carregaMapa()"
			},
			"12": {
				"titulo": {
					"pt": "Converter em WMS",
					"es": "Convertir en WMS",
					"en": "Convert to WMS"
				},
				"diretorio": "i3geo/ferramentas/convertews",
				"categoria": "2",
				"pt": "Convertendo o mapa atual em um WMS &eacute; poss&iacute;vel utilizar outros softwares para visualizar o mesmo mapa visto no i3Geo. O resultado da convers&atilde;o &eacute; um endere&ccedil;o (url) tempor&aacute;rio, esse endere&ccedil;o deve ser inserido no software que se quer usar e que suporte WMS.<br>WMS &eacute; um padr&atilde;o internacional e n&atilde;o espec&iacute;fico do i3Geo. Utilizando um WMS, pode-se adicionar ao mapa outras camadas de dados, inclusive dados locais, se estiver sendo utilizado um software instalado em um computador local. Conforme as caracter&iacute;sticas de cada servidor onde o i3Geo estiver instalado, o WMS poder&aacute; permanecer dispon&iacute;vel por per&iacute;odos de tempo vari&aacute;veis. Para acessar a lista de WMS dispon&iacute;veis utilize o link <a href='ogc.htm' >ogc.htm</a>.Mais informa&ccedil;&otilde;es em <a href='www.opengeospatial.org' >OGC.</a>",
				"es": "Al convertir el mapa actual en un WMS es posible utilizar otros softwares para visualizar el mismo mapa visto en i3Geo. El resultado de la conversi&oacute;n es una direcci&oacute;n temporal (url). Esta direcci&oacute;n se debe insertar en el software que se desea utilizar y que admita WMS.<br>WMS es un est&aacute;ndar internacional y no espec&iacute;fico de i3Geo. Al utilizar un WMS, se pueden agregar al mapa otras capas de datos, incluyendo datos locales, si se est&aacute; empleando un software instalado en un equipo local. De acuerdo a las caracter&iacute;sticas de cada servidor donde est&eacute; instalado i3Geo, el WMS puede permanecer disponible por per&iacute;odos de tiempo variables. Para acceder a la lista de WMS disponibles, utilice el enlace <a href='ogc.htm' >ogc.htm</a>. M&aacute;s informaci&oacute;n en <a href='www.opengeospatial.org' >OGC.</a>",
				"en": "When converting the current map into a WMS it is possible to use other software to display the same map that a user is visualizing on i3Geo. The result of the conversion is a temporary address (url). This address must be inserted in the software that you want to use and that supports WMS. WMS is an international standard and not specific to i3Geo. When using a WMS, other data layers, including local data, can be added to the map if you are using a software installed on a local computer. According to the characteristics of each server where i3Geo is installed, the WMS can remain available for varying periods of time. To access the list of available WMS, use the <a href='ogc.htm' >ogc.htm</a> link. More information at <a href='www.opengeospatial.org' >OGC.</a>",
				"apijs": "i3GEO.mapa.dialogo.convertews()"
			},
			"13": {
				"titulo": {
					"pt": "Converter em KML",
					"es": "Convertir en KML",
					"en": "Convert to KML"
				},
				"diretorio": "i3geo/ferramentas/convertekml",
				"categoria": "2",
				"pt": "Convertendo o mapa atual em KML &eacute; poss&iacute;vel utilizar outros softwares para visualizar o mesmo mapa visto no i3Geo. O resultado da convers&atilde;o &eacute; um endere&ccedil;o (url) tempor&aacute;rio, esse endere&ccedil;o deve ser inserido no software que se quer usar e que suporte KML. Para usar o KML no Google Earth, utilize a op&ccedil;&atilde;o desse softawre chamada 'adicionar link de rede'.<br>KML &eacute; um padr&atilde;o internacional e n&atilde;o espec&iacute;fico do i3Geo. Conforme as caracter&iacute;sticas de cada servidor onde o i3Geo estiver instalado, o KML poder&aacute; permanecer dispon&iacute;vel por per&iacute;odos de tempo vari&aacute;veis. O KML gerado pelo i3Geo n&atilde;o cont&eacute;m as coordenadas dos elementos de uma camada, mas sim um WMS embutido no KML. Essa estrutura limita o uso do KML mas permite uma maior performance no acesso aos dados. Mais informa&ccedil;&otilde;es em <a href='www.opengeospatial.org' target=blanck >OGC</a>.",
				"es": "Al convertir el mapa actual en KML es posible utilizar otros softwares para visualizar el mismo mapa visto en i3Geo. El resultado de la conversi&oacute;n es una direcci&oacute;n temporal (url) que se debe insertar en el software que desea utilizar y que soporte KML. Para usar KML en Google Earth utilice la opci&oacute;n de este software llamada 'agregar enlace de red'.<br>KML es un est&aacute;ndar internacional y no espec&iacute;fico de i3Geo. De acuerdo con las caracter&iacute;sticas de cada servidor donde se instala i3Geo, KML puede permanecer disponible por per&iacute;odos de tiempo variables. El KML generado por i3Geo no contiene las coordenadas de las entidades de una capa, sino un WMS incrustado en el KML. Esta estructura limita el uso de KML, pero permite un mayor rendimiento en el acceso a los datos. M&aacute;s informaci&oacute;n en <a href='www.opengeospatial.org' target=blanck >OGC</a>.",
				"en": "When converting the current map into KML it is possible to use other software to display the same map that a user is visualizing on i3Geo. The result of the conversion is a temporary address (url) that must be inserted in the software that you want to use and that supports KML. To use KML in Google Earth use the option of this software named 'add network link'.<br>KML is an international standard and not specific to i3Geo. According to the characteristics of each server where i3Geo is installed, KML can remain available for variable periods of time. The KML generated by i3Geo does not contain the coordinates of the layer features, but it has a WMS embedded in the KML. This structure limits the use of KML, but allows a greater performance in the access to the data. More information at <a href='www.opengeospatial.org' target=blanck >OGC</a>.",
				"apijs": "i3GEO.mapa.dialogo.convertekml()"
			},
			"14": {
				"titulo": {
					"pt": "Grade de pol&iacute;gonos",
					"es": "Cuadr&iacute;cula de pol&iacute;gonos",
					"en": "Polygon grid"
				},
				"diretorio": "i3geo/ferramentas/gradepol",
				"categoria": "3",
				"pt": "Cria uma nova camada no mapa contendo ret&acirc;ngulos com espa&ccedil;amento determinado em x e y. A grade gerada pode ser obtida via download. O espa&ccedil;amento &eacute; definido em d&eacute;cimos de grau e as coordenadas do ponto inicial podem ser definida clicando-se no mapa ou digitando-se o valor.<br>A grade &eacute; &uacute;til para a realiza&ccedil;&atilde;o de an&aacute;lises onde deseja-se calcular ocorr&ecirc;ncias de fen&ocirc;menos pontuais e represent&aacute;-los posteriormente com base em totais. Observe que a &aacute;rea e as dist&acirc;ncias reais de cada pol&iacute;gono n&atilde;o s&atilde;o constantes, uma vez que &eacute; utilizada a proje&ccedil;&atilde;o geogr&aacute;fica na sua gera&ccedil;&atilde;o.",
				"es": "Crea una capa nueva en el mapa que contiene rect&aacute;ngulos con espaciado determinado en x e y. La cuadr&iacute;cula generada se puede obtener a trav&eacute;s de la descarga. El espaciado se define en grados decimales y las coordenadas del punto inicial se pueden definir haciendo clic en el mapa o escribiendo el valor.<br>La cuadr&iacute;cula es &uacute;til para efectuar an&aacute;lisis donde se desea calcular ocurrencias de fen&oacute;menos basados en puntos y representarlos posteriormente en base a totales. Observe que el &aacute;rea y las distancias reales de cada pol&iacute;gono no son constantes ya que se utiliza la proyecci&oacute;n geogr&aacute;fica en su generaci&oacute;n.",
				"en": "Creates a new layer on the map that contains rectangles with a specific spacing in x and y. The generated grid can be downloaded. The spacing is defined in decimal degrees and the starting point coordinates can be defined by clicking on the map or by typing the value.<br>The grid is useful for performing analyzes where you want to calculate occurrences of point-based phenomena and then represent them based on totals. Note that the actual distances between each polygon are not constant since it is used the geographic projection for this task.",
				"apijs": "i3GEO.analise.dialogo.gradePol()"
			},
			"15": {
				"titulo": {
					"pt": "Grade de pontos",
					"es": "Cuadr&iacute;cula de puntos",
					"en": "Point grid"
				},
				"diretorio": "i3geo/ferramentas/gradepontos",
				"categoria": "3",
				"pt": "Cria uma nova camada no mapa contendo pontos com espa&ccedil;amento determinado em x e y. A grade gerada pode ser obtida via download. O espa&ccedil;amento &eacute; definido em d&eacute;cimos de grau e as coordenadas do ponto inicial podem ser definida clicando-se no mapa ou digitando-se o valor.<br>Observe que as dist&acirc;ncias reais entre cada ponto n&atilde;o s&atilde;o constantes, uma vez que &eacute; utilizada a proje&ccedil;&atilde;o geogr&aacute;fica na sua gera&ccedil;&atilde;o.",
				"es": "Crea una capa nueva en el mapa que contiene puntos con espaciado determinado en x e y. La cuadr&iacute;cula generada se puede obtener a trav&eacute;s de la descarga. El espaciado se define en grados decimales y las coordenadas del punto inicial se pueden definir haciendo clic en el mapa o escribiendo el valor.<br>Observe que las distancias reales entre cada punto no son constantes ya que se utiliza la proyecci&oacute;n geogr&aacute;fica en su generaci&oacute;n.",
				"en": "Creates a new layer on the map that contains points with a specific spacing in x and y. The generated grid can be downloaded. The spacing is defined in decimal degrees and the starting point coordinates can be defined by clicking on the map or by typing the value.<br>Note that the actual distances between each point are not constant since it is used the geographic projection for this task.",
				"apijs": "i3GEO.analise.dialogo.gradePontos()"
			},
			"16": {
				"titulo": {
					"pt": "Grade de hex&aacute;gonos",
					"es": "Cuadr&amp;iacute;cula de hex&aacute;gonos",
					"en": "Hexagonal grid"
				},
				"diretorio": "i3geo/ferramentas/gradehex",
				"categoria": "3",
				"pt": "Cria uma nova camada no mapa contendo hex&aacute;gonos com espa&ccedil;amento determinado em x e y. A grade gerada pode ser obtida via download. O espa&ccedil;amento &eacute; definido em d&eacute;cimos de grau e as coordenadas do ponto inicial podem ser definida clicando-se no mapa ou digitando-se o valor.<br>A grade &eacute; &uacute;til para a realiza&ccedil;&atilde;o de an&aacute;lises onde deseja-se calcular ocorr&ecirc;ncias de fen&ocirc;menos pontuais e represent&aacute;-los posteriormente com base em totais. Observe que a &aacute;rea e as dist&acirc;ncias reais de cada pol&iacute;gono n&atilde;o s&atilde;o constantes, uma vez que &eacute; utilizada a proje&ccedil;&atilde;o geogr&aacute;fica na sua gera&ccedil;&atilde;o.",
				"es": "Crea una capa nueva en el mapa que contiene hex&aacute;gonos con espaciado determinado en x e y. La cuadr&iacute;cula generada se puede obtener a trav&eacute;s de la descarga. El espaciado se define en grados decimales y las coordenadas del punto inicial se pueden definir haciendo clic en el mapa o escribiendo el valor.<br>La cuadr&iacute;cula es &uacute;til para efectuar an&aacute;lisis donde se desea calcular ocurrencias de fen&oacute;menos puntuales y representarlos posteriormente en base a totales. Observe que el &aacute;rea y las distancias reales de cada pol&iacute;gono no son constantes ya que se utiliza la proyecci&oacute;n geogr&aacute;fica en su generaci&oacute;n.",
				"en": "Creates a new layer on the map that contains hexagons with a specific spacing in x and y. The generated grid can be downloaded. The spacing is defined in decimal degrees and the starting point coordinates can be defined by clicking on the map or by typing the value.<br>The grid is useful for performing analyzes where you want to calculate occurrences of point-based phenomena and then represent them based on totals. Note that the actual distances between each polygon are not constant since it is used the geographic projection for this task.",
				"apijs": "i3GEO.analise.dialogo.gradeHex()"
			},
			"17": {
				"titulo": {
					"pt": "Dist&acirc;ncia entre pontos",
					"es": "Distancia entre puntos",
					"en": "Distance between points"
				},
				"diretorio": "i3geo/ferramentas/distanciaptpt",
				"categoria": "3",
				"pt": "O c&aacute;lculo de dist&acirc;ncias &eacute; feito de um ponto em rela&ccedil;&atilde;o aos mais pr&oacute;ximos. O ponto origem, deve estar selecionado em um dos temas existentes no mapa. Para restringir a dist&acirc;ncia de busca, &eacute; necess&aacute;rio definir um raio m&aacute;ximo, os pontos considerados ser&atilde;o aqueles dentro desse raio. Em cada linha ligando dois pontos s&atilde;o inseridos atributos que indicam a dist&acirc;ncia e o identificador dos pontos. Esses identificadores s&atilde;o escolhidos com base nas colunas de atributos do tema pontual escolhido.<br>O resultado dos c&aacute;lculos s&atilde;o novas camadas inclu&iacute;das no mapa, sendo uma de linhas e uma com o entorno de busca considerado.",
				"es": "El c&aacute;lculo de distancias se realiza desde un punto en relaci&oacute;n a los m&aacute;s cercanos. El punto de origen debe estar seleccionado en uno de los temas del mapa. Para restringir la distancia de b&uacute;squeda es necesario definir un radio m&aacute;ximo, en donde los puntos considerados ser&aacute;n aquellos dentro de ese radio. En cada l&iacute;nea que conecta dos puntos se insertan atributos que indican la distancia y el identificador de los puntos. Estos identificadores se eligen en base a las columnas de los atributos del tema de punto elegido.<br>El resultado de los c&aacute;lculos son capas nuevas que se incluyen en el mapa, siendo una de l&iacute;neas y la otra con el entorno de b&uacute;squeda considerado.",
				"en": "The distance calculation is executed from a point in relation to the nearest ones. The origin point must be selected in one of the map themes. To restrict the search distance, it is necessary to define a maximum radius where points to process will be those within that radius. For each line that connects two points will be inserted attributes that will indicate the distance and a point identifier. This identifier is selected based on the attributes columns of the selected point-based theme.<br>The result of the calculations will be two new layers that are included on the map, being one a line-based layer and the other with the search environment.",
				"apijs": "i3GEO.analise.dialogo.distanciaptpt()"
			},
			"18": {
				"titulo": {
					"pt": "Ponto em pol&iacute;gono",
					"es": "Punto en pol&iacute;gono",
					"en": "Point in polygon"
				},
				"diretorio": "i3geo/ferramentas/pontoempoligono",
				"categoria": "3",
				"pt": "Ponto em pol&iacute;gono &eacute; uma opera&ccedil;&atilde;o que resulta em um novo tema contendo o cruzamento entre um tema com pontos e outros com pol&iacute;gonos (ou imagem raster). As informa&ccedil;&otilde;es do tema poligonal (ou raster) ser&atilde;o agregadas &agrave; tabela do novo tema pontual gerado. As colunas da tabela de atributos do novo tema gerado ser&atilde;o nomeadas em uma sequ&ecirc;ncia num&eacute;rica, uma vez que o tema original pode ter colunas com nomes incompat&iacute;veis com o formato shapefile, utilizado na gera&ccedil;&atilde;o do novo tema.<br>Pode-se escolher mais de um tema de origem dos dados, possibilitando agregar informa&ccedil;&otilde;es de temas diferentes. Essa op&ccedil;&atilde;o de cruzamento &eacute; &uacute;til nos casos onde a informa&ccedil;&atilde;o necess&aacute;ria para a an&aacute;lise de um tema encontra-se em outro tema. Por exemplo, &eacute; poss&iacute;vel cruzar um tema com a localiza&ccedil;&atilde;o das cidades com um tema com a delimita&ccedil;&atilde;o de biomas. O resultado permite elaborar estat&iacute;sticas por biomas com base nos dados dos pontos.",
				"es": "El punto en pol&iacute;gono es una operaci&oacute;n que resulta en un tema nuevo que contiene la intersecci&oacute;n entre un tema de puntos y otros de pol&iacute;gonos (o imagen raster). Las informaciones del tema de pol&iacute;gono (o raster) ser&aacute;n agregadas a la tabla del tema nuevo de punto generado. Las columnas de la tabla de atributos del tema nuevo generado ser&aacute;n enumeradas en una secuencia num&eacute;rica, ya que el tema original puede tener columnas con nombres incompatibles con el formato shapefile utilizado en la generaci&oacute;n del tema nuevo.<br>Se puede elegir m&aacute;s de un tema de origen de los datos, posibilitando agregar informaciones de temas diferentes. Esta opci&oacute;n de cruce es &uacute;til en los casos donde la informaci&oacute;n necesaria para el an&aacute;lisis de un tema se encuentra en otro tema. Por ejemplo, es posible cruzar un tema con la localizaci&oacute;n de las ciudades con un tema con la delimitaci&oacute;n de biomas. El resultado permite elaborar estad&iacute;sticas de los biomas bas&aacute;ndose en los datos de los puntos.",
				"en": "Point in polygon is an operation that results in a new theme that contains the intersection between a point-based theme and polygon-based themes (or raster image). The information about the polygon-base theme (or raster) will be added to the table of the new point theme. The attribute table columns of the new theme will be numbered in a numerical sequence, since the original theme may have column names incompatible with the shapefile format used for creating the new theme.<br>You can choose more than one theme of data source, making it possible to add information of different themes. This linking option is useful in cases where the information necessary for the analysis of a theme is located in another theme. For example, it is possible to link a theme of cities locations with a theme of biomes boundaries. The result allows you to obtain statistics about biomes based on point-based data.",
				"apijs": "i3GEO.analise.dialogo.pontoempoligono()"
			},
			"19": {
				"titulo": {
					"pt": "N&uacute;mero de pontos por pol&iacute;gono",
					"es": "N&uacute;mero de puntos por pol&iacute;gono",
					"en": "Number of points per polygon"
				},
				"diretorio": "i3geo/ferramentas/nptpol",
				"categoria": "3",
				"pt": "Ponto em pol&iacute;gono &eacute; uma opera&ccedil;&atilde;o que resulta em um novo tema contendo o cruzamento entre um tema com pontos e outro com pol&iacute;gono. O resultado &eacute; um novo tema poligonal, cuja tabela de atributos conter&aacute; um item com o total de pontos em cada pol&iacute;gono.<br>O uso dessa ferramenta &eacute; indicado nas situa&ccedil;&otilde;es em que se deseja agregar dados de ocorr&ecirc;ncias pontuais em pol&iacute;gonos, possibilitando a visualiza&ccedil;&atilde;o dos dados por meio de t&eacute;cnicas de classifica&ccedil;&atilde;o e representa&ccedil;&atilde;o coropl&eacute;tica.",
				"es": "Punto en pol&iacute;gono es una operaci&oacute;n que resulta en un tema nuevo que contiene la intersecci&oacute;n entre un tema con puntos y otro con pol&iacute;gono. El resultado es un tema de pol&iacute;gono nuevo cuya tabla de atributos contendr&aacute; una entidad con el total de puntos en cada pol&iacute;gono.<br>El uso de esta herramienta es indicado en situaciones en las que se desea agregar datos de puntos dentro de pol&iacute;gonos, posibilitando la visualizaci&oacute;n de los datos por medio de t&eacute;cnicas de clasificaci&oacute;n y representaci&oacute;n coropl&eacute;.",
				"en": "Point in polygon is an operation that results in a new theme that contains the intersection between a point-based theme and polygon-based themes. The result is a new polygon theme whose attribute table will contain a field showing the total points in each polygon.<br>The use of this tool is recommended in situations in which it is required to add point-based data within polygons, making possible data visualization through classification techniques and choropleth maps.",
				"apijs": "i3GEO.analise.dialogo.nptPol()"
			},
			"20": {
				"titulo": {
					"pt": "Distribui&ccedil;&atilde;o de pontos",
					"es": "Distribuci&oacute;n de puntos",
					"en": "Point distribution"
				},
				"diretorio": "i3geo/ferramentas/pontosdistri",
				"categoria": "3",
				"pt": "Essa op&ccedil;&atilde;o disponibiliza v&aacute;rias ferramentas de an&aacute;lise de distribui&ccedil;&atilde;o de pontos, a maior parte baseia-se no software estat&iacute;stico <a href='https://www.r-project.org/' target=blanck >R</a>. Algumas das an&aacute;lises geram como resultado imagens RASTER e outras temas lineares e poligonais. A op&ccedil;&atilde;o de relat&oacute;rio gera uma nova p&aacute;gina com v&aacute;rios &iacute;ndices calculados com o software R.<br>A imagem RASTER resultante utiliza a resolu&ccedil;&atilde;o (tamanho do pixel) compat&iacute;vel com a escala utilizada no mapa que est&aacute; sendo visto. A representa&ccedil;&atilde;o utiliza, por padr&atilde;o, tons de cinza. A altera&ccedil;&atilde;o nas cores utilizadas na representa&ccedil;&atilde;o podem melhorar de forma significativa a visualiza&ccedil;&atilde;o dos resultados. Utilize a op&ccedil;&atilde;o de edi&ccedil;&atilde;o da legenda do tema para fazer isso. As an&aacute;lises de distribui&ccedil;&atilde;o de pontos s&atilde;o realizadas com o software R. As an&aacute;lises de densidade de pontos, dist&acirc;ncia entre pontos e kernel, foram implantadas utilizando-se a biblioteca <a href='http://cran.r-project.org/web/packages/spatstat' target=blanck >SPATSTAT</a> do R. As an&aacute;lises de Delaunay e Voronoi utilizam a biblioteca <a href='http://cran.r-project.org/web/packages/deldir' target=blanck >DELDIR</a> e a an&aacute;lise de cluster espacial utiliza o <a href='http://cran.r-project.org/web/packages/spatclus' target=blanck >SPATCLUS</a>. As an&aacute;lises podem consumir muito tempo de processamento, portanto, tenha cuidado com o n&uacute;mero de pontos.",
				"es": "Esta opci&oacute;n ofrece varias herramientas de an&aacute;lisis de distribuci&oacute;n de puntos, la mayor&iacute;a se basa en el software estad&iacute;stico <a href='www.r-project.org' target=blanck >R</a>. Algunos de los an&aacute;lisis generan como resultado im&aacute;genes RASTER y otros temas de l&iacute;neas y pol&iacute;gonos. La opci&oacute;n de informe genera una p&aacute;gina nueva con varios &iacute;ndices calculados con el software R.<br>La imagen RASTER resultante utiliza la resoluci&oacute;n (tama&ntilde;o de p&iacute;xel) compatible con la escala utilizada en el mapa que se est&aacute; visualizando. La representaci&oacute;n utiliza de forma predeterminada tonos de gris. El cambio en los colores utilizados en la representaci&oacute;n puede mejorar significativamente la visualizaci&oacute;n de los resultados. Utilice la opci&oacute;n de edici&oacute;n de la leyenda del tema para hacer esto. Los an&aacute;lisis de distribuci&oacute;n de puntos se realizan con el software R. Los an&aacute;lisis de densidad de puntos, distancia entre puntos y kernel, se implementaron utilizando la biblioteca <a href='http://cran.r-project.org/web/packages/spatstat' target=blanck >SPATSTAT</a> de R. Los an&aacute;lisis de Delaunay y Voronoi utilizan la biblioteca <a href='http://cran.r-project.org/web/packages/deldir' target=blanck >DELDIR</a> y el an&aacute;lisis del cluster espacial utiliza <a href='http://cran.r-project.org/web/packages/spatclus' target=blanck >SPATCLUS</a>. Los an&aacute;lisis pueden consumir mucho tiempo de procesamiento, por lo tanto, tenga cuidado con el n&uacute;mero de puntos.",
				"en": "This option offers various analysis tools for point distribution, most of them are based on <a href='https://www.r-project.org/' target=blank >R</a> statistical software. Some of the analyses result in RASTER images and others in line and polygon themes. The report option generates a new page with several indexes calculated with R.<br>The resulting RASTER image has a resolution (pixel size) compatible with the map scale that is being displayed. By default, rendering is in grayscale. If you change colors used for rendering you can significantly improve the visualization of the results. Use the editing option of the theme legend to do this. Point distribution analyses are performed with R. Density, distance between points and kernel analyses were implemented using the <a href='http://cran.r-project.org/web/packages/spatstat' target=blanck >SPATSTAT</a> library of R. Delaunay and Voronoi analyses use the <a href='http://cran.r-project.org/web/packages/deldir' target=blanck >DELDIR</a> library and spatial cluster analysis uses <a href='http://cran.r-project.org/web/packages/spatclus' target=blanck >SPATCLUS</a>. Analyses can consume a lot of processing time, therefore, be careful with the number of points.",
				"apijs": ""
			},
			"21": {
				"titulo": {
					"pt": "Centr&oacute;ide",
					"es": "Centr&oacute;ide",
					"en": "Centroid"
				},
				"diretorio": "i3geo/ferramentas/centroide",
				"categoria": "3",
				"pt": "Os centr&oacute;ides s&atilde;o pontos localizados no centro de massa de uma geometria. Para gerar os centr&oacute;ides, voc&ecirc; precisa selecionar alguns elementos de um tema. Utilize para isso a op&ccedil;&atilde;o de sele&ccedil;&atilde;o ou a tabela de atributos do tema desejado.<br>Dependendo da forma de uma geometria, o ponto calculado pode ser posicionado fora do pol&iacute;gono <a href='http://postgis.refractions.net/documentation/manual-svn/ST_Centroid.html' target=blank>exemplo</a>.",
				"es": "Los centr&oacute;ides son los puntos ubicados en el centro de masa de una geometr&iacute;a. Para generar los centr&oacute;ides es necesario seleccionar algunas entidades de un tema. Utilice para ello la opci&oacute;n de selecci&oacute;n o la tabla de atributos del tema deseado.<br>Dependiendo de la forma de una figura geom&eacute;trica el punto calculado se puede colocar fuera del pol&iacute;gono. <a href='http://postgis.refractions.net/documentation/manual-svn/ST_Centroid.html'>Ejemplo</a>.",
				"en": "Centroids are the points located in the center of mass of a geometry. To generate centroids, it is necessary to select some theme features. To do this, use the selection option or the attribute table of the selected theme.<br>Depending on the geometric shape, the computed point can be placed outside the polygon. <a href='http://postgis.refractions.net/documentation/manual-svn/ST_Centroid.html' target=blank>Example</a>.",
				"apijs": "i3GEO.analise.dialogo.centroide()"
			},
			"22": {
				"titulo": {
					"pt": "Dissolver",
					"es": "Disolver",
					"en": "Dissolve"
				},
				"diretorio": "i3geo/ferramentas/dissolve",
				"categoria": "3",
				"pt": "Essa ferramenta transforma v&aacute;rios pol&iacute;gonos em um s&oacute; eliminando as divisas entre eles. Para definir quais os pol&iacute;gonos devem ser unidos uns com os outros &eacute; preciso escolher um item da tabela de atributos do tema. Os pol&iacute;gonos que possu&iacute;rem o mesmo valor ser&atilde;o considerados no mesmo grupo e suas divisas eliminadas. Caso n&atilde;o tenha sido escolhido nenhum item, todas os pol&iacute;gonos ser&atilde;o agrupados em um s&oacute;.<br>O resultado final ser&aacute; um novo tema com pol&iacute;gonos diferentes dos originais e cuja tabela de atributos conter&aacute; apenas o item escolhido. Caso as geometrias originais possuam fronteiras n&atilde;o ajustadas exatamente, o resultado pode apresentar pequenos pol&iacute;gonos internos.",
				"es": "Esta herramienta transforma varios pol&iacute;gonos en un pol&iacute;gono &uacute;nico eliminando las divisiones entre ellos. Para definir cu&aacute;les pol&iacute;gonos deben estar unidos unos con otros es necesario elegir un campo de la tabla de atributos del tema. Los pol&iacute;gonos que tengan el mismo valor ser&aacute;n considerados en el mismo grupo y sus divisiones eliminadas. Si no se ha seleccionado ning&uacute;n campo todos los pol&iacute;gonos se agrupar&aacute;n en uno solo.<br>El resultado final ser&aacute; un  tema nuevo con pol&iacute;gonos diferentes a los originales y cuya tabla de atributos contendr&aacute; solo el campo seleccionado. Si las geometr&iacute;as originales poseen l&iacute;mites no ajustadas exactamente el resultado puede presentar peque&ntilde;os pol&iacute;gonos internos.",
				"en": "This tool transforms several polygons into a single polygon eliminating boundaries between them. To define which polygons must be joined with each other, it is necessary to select a field from the attribute table of the theme. Polygons with the same value will be considered in the same group and their boundaries eliminated. If no field is selected, all polygons will be grouped into a single one.<br>The final result will be a new theme with polygons different from the original ones and whose attribute table will contain only the selected field. If the original geometries have unadjusted limits, the result may have small inner polygons.",
				"apijs": "i3GEO.analise.dialogo.dissolve()"
			},
			"23": {
				"titulo": {
					"pt": "An&aacute;lise de geometrias",
					"es": "An&aacute;lise de geometrias",
					"en": "Geometry analysis"
				},
				"diretorio": "i3geo/ferramentas/analisageometrias",
				"categoria": "3",
				"pt": "Essa ferramenta permite processar elementos constituintes de um ou mais temas por meio de fun&ccedil;&otilde;es que atuam sobre a geometria que define o elemento. Essas fun&ccedil;&otilde;es possibilitam a realiza&ccedil;&atilde;o de c&aacute;lculos, como &aacute;rea e per&iacute;metro, e cruzamentos entre geometrias, como uni&atilde;o e intersec&ccedil;&atilde;o. Para utilizar a ferramenta, deve-se selecionar cada elemento desejado e convert&ecirc;-los em uma geometria ou conjunto de geometrias. Feito isso, as geometrias convertidas podem ser utilizadas nas opera&ccedil;&otilde;es.<br>Para selecionar elementos, utilize as op&ccedil;&otilde;es de sele&ccedil;&atilde;o dispon&iacute;veis no i3Geo ou ent&atilde;o clique no mapa no elemento desejado ap&oacute;s ativar a ferramenta. A sele&ccedil;&atilde;o &eacute; feita sobre o tema escolhido. Para ver as geometrias capturadas, clique na guia 'listar'. Para usar as op&ccedil;&otilde;es de an&aacute;lise, mostradas na guia 'an&aacute;lise', voc&ecirc; deve marcar as geometrias desejadas na guia 'listar'.",
				"es": "Esta herramienta permite procesar las entidades que constituyen a uno o m&aacute;s temas por medio de funciones que act&uacute;an sobre la geometr&iacute;a que define la entidad. Estas funciones posibilitan efectuar c&aacute;lculos como &aacute;rea y per&iacute;metro, y cruces entre geometr&iacute;as como uni&oacute;n e intersecci&oacute;n. Para utilizar esta herramienta se debe seleccionar cada entidad deseada y convertirlas en una geometr&iacute;a o conjunto de geometr&iacute;as. Hecho esto, las geometr&iacute;as convertidas se pueden utilizar en las operaciones.<br>Para seleccionar entidades utilice las opciones de selecci&oacute;n disponibles en i3Geo, o active la herramienta y haga clic en el mapa sobre la entidad deseada. La selecci&oacute;n se hace sobre el tema elegido. Para ver las geometr&iacute;as capturadas, haga clic en la pesta&ntilde;a 'lista'. Para utilizar las opciones de an&aacute;lisis mostradas en la pesta&ntilde;a de an&aacute;lisis, debe marcar las geometr&iacute;as deseadas en la pesta&ntilde;a 'lista'.",
				"en": "This tool allows you to process features that make up one or more themes by using functions that are executed on the geometry that defines a feature. These functions make it possible to perform calculations such as area and perimeter, and overlay operations such as union and intersection. To use this tool, you must select the features you want to process and converting them into a geometry or set of geometries. Once this is done, the converted geometries can be used in operations.<br>To select features, use the selection options available in i3Geo or after activating the tool, click on the map over the feature you want to process. The selection is made on the selected theme. To see the captured geometries, click on the 'list' tab. To use the analysis options displayed in the analysis tab, you must mark the desired geometries in the 'list' tab.",
				"apijs": "i3GEO.analise.dialogo.analisaGeometrias()"
			},
			"24": {
				"titulo": {
					"pt": "Entorno (buffer)",
					"es": "Entorno (buffer)",
					"en": "Buffer"
				},
				"diretorio": "i3geo/ferramentas/buffer",
				"categoria": "3",
				"pt": "O entorno, ou buffer, &eacute; um pol&iacute;gono que circunda um elemento geogr&aacute;fico em uma dist&acirc;ncia fixa. Para o c&aacute;lculo de dist&acirc;ncia o i3Geo utiliza a proje&ccedil;&atilde;o polic&ocirc;nica. Os atributos do tema alvo s&atilde;o copiados para os pol&iacute;gonos resultantes e uma nova camada &eacute; adicionada ao mapa. Opcionalmente, os pol&iacute;gonos resultantes podem ser unidos como um &uacute;nico.<br>Para gerar o entorno, voc&ecirc; precisa selecionar alguns elementos de um tema. Utilize para isso a op&ccedil;&atilde;o de sele&ccedil;&atilde;o ou a tabela de atributos do tema desejado. O buffer pode ser gerado tamb&eacute;m por meio da ferramenta de identifica&ccedil;&atilde;o.",
				"es": "El entorno o buffer es un pol&iacute;gono que circunda una entidad geogr&aacute;fica a una distancia fija. Para el c&aacute;lculo de distancia i3Geo utiliza la proyecci&oacute;n polic&oacute;nica. Los atributos del tema objetivo se copian en los pol&iacute;gonos resultantes y se a&ntilde;ade una capa nueva al mapa. Opcionalmente, los pol&iacute;gonos resultantes se pueden unir.<br>Para generar el entorno es necesario seleccionar algunas entidades de un tema. Utilice para ello la opci&oacute;n de selecci&oacute;n o la tabla de atributos del tema deseado. El buffer puede ser generado tambi&eacute;n a trav&eacute;s de la herramienta de identificaci&oacute;n.",
				"en": "A buffer is a polygon around a map feature measured in units of distance. For distance calculation i3Geo uses the polyconic projection. The attributes of the target theme are copied into the resulting polygons and a new layer is added to the map. Optionally, the resulting polygons can be joined.<br>In order to generate a buffer, it is necessary to select some features of a theme. To do this, use the selection option or the attribute table of the selected theme. A buffer can also be generated through the identification tool.",
				"apijs": "i3GEO.analise.dialogo.buffer()"
			},
			"25": {
				"titulo": {
					"pt": "Agrupa elementos",
					"es": "Agrupa entidades",
					"en": "Group features"
				},
				"diretorio": "i3geo/ferramentas/agrupaelementos",
				"categoria": "3",
				"pt": "Essa ferramenta transforma v&aacute;rios elementos selecionados de um tema em um s&oacute; criando pol&iacute;gonos agrupados. Para definir quais elementos devem ser unidos uns com os outros &eacute; preciso escolher um item da tabela de atributos do tema. Os elementos que possu&iacute;rem o mesmo valor nesse item ser&atilde;o considerados no mesmo grupo e suas divisas eliminadas. Caso n&atilde;o tenha sido escolhido nenhum item, todas os elementos ser&atilde;o agrupados em um s&oacute;.<br>O resultado final ser&aacute; um novo tema com pol&iacute;gonos diferentes dos originais e cuja tabela de atributos conter&aacute; apenas o item escolhido.",
				"es": "Esta herramienta transforma varias entidades seleccionadas de un tema en una entidad creando pol&iacute;gonos agrupados. Para definir cu&aacute;les entidades deben ser unidas unas con otras es necesario elegir un campo de la tabla de atributos del tema. Las entidades que tengan el mismo valor para ese campo ser&aacute;n consideradas en el mismo grupo y sus divisiones eliminadas. Si no se ha seleccionado ninguna entidad, todas se agrupar&aacute;n en una entidad &uacute;nica.<br>El resultado final ser&aacute; un tema nuevo con pol&iacute;gonos diferentes a los originales y cuya tabla de atributos contendr&aacute; solo el campo seleccionado.",
				"en": "This tool transforms various selected features of a theme into a feature by grouping polygons. To define which features should be linked to each other, it is necessary to select a field from the attribute table of the theme. Features that have the same value for that field will be considered in the same group and their boundaries eliminated. If no feature is selected, all features will be grouped into a single feature.<br>The final result will be a new theme with polygons different from the original ones and whose attribute table will contain only the selected field.",
				"apijs": "i3GEO.analise.dialogo.agrupaElementos()"
			},
			"26": {
				"titulo": {
					"pt": "Upload de arquivo DBF ou CSV",
					"es": "Carga de archivo DBF o CSV",
					"en": "Upload DBF or CSV file"
				},
				"diretorio": "i3geo/ferramentas/uploaddbf",
				"categoria": "4",
				"pt": "Utilize essa op&ccedil;&atilde;o para acrescentar um tema baseado nas coordenadas x e y presentes em uma tabela DBF ou arquivo CSV. Os valores de x e y devem utilizar '.' como separador de decimal. Se as coordenadas estiverem na proje&ccedil;&atilde;o geogr&aacute;fica, os valores dever&atilde;o estar em d&eacute;cimos de grau, com sinal negativo para pontos ao sul do equador e oeste do meridiano 0.<br>O arquivo DBF ou CSV ser&aacute; armazenado no servidor onde o i3geo est&aacute; instalado e permanecer&aacute; l&aacute; at&eacute; que os arquivos tempor&aacute;rios sejam apagados. N&atilde;o utilize essa op&ccedil;&atilde;o se existir alguma restri&ccedil;&atilde;o ao uso do arquivo e se a pol&iacute;tica de acesso aos dados, definidas pela entidade que hospeda o i3geo, n&atilde;o for compat&iacute;vel com essas restri&ccedil;&otilde;es.",
				"es": "Utilice esta opci&oacute;n para a&ntilde;adir un tema basado en las coordenadas x e y presentes en una tabla DBF o archivo CSV. Los valores de x e y deben utilizar '.' como separador de decimal. Si las coordenadas est&aacute;n en la proyecci&oacute;n geogr&aacute;fica, los valores deber&aacute;n estar en grados decimales con signo negativo para puntos al sur del ecuador y al oeste del meridiano 0.<br>El archivo DBF o CSV se almacenar&aacute; en el servidor donde est&aacute; instalado i3geo y permanecer&aacute; all&iacute; hasta que se borren los archivos temporales. No utilice esta opci&oacute;n si hay alguna restricci&oacute;n en el uso del archivo y si la pol&iacute;tica de acceso a los datos definida por la entidad que aloja i3geo, no es compatible con estas condiciones.",
				"en": "Use this option to add a theme based on x and y coordinates contained in a DBF table or CSV file. x and y values must use '.' as decimal separator. If coordinates are in geographical projection, x and y values must be in decimal degrees with a negative sign for points in the southern hemisphere and west of the prime meridian.<br>The DBF or CSV file will be stored on the server where i3geo is installed and will remain there until temporary files are deleted. Do not use this option if there is any restriction on file access and if the data access policy defined by the organization hosting i3geo is not compatible with these conditions.",
				"apijs": "i3GEO.arvoreDeTemas.dialogo.uploaddbf()"
			},
			"27": {
				"titulo": {
					"pt": "Upload de shapefile",
					"es": "Carga de shapefile",
					"en": "Shapefile uploading"
				},
				"diretorio": "i3geo/ferramentas/upload",
				"categoria": "4",
				"pt": "Permite que um arquivo do tipo shapefile seja enviado ao servidor e inclu&iacute;do no mapa como uma nova camada. O arquivo shapefile ser&aacute; armazenado no servidor onde o i3Geo est&aacute; instalado e permanecer&aacute; l&aacute; at&eacute; que os arquivos tempor&aacute;rios sejam apagados. Um shapefile &eacute; composto basicamente por tr&ecirc;s tipos de arquivos (dbf, shp e shx), todos devem ser submetidos.<br>A inclus&atilde;o de um arquivo prj &eacute; opcional. Caso ele seja inclu&iacute;do o sistema ir&aacute; utiliz&aacute;-lo para definir o sistema de refer&ecirc;ncia da camada. Se o arquivo n&atilde;o for inclu&iacute;do o usu&aacute;rio dever&aacute; informar o sistema de refer&ecirc;ncia a partir da lista no formul&aacute;rio.<br>N&atilde;o utilize essa op&ccedil;&atilde;o se existir alguma restri&ccedil;&atilde;o ao uso do arquivo e se a pol&iacute;tica de acesso aos dados, definidas pela entidade que hospeda o i3geo, n&atilde;o for compat&iacute;vel com essas restri&ccedil;&otilde;es.",
				"es": "Permite que un archivo del tipo shapefile sea enviado al servidor e incluido en el mapa como una capa nueva. El archivo shapefile ser&aacute; almacenado en el servidor donde el i3Geo est&aacute; instalado y permanecer&aacute; ah&iacute; hasta que los archivos temporales sean borrados. Un shapefile se compone b&aacute;sicamente de tres tipos de archivos (dbf, shp y shx), todos deben ser enviados.<br>La inclusi&oacute;n de un archivo .prj es opcional. Si se incluye el sistema lo utilizar&aacute; para definir el sistema de referencia de la capa. Si el archivo no se incluye, el usuario debe escoger el sistema de referencia a partir de la lista en el formulario.<br>No utilice esta opci&oacute;n si hay alguna restricci&oacute;n de uso del archivo y si la pol&iacute;tica de acceso a datos, definida por la entidad que aloja i3geo, no es compatible con estas condiciones.",
				"en": "Allows you to send a shapefile to the server and add it to the map as a new layer. The shapefile will be stored on the server where i3Geo is installed and will remain there until temporary files are deleted. A shapefile is basically made up of three types of files (dbf, shp and shx), all this files must be sent to the server.<br>The .prj file inclusion is optional. If you include it, it will be used to define the layer reference system. If the .prj file is not included, the user must choose the reference system from the list on the form.<br>Do not use this option if there is any restriction on file access and if the data access policy defined by the organization hosting i3geo is not compatible with these conditions.",
				"apijs": "i3GEO.arvoreDeTemas.dialogo.upload()"
			},
			"28": {
				"titulo": {
					"pt": "Conex&atilde;o WMS",
					"es": "Conexi&oacute;n WMS",
					"en": "WMS connection"
				},
				"diretorio": "i3geo/ferramentas/conectarwms",
				"categoria": "4",
				"pt": "Uma conex&atilde;o WMS permite que dados dispon&iacute;veis em outros servidores sejam inclu&iacute;dos como camadas no i3Geo. Na ferramenta de conex&atilde;o &eacute; mostrada uma lista de endere&ccedil;os previamente cadastrados, mas pode-se digitar um outro endere&ccedil;o qualquer, desde que seja um servi&ccedil;o no padr&atilde;o WMS. Ap&oacute;s um servi&ccedil;o ser escolhido, a lista de camadas dispon&iacute;veis &eacute; mostrada na guia 'Camadas inclu&iacute;das'.<br>Camadas obtidas por meio de conex&atilde;o WMS n&atilde;o permitem que algumas opera&ccedil;&otilde;es dispon&iacute;veis no i3Geo sejam executadas, como por exemplo a altera&ccedil;&atilde;o na legenda, sele&ccedil;&atilde;o, entre outras. Quando um servidor apresentar problemas, a camada n&atilde;o poder&aacute; ser adicionada.",
				"es": "Una conexi&oacute;n WMS permite que los datos disponibles en otros servidores se incluyan como capas en i3Geo. En la herramienta de conexi&oacute;n se muestra una lista de direcciones previamente registradas, pero se puede escribir otra direcci&oacute;n cualquiera, siempre que sea un servicio en el est&aacute;ndar WMS. Una vez que se haya elegido un servicio, la lista de capas disponibles se muestra en la pesta&ntilde;a 'Capas incluidas'.<br>Las capas obtenidas a trav&eacute;s de la conexi&oacute;n WMS no permiten que algunas operaciones disponibles en i3Geo se ejecuten, como por ejemplo  la modificaci&oacute;n de la leyenda, selecci&oacute;n, entre otras. Cuando un servidor presenta problemas no se puede agregar la capa.",
				"en": "A WMS connection allows data available on other servers to be included as layers in i3Geo. A list of previously registered addresses is displayed in the connection tool, but any other address can be entered, provided it is a service in WMS standard. Once a service is selected, the available layer list is displayed in the 'Included layers' tab.<br>Layers obtained through the WMS connection do not allow to execute some operations available in i3Geo, such as legend modification, selection, and so on. When a server has issues a layer cannot be added.",
				"apijs": "i3GEO.arvoreDeTemas.dialogo.conectaservico()"
			},
			"29": {
				"titulo": {
					"pt": "Conex&atilde;o GeoRSS",
					"es": "Conexi&oacute;n GeoRSS",
					"en": "GeoRSS connection"
				},
				"diretorio": "i3geo/ferramentas/conectargeorss",
				"categoria": "4",
				"pt": "Uma conex&atilde;o GeoRSS permite obter a localiza&ccedil;&atilde;o de conte&uacute;dos dispon&iacute;veis no formato RSS com coordenadas geogr&aacute;ficas inclu&iacute;das. Na ferramenta de conex&atilde;o &eacute; mostrada uma lista de endere&ccedil;os previamente cadastrados, mas pode-se digitar um outro endere&ccedil;o qualquer, desde que seja um servi&ccedil;o no padr&atilde;o GeoRSS.<br>A camada adicionada ao mapa baseia-se em um arquivo shapefile criado temporariamente pelo i3Geo. Caso o servi&ccedil;o GeoRSS sofra altera&ccedil;&otilde;es, como a inclus&atilde;o de um novo item, &eacute; necess&aacute;rio fazer novamente a conex&atilde;o para que a camada reflita a altera&ccedil;&atilde;o.",
				"es": "Una conexi&oacute;n GeoRSS permite obtener la ubicaci&oacute;n de contenidos disponibles en formato RSS con coordenadas geogr&aacute;ficas incluidas. En la herramienta de conexi&oacute;n se muestra una lista de direcciones previamente registradas, pero se puede escribir otra direcci&oacute;n cualquiera siempre que sea un servicio en el est&aacute;ndar GeoRSS.<br>La capa agregada al mapa se basa en un archivo shapefile creado temporalmente por  i3Geo. Si el servicio GeoRSS sufre cambios, como la inclusi&oacute;n de una entidad nueva, es necesario volver a establecer la conexi&oacute;n para que la capa refleje el cambio.",
				"en": "A GeoRSS connection allows you to obtain locations of available contents in RSS format including their geographic coordinates. A list of previously registered addresses is displayed in the connection tool, but any other address can be entered whenever it is a service in GeoRSS standard.<br>The layer added to the map is a temporary shapefile created by i3Geo. If the GeoRSS service undergoes changes, such as the inclusion of a new feature, it is necessary to re-establish the connection so that changes are reflected by the layer.",
				"apijs": "i3GEO.arvoreDeTemas.dialogo.conectaservico()"
			},
			"30": {
				"titulo": {
					"pt": "Nuvem de tags",
					"es": "Nube de etiquetas",
					"en": "Tag cloud"
				},
				"diretorio": "i3geo/ferramentas/nuvemtags",
				"categoria": "4",
				"pt": "A nuvem de tags &eacute; uma forma de localizar camadas dispon&iacute;veis para ser vistas no mapa. A busca &eacute; feita por meio de tags ou palavras-chave. As tags s&atilde;o registradas pelo administrador do i3Geo para cada tema dispon&iacute;vel na &aacute;rvore de temas.<br>Ao escolher uma tag, &eacute; realizada uma busca dos temas correspondentes e o resultado &eacute; adicionado &agrave; arvore de temas. Opcionalmente, o usu&aacute;rio pode escolher navegar na nuvem 'animada' que mostra as tags como um globo 3d.",
				"es": "La nube de etiquetas es una forma de localizar las capas disponibles para ser vistas en el mapa. La b&uacute;squeda se realiza a trav&eacute;s de etiquetas o palabras claves. Las etiquetas se registran a trav&eacute;s del administrador de i3Geo para cada tema disponible en el &aacute;rbol de temas.<br>Al elegir una etiqueta, se realiza una b&uacute;squeda de los temas correspondientes y el resultado se a&ntilde;ade al &aacute;rbol de temas. Opcionalmente, el usuario puede elegir navegar en la nube 'animada' que muestra las etiquetas como un globo 3D.",
				"en": "The tag cloud is a way to find available layers to be seen on the map. The searching is done through tags or keywords. Tags are registered by the i3Geo administrator for each theme available in the theme tree.<br>When choosing a label, it is performed a search for the corresponding themes and the result is added to the theme tree. Optionally, the user can choose to navigate in the 'animated' cloud that shows labels as a 3D globe.",
				"apijs": "i3GEO.arvoreDeTemas.dialogo.nuvemTags()"
			},
			"31": {
				"titulo": {
					"pt": "Procurar tema",
					"es": "Buscar tema",
					"en": "Search theme"
				},
				"diretorio": "classe_arvoredetemas.js",
				"categoria": "4",
				"pt": "Localiza temas dispon&iacute;veis nos menus da &aacute;rvore de adi&ccedil;&atilde;o de temas. Os temas localizados s&atilde;o inclu&iacute;dos em um novo n&oacute; da &aacute;rvore, possibilitando sua adi&ccedil;&atilde;o ao mapa.<br>Para procurar um tema, digite a palavra ou frase no campo de texto e clique no &iacute;cone existente no lado direito. O resultado da busca aparecer&aacute; como um n&oacute; na &aacute;rvore de temas do cat&aacute;logo.",
				"es": "Localiza temas disponibles en los men&uacute;s del &aacute;rbol de adici&oacute;n de temas. Los temas localizados se incluyen en un nuevo nodo del &aacute;rbol, posibilitando su adici&oacute;n al mapa.<br>Para buscar un tema, escriba la palabra o frase en el campo de texto y haga clic en el icono del lado derecho. El resultado de la b&uacute;squeda aparecer&aacute; como un nodo en el &aacute;rbol de temas del cat&aacute;logo.",
				"en": "Locates themes available on the theme addition tree menus. The found themes are included in a new node of the tree, allowing its addition to the map.<br>To search for a theme, type a word or phrase in the text field and click on the icon on the right side. The search result will appear as a node in the theme tree of the catalog.",
				"apijs": "i3GEO.arvoreDeTemas.buscaTema(palavra)"
			},
			"32": {
				"titulo": {
					"pt": "Acesso aos arquivos do servidor",
					"es": "Acceso a los archivos del servidor",
					"en": "Access to server files"
				},
				"diretorio": "classe_arvoredetemas.js",
				"categoria": "4",
				"pt": "Os usu&aacute;rios cadastrados no i3Geo como editores podem acessar arquivos existentes no servidor onde o i3Geo est&aacute; instalado. A navega&ccedil;&atilde;o permite localizar arquivos shapefile para inclus&atilde;o como uma nova camada no mapa.<br>Por motivos de seguran&ccedil;a, apenas os editores podem utilizar essa op&ccedil;&atilde;o. O cadastramento &eacute; feito pelo administrador do i3Geo, por meio da edi&ccedil;&atilde;o do arquivo ms_configura.php.",
				"es": "Los usuarios registrados en i3Geo como editores pueden acceder a los archivos del servidor en el que est&aacute; instalado i3Geo. La navegaci&oacute;n permite localizar archivos shapefile para su inclusi&oacute;n como una capa nueva en el mapa.<br>Por motivos de seguridad, solo los editores pueden utilizar esta opci&oacute;n. El registro es hecho por el administrador de i3Geo por medio de la edici&oacute;n del archivo ms_configura.php.",
				"en": "Users registered in i3Geo as publishers can access files on the server where i3Geo is installed. Browsing allows you to locate a shapefile for inclusion as a new layer on the map.<br>For security reasons, only publishers can use this option. The registration is made by the i3Geo administrator by editing the ms_configura.php file.",
				"apijs": "i3GEO.arvoreDeTemas.montaDir(node)"
			},
			"33": {
				"titulo": {
					"pt": "&Aacute;rvore de endere&ccedil;os WMS",
					"es": "&Aacute;rbol de direcciones WMS",
					"en": "WMS address tree"
				},
				"diretorio": "classe_arvoredetemas.js",
				"categoria": "4",
				"pt": "A conex&atilde;o com servi&ccedil;os WMS (OGC) pode ser feita escolhendo-se o servidor e as camadas dispon&iacute;veis diretamente na &aacute;rvore de temas. A lista de endere&ccedil;os utilizada nesse n&oacute; da &aacute;rvore &eacute; a mesma utilizada na op&ccedil;&atilde;o de conex&atilde;o que &eacute; aberta por meio do &iacute;cone 'Conex&atilde;o WMS'. Quando uma camada for encontrada no WMS, &eacute; mostrado um 'box' ao lado do nome da camada, permitindo sua adi&ccedil;&atilde;o ao mapa.<br>A vantagem do uso da &aacute;rvore &eacute; a velocidade de acesso &agrave; lista de camadas, uma vez que o i3Geo faz um 'cache' do arquivo XML gerado com a lista de camadas dispon&iacute;veis. A &aacute;rvore permite ainda a vis&atilde;o correta da hierarquia de camadas configuradas no WMS, que pode ter v&aacute;rios n&iacute;veis. Cada vez que um usu&aacute;rio tenta acessar um WMS o sucesso ou n&atilde;o da conex&atilde;o &eacute; registrado, assim, &eacute; poss&iacute;vel mostrar ao lado de cada endere&ccedil;o o percentual de tentativas de conex&atilde;o v&aacute;lidas.",
				"es": "La conexi&oacute;n con los servicios WMS (OGC) se puede hacer eligiendo el servidor y las capas disponibles directamente en el &aacute;rbol de temas. La lista de direcciones utilizada en ese nodo del &aacute;rbol es la misma utilizada en la opci&oacute;n de conexi&oacute;n que se abre a trav&eacute;s del icono 'Conexi&oacute;n WMS'. Cuando se encuentra una capa en el WMS, se muestra una casilla de verificaci&oacute;n junto al nombre de la capa, permitiendo su adici&oacute;n al mapa.<br>La ventaja del uso del &aacute;rbol es la velocidad de acceso a la lista de capas, ya que i3Geo hace un cach&eacute; del archivo XML generado con la lista de capas disponibles. El &aacute;rbol permite adem&aacute;s la visualizaci&oacute;n correcta de la jerarqu&iacute;a de capas configuradas en el WMS, que puede tener varios niveles. Cada vez que un usuario intenta acceder a un WMS el &eacute;xito o no de la conexi&oacute;n se registra, por lo que es posible mostrar al lado de cada direcci&oacute;n el porcentaje de intentos de conexi&oacute;n v&aacute;lidos.",
				"en": "WMS services (OGC) connection can be done by selecting the server and the available layers directly on the theme tree. The address list used for that tree node is the same used for the connection option that is opened through the 'WMS Connection' icon. When the WMS finds a layer, a check box will be displayed next to the layer name that allows you to add the layer to the map.<br>The advantage of using the tree is that it speeds up accessing the layer list, since i3Geo caches the generated XML file with the list of available layers. The tree also allows to display properly the layer hierarchy configured in the WMS, which can have various levels. Every time a user tries to access a WMS, a succeed or failed connection is recorded, so it is possible to show beside each address the percentage of valid connection attempts.",
				"apijs": "i3GEO.arvoreDeTemas.listaWMS(node)"
			},
			"34": {
				"titulo": {
					"pt": "Sistemas",
					"es": "Sistemas",
					"en": "Systems"
				},
				"diretorio": "classe_arvoredetemas.js",
				"categoria": "4",
				"pt": "O n&oacute; 'Sistemas' da &aacute;rvore de adi&ccedil;&atilde;o de temas, lista aplicativos especiais que precisam de intera&ccedil;&atilde;o com o usu&aacute;rio para a cria&ccedil;&atilde;o de uma camada.<br>Alguns sistemas s&atilde;o fornecidos com a instala&ccedil;&atilde;o padr&atilde;o do i3Geo, mas cada administrador pode criar seus pr&oacute;prios.",
				"es": "El nodo 'Sistemas' del &aacute;rbol de adici&oacute;n de temas, enumera las aplicaciones especiales que necesitan interactuar con el usuario para crear una capa.<br>Algunos sistemas se suministran con la instalaci&oacute;n est&aacute;ndar de i3Geo, pero cada administrador puede crear sus propios sistemas.",
				"en": "The node 'Systems' of the theme addition tree, lists special applications that need to interact with the user to create a layer.<br>Some systems are supplied with the standard i3Geo installation, but each administrator can create his/her own system.",
				"apijs": "i3GEO.arvoreDeTemas.listaSistemas(g_sid,g_locaplic,funcao)"
			},
			"35": {
				"titulo": {
					"pt": "Procurar ocorr&ecirc;ncias",
					"es": "Buscar sucesos",
					"en": "Search for occurrences"
				},
				"diretorio": "i3geo/ferramentas/busca",
				"categoria": "5",
				"pt": "Cada tema possui um conjunto de dados descritivos associados aos elementos geogr&aacute;ficos (tabela de atributos). A op&ccedil;&atilde;o 'procurar' realiza uma pesquisa nesses atributos e localiza as correspond&ecirc;ncias. O resultado &eacute; mostrado em uma lista de elementos que permite destacar cada um deles.<br>Para fazer a busca deve-se selecionar em quais itens da tabela de atributos a mesma ser&aacute; feita, podendo-se escolher mais de um. A busca pode ser feita no mapa todo ou apenas na regi&atilde;o vis&iacute;vel do mapa.",
				"es": "Cada tema posee un conjunto de datos descriptivos asociados con las entidades geogr&aacute;ficas (tabla de atributos). La opci&oacute;n de b&uacute;squeda realiza una exploraci&oacute;n en estos atributos y busca las coincidencias. El resultado se muestra en una lista de entidades que permiten destacar cada una de ellas.<br>Para efectuar la b&uacute;squeda se debe seleccionar en cu&aacute;l campo de la tabla de atributos se llevar&aacute; a cabo esta operaci&oacute;n, pudi&eacute;ndose escoger m&aacute;s de un campo. La b&uacute;squeda se puede hacer en todo el mapa o solamente en su regi&oacute;n visible.",
				"en": "Each theme has a set of descriptive data associated with geographic features (attribute table). The search option explores these attributes and looks for matches. The result is shown in a list of features where each of them is highlighted.<br>In order to perform the searching, you must select in which field of the attribute table this operation will be carried out. You can select more than one field. The searching can be done on the whole map or only in its visible region.",
				"apijs": "i3GEO.tema.dialogo.procuraratrib()"
			},
			"36": {
				"titulo": {
					"pt": "Topon&iacute;mia",
					"es": "Toponimia",
					"en": "Toponymy"
				},
				"diretorio": "i3geo/ferramentas/toponimia",
				"categoria": "5",
				"pt": "As topon&iacute;mias s&atilde;o os textos mostrados no mapa que identificam lugares ou elementos que constituem um tema. Os textos s&atilde;o baseados na tabela de atributos de cada tema, que cont&ecirc;m os dados descritivos de cada elemento.<br>Ao inserir uma topon&iacute;mia, um novo tema &eacute; adicionado ao mapa, podendo ser exclu&iacute;do ou movimentado. Dessa forma &eacute; poss&iacute;vel incluir mais de um tema com a topon&iacute;mia. Ao inserir a topon&iacute;mia deve-se escolher o item da tabela de atributos e, caso necess&aacute;rio, pode-se modificar as op&ccedil;&otilde;es padr&atilde;o de simbologia utilizadas nos textos, como fonte, cor, m&aacute;scara, etc. &Eacute; poss&iacute;vel ainda testar as op&ccedil;&otilde;es antes de concluir a inclus&atilde;o da topon&iacute;mia.",
				"es": "Las toponimias son los textos mostrados en el mapa que identifican lugares o entidades que constituyen un tema. Los textos se basan en la tabla de atributos de cada tema, que contienen los datos descriptivos de cada entidad.<br>Al insertar una toponimia, un tema nuevo se a&ntilde;ade al mapa, pudiendo ser excluido o movido. De esta forma es posible incluir m&aacute;s de un tema con la toponimia. Al insertar la toponimia se debe elegir el campo de la tabla de atributos y si es necesario, se pueden modificar las opciones por defecto de las simbolog&iacute;as utilizadas en los textos, como la fuente, el color, la m&aacute;scara, etc. Tambi&eacute;n puede probar las opciones antes de completar la inclusi&oacute;n de la toponimia.",
				"en": "Toponymy refers to texts shown on the map that identify places or features that make up a theme. Texts are based on the table of attributes of each theme, that contain descriptive data of each feature.<br>When inserting a toponymy, a new theme is added to the map that could be deleted or moved. In this way, it is possible to include more than one theme with toponymy. When inserting a toponymy, you must select a field from the attribute table. You can also modify default options of text symbology, such as font, color, mask, etc. You can also try out some options before adding a toponymy.",
				"apijs": "i3GEO.tema.dialogo.toponimia()"
			},
			"37": {
				"titulo": {
					"pt": "Etiquetas",
					"es": "Etiquetas",
					"en": "Labels"
				},
				"diretorio": "i3geo/ferramentas/etiqueta",
				"categoria": "5",
				"pt": "As etiquetas s&atilde;o textos descritivos mostrados no mapa quando o usu&aacute;rio clica sobre um elemento no mapa utilizando a ferramenta etiqueta presente na barra de bot&otilde;es. Esta ferramenta configura quais itens da tabela de atributos do tema estar&atilde;o presentes na apresenta&ccedil;&atilde;o da etiqueta.<br>&Eacute; tamb&eacute;m por aqui que o usu&aacute;rio define o item que ser&aacute; objeto de busca pela ferramenta equivalente e os itens que estar&atilde;o vis&iacute;veis na janela &lsquo;Identifica&rsquo;, que s&atilde;o as informa&ccedil;&otilde;es mais detalhadas dispon&iacute;veis a partir do &iacute;cone &lsquo;+&rsquo; na janela da etiqueta.",
				"es": "Las etiquetas son textos descriptivos mostrados en el mapa cuando el usuario hace clic sobre una entidad en el mapa utilizando la herramienta de etiqueta de la barra de botones. Con esta herramienta se configura los campos de la tabla de atributos del tema que estar&aacute;n presentes en la presentaci&oacute;n de la etiqueta.<br>Igualmente, esta herramienta permite al usuario definir el campo que ser&aacute; objeto de b&uacute;squeda a trav&eacute;s de herramientas similares y los campos que se visualizar&aacute;n  en la ventana 'Identificaci&oacute;n', que es la informaci&oacute;n m&aacute;s detallada disponible a trav&eacute;s del icono '+' en la ventana de la etiqueta.",
				"en": "Labels are descriptive texts displayed on the map when a user clicks on a feature on the map using the label tool of the button bar. With this tool you can establish which fields of the table of attributes will be take into account for label presentation.<br>Likewise, this tool allows the user to define a field that will be used for searching by similar tools, and also fields that will be displayed in the 'Identification' window, that will be the most detailed information available through the '+' icon in the label window.",
				"apijs": "i3GEO.tema.dialogo.etiquetas()"
			},
			"38": {
				"titulo": {
					"pt": "Filtro",
					"es": "Filtro",
					"en": "Filter"
				},
				"diretorio": "i3geo/ferramentas/filtro",
				"categoria": "5",
				"pt": "Filtrar um tema significa definir um crit&eacute;rio para que um determinado elemento seja mostrado. Esse crit&eacute;rio &eacute; baseado nos dados descritivos (tabela de atributos). Um filtro &eacute; uma express&atilde;o que relaciona os itens da tabela de atributos e seus valores, por exemplo, 'UF' = 'SP', onde 'UF' &eacute; o nome da coluna (item) e 'SP' &eacute; o valor. As express&otilde;es podem ser definidas por meio de um 'construtor' (guia default da ferramenta) ou digitando-se diretamente a express&atilde;o. Veja <a href='http://mapserver.org/mapfile/expressions.html#mapserver-expressions' target='_blank'>como</a>.<br>O usu&aacute;rio pode construir o filtro manualmente, digitando os nomes dos campos e os valores que deseja filtrar, ou por meio do editor de express&otilde;es. Para utilizar o editor de express&otilde;es o usu&aacute;rio deve definir primeiramente o tema e o campo que deseja filtrar. Ao ativar o editor de express&otilde;es os valores &uacute;nicos do campo selecionado ser&atilde;o mostrados numa lista para que o usu&aacute;rio possa compor a express&atilde;o.<br>Cada tema pode ter apenas um filtro. O filtro apenas deixa de mostrar os dados no mapa, ou seja, os dados continuam na tabela de atributos. Antes de aplicar um filtro, pode-se test&aacute;-lo para verificar seu efeito. O construtor de express&otilde;es permite a utiliza&ccedil;&atilde;o de mais de uma coluna, para isso, deve-se adicionar novas linhas e escolher um conector, como 'e' ou 'ou'. Por exemplo, em um tema com os munic&iacute;pios pode-se mostrar apenas aqueles de determinados estados escolhendo-se 'coluna' = 'valor' 'e' 'coluna' = 'valor'.",
				"es": "Filtrar un tema significa definir un criterio para que una determinada entidad sea mostrada. Este criterio se basa en los datos descriptivos (tabla de atributos). Un filtro es una expresi&oacute;n que relaciona los campos de la tabla de atributos y sus valores, por ejemplo, 'UF' = 'SP', donde 'UF' es el nombre de la columna (campo) y 'SP' es el valor. Las expresiones se pueden definir por medio de un constructor (gu&iacute;a por defecto de la herramienta) o escribiendo directamente la expresi&oacute;n. Ver <a href='http://mapserver.org/mapfile/expressions.html#mapserver-expressions' target='_blank'>c&oacute;mo</a>.<br>El usuario puede construir el filtro manualmente escribiendo los nombres de los campos y los valores que desea filtrar, o por medio del editor de expresiones. Para utilizar el editor de expresiones el usuario debe definir primero el tema y el campo que desea filtrar. Al activar el editor de expresiones, los valores &uacute;nicos del campo seleccionado se mostrar&aacute;n en una lista para que el usuario pueda construir la expresi&oacute;n.<br>Cada tema puede tener solo un filtro. El filtro simplemente hace que no se muestren algunos datos en el mapa, es decir, los datos contin&uacute;an en la tabla de atributos. Antes de aplicar un filtro, puede probarlo para comprobar su efecto. El constructor de expresiones permite el uso de m&aacute;s de una columna, para ello, se deben a&ntilde;adir l&iacute;neas nuevas y elegir un conector, como 'y' u 'o'. Por ejemplo, en un tema con los municipios se pueden mostrar solamente aquellos municipios de determinados estados eligiendo 'columna' = 'valor' 'y' 'columna' = 'valor'.",
				"en": "Filtering a theme means defining a criterion to show a certain feature. This criterion is based on descriptive data (attribute table). A filter is an expression that relates fields of the attribute table with their values, for example, 'UF' = 'SP', where 'UF' is the column name (field) and 'SP' is the value. Expressions can be defined through a constructor (default tool guide) or by writing the expression directly. See <a href='http://mapserver.org/mapfile/expressions.html#mapserver-expressions' target='_blank'>how</a>.<br>A user can build a filter expression manually by writing field names and values that he/she wants to filter, or by using the expression editor. To use the expression editor, you must first select a theme and the field that will be filtered. When activating the expression editor, unique values of the selected field will be displayed in a list so that the user can build the expression.<br>Each theme can have only one filter. Generally speaking, filtering simply means that some data will not be shown on the map, that is, data remains in the attribute table. Before applying a filter, you can test it to check its effect. The expression constructor allows you to use of more than one column, to do this you must add new lines and choose a connector, such as 'and' or 'or'. For example, for a theme with municipalities you can only show those municipalities of certain states by typing 'column' = 'value' 'and' 'column' = 'value'.",
				"apijs": "i3GEO.tema.dialogo.filtro()"
			},
			"39": {
				"titulo": {
					"pt": "Tabela",
					"es": "Tabla",
					"en": "Table"
				},
				"diretorio": "i3geo/ferramentas/tabela",
				"categoria": "5",
				"pt": "Cada tema possui informa&ccedil;&otilde;es descritivas associadas a cada elemento, esses dados s&atilde;o conhecidos como 'tabela de atributos'. Essa op&ccedil;&atilde;o mostra os dados existentes na tabela e permite a realiza&ccedil;&atilde;o de uma s&eacute;rie de opera&ccedil;&otilde;es diretamente sobre os registros existentes, como por exemplo, sele&ccedil;&atilde;o, zoom, estat&iacute;sticas, relat&oacute;rios e gr&aacute;ficos.<br>&Eacute; poss&iacute;vel ao usu&aacute;rio remover registros da visualiza&ccedil;&atilde;o da tabela, aproximar a visualiza&ccedil;&atilde;o do mapa para um elemento espec&iacute;fico, remover e ordenar as colunas da tabela. Ao lado de cada registro existe uma caixa que permite marcar os registros. Os registros marcados podem ser selecionados a partir do bot&atilde;o &lsquo;Selecionar&rsquo; e utilizados para criar um novo tema.<br>Como o n&uacute;mero de registros de um tema pode ser grande, os dados s&atilde;o mostrados em p&aacute;ginas.",
				"es": "Cada tema contiene informaci&oacute;n descriptiva asociada con cada entidad, estos datos se conocen como 'tabla de atributos'. Esta opci&oacute;n muestra los datos de la tabla y permite realizar una serie de operaciones directamente sobre los registros existentes, como por ejemplo, selecci&oacute;n, zoom, estad&iacute;sticas, informes y gr&aacute;ficos.<br>El usuario tiene la posibilidad de remover registros de la vista de tabla, acercar la vista del mapa a una entidad espec&iacute;fica, quitar y ordenar las columnas de la tabla. Al lado de cada registro existe una casilla de verificaci&oacute;n que permite marcar los registros. Los registros marcados se pueden seleccionar desde el bot&oacute;n 'Seleccionar' y se utilizan para crear un tema nuevo.<br>Dado que el n&uacute;mero de registros de un tema puede ser grande  los datos se presentan a trav&eacute;s de p&aacute;ginas.",
				"en": "Each theme contains descriptive information associated with each feature, these data are known as 'attribute table'. This option displays data in a table and allows you to perform various operations directly on existing records, such as selection, zoom, statistics, reports and charts.<br>The user can remove records from the table view, zoom in to a specific feature, remove and order columns of the table. Next to each record there is a check box that allows you to mark records. Marked records can be selected from the 'Select' button and are used to create a new theme.<br>Since the number of records of a theme can be large, data is displayed on pages.",
				"apijs": "i3GEO.tema.dialogo.tabela()"
			},
			"40": {
				"titulo": {
					"pt": "Gr&aacute;ficos",
					"es": "Gr&aacute;ficos",
					"en": "Charts"
				},
				"diretorio": "i3geo/ferramentas/graficotema",
				"categoria": "5",
				"pt": "Permite inserir gr&aacute;ficos em cada elemento que comp&otilde;e uma camada para representar valores associados. Para a montagem de cada gr&aacute;fico &eacute; necess&aacute;rio selecionar um tema que contenha os dados que ser&atilde;o representados. Os dados s&atilde;o aqueles que encontram-se na tabela de atributos do tema.<br>Ap&oacute;s selecionado o tema, &eacute; mostrada uma lista com os itens existentes na tabela de atributos. Escolha os itens que ser&atilde;o utilizados no gr&aacute;fico clicando no box que aparece na lista de itens. Cada item ir&aacute; compor uma fatia do gr&aacute;fico. Ao lado do item, &eacute; mostrada a cor que ser&aacute; utilizada na representa&ccedil;&atilde;o. Cada cor &eacute; definida em RGB. Na guia 'propriedades' &eacute; poss&iacute;vel definir propriedades de representa&ccedil;&atilde;o de cada gr&aacute;fico. As defini&ccedil;&otilde;es afetar&atilde;o a forma de cada gr&aacute;fico. Cada gr&aacute;fico adicionado &eacute; inclu&iacute;do no mapa como um novo tema.",
				"es": "Permite insertar gr&aacute;ficos para cada entidad que compone una capa para representar valores asociados. Para la creaci&oacute;n de cada gr&aacute;fico es necesario seleccionar un tema que contenga los datos que ser&aacute;n representados. Los datos son aquellos que se encuentran en la tabla de atributos del tema.<br>Despu&eacute;s de seleccionar el tema, se muestra una lista con los campos de la tabla de atributos. Seleccione los campos que se utilizar&aacute;n en el gr&aacute;fico haciendo clic en la casilla de verificaci&oacute;n que aparece en la lista de campos. Cada campo seleccionado va a formar parte del gr&aacute;fico. Al lado del campo, se muestra el color que se utilizar&aacute; en la representaci&oacute;n. Cada color se establece en RGB. En la pesta&ntilde;a propiedades, puede definir las propiedades de la representaci&oacute;n de cada gr&aacute;fico. La configuraci&oacute;n afectar&aacute; la forma de cada gr&aacute;fico. Cada gr&aacute;fico agregado se incluye en el mapa como un tema nuevo.",
				"en": "It allows you to insert graphics for each feature that makes up a layer to depict associated values. In order to create each chart, it is necessary to select a theme containing data that will be depicted. This data is located in the table of attributes of the theme.<br>After selecting the theme, a list with the fields of the attribute table will be displayed. Select the fields that will be used on the chart by clicking the check box that appears on the field list. Each selected field will be part of the graph. Next to the field, it is displayed a color that will be used for chart depiction. Each color is set in RGB. On the Properties tab, you can define properties of chart depiction. The shape of each chart will be affected by the settings. Each added graphic will be included on the map as a new theme.",
				"apijs": "i3GEO.tema.dialogo.graficotema()"
			},
			"41": {
				"titulo": {
					"pt": "Editor de legenda",
					"es": "Editor de leyenda",
					"en": "Legend editor"
				},
				"diretorio": "i3geo/ferramentas/legenda",
				"categoria": "5",
				"pt": "A legenda de um tema consiste nas defini&ccedil;&otilde;es dos s&iacute;mbolos utilizados na representa&ccedil;&atilde;o de cada elemento. Al&eacute;m dos s&iacute;mbolos, uma das propriedades da legenda &eacute; o tipo de classifica&ccedil;&atilde;o utilizado na representa&ccedil;&atilde;o dos dados, por exemplo, pode-se mostrar todos os elementos com um &uacute;nico s&iacute;mbolo ou agrupar elementos e utilizar s&iacute;mbolos diferentes para cada grupo. No editor, a guia 'Classes' permite definir a classifica&ccedil;&atilde;o e na guia principal s&atilde;o mostrados os s&iacute;mbolos. Quando um s&iacute;mbolo &eacute; clicado, &eacute; ativada a guia que permite definir as caracter&iacute;sticas do s&iacute;mbolo.<br>As classes s&atilde;o definidas por meio de express&otilde;es que definem um tipo de filtro que ser&aacute; usado para definir que elementos fazem parte de cada classe. O editor possui alguns m&eacute;todos para defini&ccedil;&atilde;o autom&aacute;tica das classes, mas pode-se incluir classes livremente digitando-se o filtro. Veja <a href='http://mapserver.org/mapfile/class.html' >como</a>.",
				"es": "La leyenda de un tema consiste en la definici&oacute;n de los s&iacute;mbolos utilizados en la representaci&oacute;n de cada entidad. Adem&aacute;s de los s&iacute;mbolos, una de las propiedades de la leyenda es el tipo de clasificaci&oacute;n utilizada en la representaci&oacute;n de los datos, por ejemplo, se pueden mostrar todas las entidades con un s&iacute;mbolo &uacute;nico o agrupar entidades y utilizar s&iacute;mbolos diferentes para cada grupo. En el editor, la pesta&ntilde;a 'Clases' permite definir la clasificaci&oacute;n y en la pesta&ntilde;a principal se muestran los s&iacute;mbolos. Cuando se hace clic en un s&iacute;mbolo, se activa la pesta&ntilde;a que permite definir las caracter&iacute;sticas del s&iacute;mbolo.<br> Las clases se establecen mediante expresiones que definen un tipo de filtro que se utilizar&aacute; para establecer cu&aacute;les entidades formar&aacute;n parte de cada clase. El editor tiene algunos m&eacute;todos para la definici&oacute;n autom&aacute;tica de las clases, pero se pueden incluir clases libremente escribiendo el filtro. Ver <a href='http://mapserver.org/mapfile/class.html' target='blank'>c&oacute;mo</a>.",
				"en": "The theme legend involves defining symbols that will be used to depict each feature. In addition to symbols, one of the characteristics of the legend is the type of classification used to depict data, for example, you can show all features with a single symbol or group features and use different symbols for each group. In the editor, the 'Classes' tab allows you to define the classification and on the main tab the symbols are displayed. When you click on a symbol, a tab that allows you to define properties of the symbol will be enabled.<br>Classes are created by expressions that define a type of filter that will be used to define which feature will be part of each class. The editor has some methods that allow you to define automatically classes, but classes can be included freely by entering the filter. See <a href='http://mapserver.org/mapfile/class.html' target='blank'>how</a>.",
				"apijs": "i3GEO.tema.dialogo.editaLegenda()"
			},
			"42": {
				"titulo": {
					"pt": "Opacidade",
					"es": "Opacidad",
					"en": "Opacity"
				},
				"diretorio": "i3geo/classesjs/classe_tema.js",
				"categoria": "5",
				"pt": "Essa op&ccedil;&atilde;o modifica a opacidade de um tema permitindo ajustar a visibilidade dos elementos em rela&ccedil;&atilde;o aos outros temas. A opacidade varia de 0 a 100, sendo 100 o mais opaco.",
				"es": "Esta opci&oacute;n modifica la opacidad de un tema permitiendo ajustar la visibilidad de las entidades en relaci&oacute;n a los otros temas. La opacidad var&iacute;a de 0 a 100, siendo 100 el m&aacute;s opaco.",
				"en": "This option modifies the opacity of a theme, allowing to adjust the visibility of a feature in relation to other themes. The opacity varies from 0 to 100, where 100 is the most opaque.",
				"apijs": "i3GEO.tema.mudatransp(idtema)"
			},
			"43": {
				"titulo": {
					"pt": "Altera nome",
					"es": "Cambia el nombre",
					"en": "Change name"
				},
				"diretorio": "i3geo/classesjs/classe_tema.js",
				"categoria": "5",
				"pt": "Essa op&ccedil;&atilde;o permite alterar o nome do tema. O novo nome ser&aacute; mostrado no mapa e tamb&eacute;m na legenda.",
				"es": "Esta opci&oacute;n permite cambiar el nombre del tema. El nombre nuevo se mostrar&aacute; en el mapa y tambi&eacute;n en la leyenda.",
				"en": "This option modifies the opacity of a theme, allowing to adjust the visibility of a feature in relation to other themes. The opacity varies from 0 to 100, where 100 is the most opaque.",
				"apijs": "i3GEO.tema.mudanome(idtema)"
			},
			"45": {
				"titulo": {
					"pt": "Zoom para o tema",
					"es": "Zoom al tema",
					"en": "Zoom to theme"
				},
				"diretorio": "i3geo/classesjs/classe_navega.js",
				"categoria": "5",
				"pt": "Ajusta a visualiza&ccedil;&atilde;o do mapa alterando a extens&atilde;o geogr&aacute;fica para mostrar todos os componentes de um determinado tema.<br>Essa op&ccedil;&atilde;o &eacute; mostrada como um pequeno &iacute;cone localizado logo abaixo de um tema na &aacute;rvore de temas.",
				"es": "Ajusta la visualizaci&oacute;n del mapa cambiando la extensi&oacute;n geogr&aacute;fica para mostrar todas las entidades de un tema.<br>Esta opci&oacute;n se muestra como un peque&ntilde;o icono situado justo debajo de un tema en el &aacute;rbol de temas.",
				"en": "It adjusts the map display by changing the geographical extent to show all features of a theme.<br>This option is displayed just below a theme as a small icon on the theme tree.",
				"apijs": "i3GEO.tema.zoom(idtema)"
			},
			"46": {
				"titulo": {
					"pt": "Farol indicativo de escala",
					"es": "Sem&aacute;foro indicador de escala",
					"en": "Signal indicating scale"
				},
				"diretorio": "",
				"categoria": "5",
				"pt": "Identifica se o tema possu&iacute; uma escala compat&iacute;vel ou n&atilde;o com a escala do mapa. O farol &eacute; um &iacute;cone com cores que variam entre verde, amarelo e vermelho, conforme a escala do mapa atual. A compatibilidade da escala &eacute; definida em fun&ccedil;&atilde;o da escala da fonte dos dados cartogr&aacute;ficos utilizada pelo tema.<br>Essa op&ccedil;&atilde;o &eacute; mostrada como um pequeno &iacute;cone localizado logo abaixo de um tema na &aacute;rvore de camadas.",
				"es": "Identifica si el tema tiene una escala compatible o no con la escala del mapa. El sem&aacute;foro es un icono con colores que var&iacute;an entre verde, amarillo y rojo, seg&uacute;n la escala del mapa actual. La compatibilidad de la escala se define en funci&oacute;n de la escala de la fuente de los datos cartogr&aacute;ficos utilizada por el tema.<br>Esta opci&oacute;n se muestra como un peque&ntilde;o icono situado justo debajo de un tema en el &aacute;rbol de capas.",
				"en": "It shows whether a theme has a scale compatible or not with the map scale. The signal is an icon that has three colors: green, yellow and red, according to the scale of the current map. The scale compatibility is defined according to the scale of the source data used by the theme.<br>This option is displayed just below a theme as a small icon on the theme tree.",
				"apijs": ""
			},
			"47": {
				"titulo": {
					"pt": "Alterar ordem de desenho",
					"es": "Cambiar el orden de renderizaci&oacute;n",
					"en": "Change rendering order"
				},
				"diretorio": "i3geo/classesjs/classe_tema.js",
				"categoria": "5",
				"pt": "Os temas dispon&iacute;veis no mapa s&atilde;o desenhados como camadas que se sobrep&otilde;em para compor o mapa. Como uma pilha, as camadas seguem uma ordem de desenho, sendo que na lista de temas o primeiro que &eacute; mostrado &eacute; o &uacute;ltimo desenhado. A ordem da pilha pode ser alterada clicando-se e arrastando um tema (clicando no nome do tema) ou por meio de &iacute;cones que movem para cima ou para baixo apenas uma posi&ccedil;&atilde;o.<br>Quando um novo tema &eacute; adicionado ao mapa, o i3Geo ir&aacute; posicion&aacute;-lo procurando evitar alguns tipos de sobreposi&ccedil;&atilde;o. Temas RASTER ou poligonais s&atilde;o sempre inseridos abaixo dos temas lineares e pontuais.",
				"es": "Los temas disponibles en el mapa se dibujan como capas que se superponen para componer el mapa. Como una pila, las capas siguen un orden de renderizaci&oacute;n, en donde los primeros elementos de la lista son los &uacute;ltimos en ser visualizados. El orden de la pila se puede cambiar haciendo clic y arrastrando un tema (haciendo clic en el nombre del tema) o mediante los iconos que mueven hacia arriba o hacia abajo solo una posici&oacute;n.<br>Cuando un tema nuevo se a&ntilde;ade al mapa, i3Geo lo colocar&aacute; buscando evitar algunos tipos de superposici&oacute;n. Los temas RASTER o de pol&iacute;gonos siempre se insertan debajo de los temas de l&iacute;neas y puntos.",
				"en": "Available themes on the map are drawn as overlapping layers to compose a map. As a stack, layers follow a rendering order, where the first layer of the list is the last one that is displayed. The order of the stack can be changed by clicking and dragging a theme (by clicking on the theme name) or through icons that move up or down only one step.<br>When a new theme is added to the map, i3Geo will place it avoiding some types of overlapping. Raster or polygon themes are always inserted below themes of lines and points.",
				"apijs": "i3GEO.tema.sobe(idtema) ou i3GEO.tema.desce(idtema)"
			},
			"48": {
				"titulo": {
					"pt": "Excluir tema",
					"es": "Eliminar tema",
					"en": "Delete theme"
				},
				"diretorio": "i3geo/classesjs/classe_tema.js",
				"categoria": "5",
				"pt": "Exclui um tema da lista de temas dispon&iacute;veis no mapa atual. A exclus&atilde;o pode ser feita arrastando-se o tema para o &iacute;cone da 'lixeira' ou ent&atilde;o por meio de um &iacute;cone mostrado abaixo de cada tema.<br>Temas locais criados pelo usu&aacute;rio n&atilde;o podem ser recuperados ap&oacute;s uma exclus&atilde;o. J&aacute; os temas que constam na lista '+Temas' poder&atilde;o ser adicionados ao mapa novamente.",
				"es": "Elimina un tema de la lista de temas disponibles en el mapa actual. La exclusi&oacute;n se puede hacer arrastrando el tema al icono de la papelera o por medio de un icono que se muestra debajo de cada tema.<br>Los temas locales creados por el usuario no se pueden recuperar despu&eacute;s de una eliminaci&oacute;n. Los temas que aparecen en la lista '+ Temas' se pueden agregar al mapa de nuevo.",
				"en": "It removes a theme from the list of available themes of the current map. The exclusion can be done by dragging a theme to the trash bin icon or through an icon that is displayed below each theme.<br>Local themes created by a user cannot be recovered after deleting them. Themes that appear on the '+ Themes' list can be added to the map again.",
				"apijs": "i3GEO.tema.exclui(idtema)"
			},
			"48a": {
				"titulo": {
					"pt": "Selecionar elementos",
					"es": "Seleccionar entidades",
					"en": "Select features"
				},
				"diretorio": "i3geo/ferramentas/selecao.js",
				"categoria": "5",
				"pt": "Selecionar elementos consiste em destacar um subconjunto do conjunto total de componentes de um tema. Algumas opera&ccedil;&otilde;es do i3Geo atuam sobre o conjunto selecionado, como buffer, exporta&ccedil;&atilde;o, etc. Os elementos selecionados s&atilde;o mostrados em uma cor especial, diferente daquela definida na legenda do tema. Os temas que possuem elementos selecionados s&atilde;o marcados com uma cor diferente no nome na lista de camadas. A janela de op&ccedil;&otilde;es para sele&ccedil;&atilde;o, al&eacute;m das op&ccedil;&otilde;es de tipo de opera&ccedil;&atilde;o, permite gerar gr&aacute;ficos din&acirc;micos e criar um novo tema com base nos elementos selecionados.<br>Para realizar uma sele&ccedil;&atilde;o &eacute; necess&aacute;rio, primeiramente, escolher o tema que ser&aacute; objeto da sele&ccedil;&atilde;o. Existem v&aacute;rias maneiras de fazer a sele&ccedil;&atilde;o: clicando-se sobre cada elemento, desenhando-se um ret&acirc;ngulo ou pol&iacute;gono no mapa, definindo-se uma express&atilde;o que ir&aacute; buscar os elementos aderentes (com base na tabela de atributos) ou cruzando-se um tema com outro. Tendo-se um conjunto j&aacute; definido, novos elementos podem ser acrescentados ou retirados da sele&ccedil;&atilde;o.<br>Nas propriedades da sele&ccedil;&atilde;o o usu&aacute;rio pode definir a toler&acirc;ncia das opera&ccedil;&otilde;es de sele&ccedil;&atilde;o que utilizam cliques no mapa e a cor dos elementos selecionados.",
				"es": "La selecci&oacute;n de entidades consiste en destacar un subconjunto del conjunto total de componentes de un tema. Algunas operaciones de i3Geo act&uacute;an sobre el conjunto seleccionado, como buffer, exportaci&oacute;n, etc. Las entidades seleccionadas se muestran en un color especial, diferente al definido en la leyenda del tema. Los temas que tienen entidades seleccionadas se marcan con un color diferente en el nombre de la lista de capas. La ventana de opciones para seleccionar, adem&aacute;s de las opciones de tipo de operaci&oacute;n, permite generar gr&aacute;ficos din&aacute;micos y crear un tema nuevo basado en las entidades seleccionadas.<br>Para realizar una selecci&oacute;n es necesario, primero, elegir el tema que ser&aacute; objeto de la selecci&oacute;n. Hay varias maneras de hacer la selecci&oacute;n: haciendo clic sobre cada entidad, dibujando un rect&aacute;ngulo o pol&iacute;gono en el mapa, definiendo una expresi&oacute;n que va a buscar las entidades adherentes (con base en la tabla de atributos) o cruz&aacute;ndose un tema con otro. Si se tiene un conjunto ya definido, entidades nuevas pueden ser a&ntilde;adidas o retiradas de la selecci&oacute;n.<br>En las propiedades de la selecci&oacute;n el usuario puede definir la tolerancia de las operaciones de selecci&oacute;n que utilizan clics en el mapa y el color de las entidades seleccionadas.",
				"en": "Feature selection refers to highlighting a subset of the whole theme. Some i3Geo operations run on a selected set, such as buffer, export, etc. Selected features are displayed in a special color, different from the color shown on the legend. Themes with selected features are marked with a distinctive color on the layer name list. The option window for selecting, in addition to operation type options, allows you to create dynamic charts and create a new theme based on selected features.<br>In order to create a selection, first, it is necessary to choose a theme on which the selection will be carried out. There are several ways to create a selection: clicking on each feature, drawing a rectangle or polygon on the map, defining an expression that will fetch adherent features (based on the attribute table) or joining a theme with another. If you have already defined a dataset, new features can be added or removed from the selection.<br>On the selection properties a user can define the tolerance of selection operations that use clicks on the map and colors of selected features.",
				"apijs": "i3GEO.selecao.janelaOpcoes()"
			},
			"49": {
				"titulo": {
					"pt": "Impress&atilde;o",
					"es": "Impresi&oacute;n",
					"en": "Print"
				},
				"diretorio": "i3geo/ferramentas/imprimir",
				"categoria": "6",
				"pt": "Utilize essa op&ccedil;&atilde;o para gerar uma p&aacute;gina espec&iacute;fica para impress&atilde;o do mapa. Existem v&aacute;rias sa&iacute;das que voc&ecirc; pode utilizar para imprimir o mapa ou simplesmente salv&aacute;-lo como uma imagem. <br>Na op&ccedil;&atilde;o &lsquo;A4 PDF&rsquo; voc&ecirc; ter&aacute; um mapa completo em PDF constru&iacute;do em um modelo predefinido. Nas op&ccedil;&otilde;es &lsquo;GEO TIFF&rsquo;, &lsquo;AGG/PNG&rsquo;, e &lsquo;JPEG&rsquo; voc&ecirc; ter&aacute; sa&iacute;das individuais para cada elemento do mapa (Mapa, barra de escala, mapa de refer&ecirc;ncia e legenda) em formatos de imagem que voc&ecirc; pode utilizar para compor o mapa em outras ferramentas. J&aacute; a op&ccedil;&atilde;o &lsquo;SVG &ndash; VETORIAL&rsquo; te retornar&aacute; a imagem do mapa em um formato vetorial.<br>Voc&ecirc; pode ainda configurar as formas de apresenta&ccedil;&atilde;o da legenda, escala e o tamanho do mapa.",
				"es": "Utilice esta opci&oacute;n para generar una p&aacute;gina espec&iacute;fica para la impresi&oacute;n del mapa. Hay varias salidas que se puedes utilizar para imprimir el mapa. Usted tambi&eacute;n puede simplemente guardar el mapa como una imagen.<br>En la opci&oacute;n 'A4 PDF' tendr&aacute; un mapa completo en PDF construido en una plantilla predeterminada. En las opciones 'GEO TIFF', 'AGG / PNG', y 'JPEG' usted tendr&aacute; salidas individuales para cada elemento del mapa (mapa, barra de escala, mapa de referencia y leyenda), en formatos de imagen que usted puede utilizar para componer el mapa con otras herramientas. La opci&oacute;n 'SVG - VETORIAL' generar&aacute; la imagen del mapa en un formato vectorial.<br>Tambi&eacute;n puede configurar las formas de presentaci&oacute;n de la leyenda, la escala y el tama&ntilde;o del mapa.",
				"en": "Use this option to create a specific page for map printing purposes. There are several outputs that you can use to print the map. You can also simply save the map as an image.<br>On the 'A4 PDF' option there will be a complete PDF map built with a default template. On the 'GEO TIFF', 'AGG / PNG', and 'JPEG' options there will be individual outputs for each map component (map, scale bar, overview map and legend), in image formats that you can use to create maps with other tools. The 'SVG - VETORIAL' option will generate a map image in vector format.<br>You can also configure legend style, scale and map size.",
				"apijs": "i3GEO.configura.funcoesBotoes"
			},
			"50": {
				"titulo": {
					"pt": "C&aacute;lculo de dist&acirc;ncias",
					"es": "C&aacute;lculo de distancias",
					"en": "Measure distance"
				},
				"diretorio": "i3geo/classesjs/classe_analise.js",
				"categoria": "6",
				"pt": "Ativa o modo de c&aacute;lculo de dist&acirc;ncias, permitindo que a cada clique do mouse sobre o mapa seja feito o c&aacute;lculo da dist&acirc;ncia em rela&ccedil;&atilde;o ao ponto anterior e em rela&ccedil;&atilde;o a todos os pontos clicados. O resultado &eacute; mostrado em uma janela aberta sobre o mapa. Em cada ponto &eacute; tamb&eacute;m desenhado um c&iacute;rculo representando a dist&acirc;ncia at&eacute; o &uacute;ltimo ponto.<br>Voc&ecirc; pode incorporar a linha criada ao mapa para ser usada como uma camada ou baixada separadamente. H&aacute; ainda a op&ccedil;&atilde;o de mostrar ou n&atilde;o os raios e textos e a possibilidade de gerar um perfil de relevo a partir da linha tra&ccedil;ada no mapa. Para parar o c&aacute;lculo basta clicar sobre um dos pontos j&aacute; inseridos.<br>O c&aacute;lculo de dist&acirc;ncia &eacute; aproximado e depende da escala do mapa (quanto mais detalhado o mapa melhor). A f&oacute;rmula de c&aacute;lculo &eacute; baseada em <a href='http://www.movable-type.co.uk/scripts/latlong.html' target=&rsquo;_blank&rsquo;>http://www.movable-type.co.uk/scripts/latlong.html</a>.",
				"es": "Activa el modo de c&aacute;lculo de distancias, permitiendo que a cada clic del rat&oacute;n sobre el mapa se haga el c&aacute;lculo de la distancia con respecto al punto anterior y en relaci&oacute;n a todos los puntos pulsados. El resultado se muestra en una ventana abierta sobre el mapa. En cada punto tambi&eacute;n se dibuja un c&iacute;rculo representando la distancia hasta el &uacute;ltimo punto.<br>Puede incorporar la l&iacute;nea creada al mapa para que se utilice como una capa o se descargue por separado. Tambi&eacute;n existe la opci&oacute;n de mostrar o no los radios y textos,  y la posibilidad de generar un perfil de relieve de la l&iacute;nea trazada en el mapa. Para detener el c&aacute;lculo basta con hacer clic sobre uno de los puntos insertados.<br>El c&aacute;lculo de distancia es aproximado y depende de la escala del mapa (cuanto m&aacute;s detallado el mapa mejor). La f&oacute;rmula de c&aacute;lculo se basa en <a href='http://www.movable-type.co.uk/scripts/latlong.html' target=&rsquo;_blank&rsquo;>http://www.movable-type.co.uk/scripts/latlong.html</a>.",
				"en": "It activates the distance calculation mode. For each mouse click on the map, this tool allows you to calculate the distance with respect to the previous point and in relation to all clicked points. The result will be displayed in a window on the map. At each point a circle is also drawn representing the distance to the last point.<br>You can add the newly created line to the map to use it as a layer or to download it separately. There is also an option to show or not radius and texts. Other options allow you to create a relief profile using lines drawn on the map. To stop the calculation just click on one of the added points.<br>Distance calculation is approximate and depends on the map scale (the more detailed the map the better the calculation). The calculation formula is based on <a href='http://www.movable-type.co.uk/scripts/latlong.html' target=&rsquo;_blank&rsquo;>http://www.movable-type.co.uk/scripts/latlong.html</a>.",
				"apijs": "i3GEO.configura.funcoesBotoes"
			},
			"51": {
				"titulo": {
					"pt": "C&aacute;lculo de &aacute;rea",
					"es": "C&aacute;lculo de &aacute;rea",
					"en": "Measure area"
				},
				"diretorio": "i3geo/classesjs/classe_analise.js",
				"categoria": "6",
				"pt": "Ativa o modo de c&aacute;lculo de &aacute;rea, permitindo que seja desenhado um pol&iacute;gono sobre o mapa para c&aacute;lculo da &aacute;rea. O pol&iacute;gono &eacute; criado clicando-se no mapa no local onde se quer criar um v&eacute;rtice.<br>Voc&ecirc; pode incorporar o pol&iacute;gono criado ao mapa para ser usado como uma camada ou baixado separadamente.<br>O c&aacute;lculo de dist&acirc;ncia &eacute; aproximado e depende da escala do mapa (quanto mais detalhado o mapa melhor). O c&aacute;lculo &eacute; baseado no tamanho do pixel do mapa, calculado ao iniciar a ferramenta. Esse c&aacute;lculo baseia-se na proje&ccedil;&atilde;o polic&ocirc;nica com par&acirc;metros definidos em fun&ccedil;&atilde;o da extens&atilde;o geogr&aacute;fica do mapa atual.",
				"es": "Activa el modo de c&aacute;lculo de &aacute;rea. Esta herramienta permite que se dibuje un pol&iacute;gono sobre el mapa para el c&aacute;lculo del &aacute;rea. El pol&iacute;gono se crea haciendo clic en el mapa en el lugar donde se desea introducir un v&eacute;rtice.<br>Usted puede incorporar el pol&iacute;gono creado al mapa para ser utilizado como una capa o descargarlo por separado.<br>El c&aacute;lculo de distancia es aproximado y depende de la escala del mapa (cuanto m&aacute;s detallado el mapa mejor). El c&aacute;lculo se basa en el tama&ntilde;o del p&iacute;xel del mapa calculado al iniciar la herramienta. Este c&aacute;lculo se basa en la proyecci&oacute;n polic&oacute;nica con par&aacute;metros definidos en funci&oacute;n de la extensi&oacute;n geogr&aacute;fica del mapa actual.",
				"en": "It activates the area calculation mode. This tool allows you to calculate an area by drawing a polygon on the map. A polygon is created by clicking on the map where you want to enter a vertex.<br>You can add the new polygon to the map to use it as a layer, or you can download it. Distance calculation is approximate and depends on the scale of the map (the more detailed the map the better the calculation).<br>The calculation is based on the pixel size of the map calculated at the startup of this tool. This calculation is based on the polyconic projection with parameters defined according to the current map extent.",
				"apijs": "i3GEO.configura.funcoesBotoes"
			},
			"52": {
				"titulo": {
					"pt": "Alterar interface",
					"es": "Cambiar interfaz",
					"en": "Change interface"
				},
				"diretorio": "i3geo/classesjs/classe_interface.js",
				"categoria": "6",
				"pt": "O i3Geo pode usar diferentes interfaces para manipular a navega&ccedil;&atilde;o sobre o mapa. Por padr&atilde;o, &eacute; utilizada uma interface pr&oacute;pria, desenvolvida para o i3Geo, mas pode-se optar pelo uso do OpenLayers, Google Maps ou Google Earth.<br>As funcionalidade do i3Geo s&atilde;o afetadas pela interface escolhida, sendo que algumas opera&ccedil;&otilde;es diferem de uma para outra. A maior parte das funcionalidades s&atilde;o implementadas apenas na interface padr&atilde;o. No caso do Google Earth , que permite a visualiza&ccedil;&atilde;o do mapa em 3d, &eacute; necess&aacute;rio a instala&ccedil;&atilde;o de um plugin espec&iacute;fico.",
				"es": "i3Geo puede utilizar diferentes interfaces para manipular la navegaci&oacute;n sobre el mapa. Por defecto, se utiliza una interfaz propia desarrollada para i3Geo, pero se puede optar por el uso de OpenLayers, Google Maps o Google Earth.<br>La funcionalidad de i3Geo se ve afectada por la interfaz elegida. Algunas operaciones difieren entre una interfaz y otra. La mayor&iacute;a de las caracter&iacute;sticas se implementan solo en la interfaz est&aacute;ndar. En el caso de Google Earth, que permite la visualizaci&oacute;n del mapa en 3d, es necesario instalar un plugin espec&iacute;fico.",
				"en": "You can handle the map browsing through the different interfaces of i3Geo. By default, it is used a particular interface developed for i3Geo, but you can use OpenLayers, Google Maps or Google Earth.<br>i3Geo performance is affected by the selected interface. Some operations differ between one interface and another. Most of the i3geo's components are implemented only in the standard interface. In the case of Google Earth, that allows map visualization in 3d, it is necessary to install a specific plugin.",
				"apijs": "i3GEO.listaDeFerramentas"
			},
			"55": {
				"titulo": {
					"pt": "Extens&atilde;o geogr&aacute;fica",
					"es": "Extensi&oacute;n geogr&aacute;fica",
					"en": "Geographic extent"
				},
				"diretorio": "i3geo/ferramentas/mostraexten",
				"categoria": "7",
				"pt": "A extens&atilde;o geogr&aacute;fica &eacute; a abrang&ecirc;ncia espacial do mapa definido por meio de uma lista de coordenadas em d&eacute;cimos de grau e na ordem menor longitude, menor latitude, maior longitude, maior latitude. A extens&atilde;o geogr&aacute;fica do mapa pode ser alterada digitando-se novas coordenadas por meio dessa ferramenta.<br>O resultado final do mapa quando se altera a extens&atilde;o pode n&atilde;o corresponder as espectativas, uma vez que o mapa &eacute; um ret&acirc;ngulo cujas propor&ccedil;&otilde;es podem n&atilde;o ser compat&iacute;veis com as coordenadas digitadas.",
				"es": "La extensi&oacute;n geogr&aacute;fica es el alcance espacial del mapa definido por medio de una lista de coordenadas en grados decimales siguiendo el orden: longitud m&iacute;nima, latitud m&iacute;nima, longitud m&aacute;xima, latitud m&aacute;xima. La extensi&oacute;n geogr&aacute;fica del mapa puede cambiarse escribiendo nuevas coordenadas a trav&eacute;s de esta herramienta.<br>El resultado final del mapa cuando se cambia la extensi&oacute;n puede no coincidir con lo esperado, ya que el mapa es un rect&aacute;ngulo cuyas proporciones pueden no ser compatibles con las coordenadas introducidas.",
				"en": "Geographical extent is the spatial extent of the map defined through a list of coordinates in decimal degrees according to the following order: minimum longitude, minimum latitude, maximum longitude, maximum latitude. The geographic extent of the map can be changed by entering new coordinates by using this tool.<br>When you change the map extent unexpected results can arise, since the map is a rectangle whose proportions may not be compatible with the coordinates you entered.",
				"apijs": "i3GEO.mapa.dialogo.mostraExten"
			},
			"56": {
				"titulo": {
					"pt": "Deslocamento do mapa - PAN",
					"es": "Desplazamiento del mapa - PAN",
					"en": "Map displacement - PAN"
				},
				"diretorio": "",
				"categoria": "7",
				"pt": "O deslocamento do mapa do tipo PAN &eacute; realizado de forma interativa, deve-se clicar em um ponto do mapa e arrastar o mouse para a nova posi&ccedil;&atilde;o. O resultado &eacute; o deslocamento da extens&atilde;o geogr&aacute;fica do mapa movendo-se o ponto inicial at&eacute; o segundo ponto.<br>Caso o primeiro ponto seja muito pr&oacute;ximo do segundo, ou se o usu&aacute;rio clicar e soltar o mouse, o ponto clicado &eacute; movido para o centro do mapa.",
				"es": "El desplazamiento del mapa del tipo PAN se realiza de forma interactiva, se debe hacer clic en un punto del mapa y arrastrar el rat&oacute;n a la nueva posici&oacute;n. El resultado es el desplazamiento de la extensi&oacute;n geogr&aacute;fica del mapa moviendo el punto inicial hasta el segundo punto.<br>Si el primer punto es muy pr&oacute;ximo al segundo o si el usuario hace clic y suelta el rat&oacute;n, el punto sobre el que se hace clic se mueve al centro del mapa.",
				"en": "Pan (map movement) is done interactively, you must click on a point on the map and drag the mouse to a new position. This results in a map extent displacement where a starting point moves to a new place.<br>If the first point is very close to the second one or if the user clicks and releases the mouse, the point that is clicked moves towards the map center.",
				"apijs": ""
			},
			"57": {
				"titulo": {
					"pt": "Deslocamento direcional",
					"es": "Desplazamiento direccional",
					"en": "Directional displacement"
				},
				"diretorio": "i3geo/classesjs/classe_navega.js",
				"categoria": "7",
				"pt": "O deslocamento direcional movimenta o mapa para o norte, sul, leste ou oeste uma dist&acirc;ncia fixa.<br>Essa forma de deslocamento exige que o usu&aacute;rio clique apenas uma vez em um bot&atilde;o para realizar o deslocamento.",
				"es": "El desplazamiento direccional mueve el mapa hacia el norte, sur, este u oeste a una distancia fija.<br>Esta forma de desplazamiento requiere que el usuario haga clic solo una vez en un bot&oacute;n para realizar el desplazamiento.",
				"en": "Directional movement moves the map to the north, south, east or west at a fixed distance.<br>This kind of displacement requires the user to click only once on a button to carry out this action.",
				"apijs": "i3GEO.navega.panFixo(locaplic,sid,direcao,w,h,escala)"
			},
			"58": {
				"titulo": {
					"pt": "Rosa dos ventos",
					"es": "Rosa de los vientos",
					"en": "Wind rose"
				},
				"diretorio": "i3geo/classesjs/classe_navega.js",
				"categoria": "7",
				"pt": "A rosa dos ventos &eacute; uma imagem mostrada na posi&ccedil;&atilde;o atual do mouse e que possibilita deslocar, aproximar ou afastar o mapa. A rosa aparece quando o mouse &eacute; estacionado por alguns instantes sobre o mapa e permite movimentar o mapa sem a necessidade de abandonar a ferramenta escolhida no momento.<br>A rosa dos ventos &eacute; opcional e por padr&atilde;o n&atilde;o fica habilitada.",
				"es": "La rosa de los vientos es una imagen que se muestra en la posici&oacute;n actual del rat&oacute;n y que permite desplazar, acercar o alejar el mapa. La rosa aparece cuando el rat&oacute;n est&aacute; estacionado por unos instantes sobre el mapa y permite mover el mapa sin la necesidad de abandonar la herramienta elegida en el momento.<br>La rosa de los vientos es opcional y por defecto no est&aacute; habilitada.",
				"en": "The wind rose is an image that is displayed at the mouse current position and that allows the map to move, zoom in or zoom out. The rose appears when you hover the mouse for a few moments on the map. The rose allows you to move the map without stopping using a tool.<br>The wind rose is optional and by default is not enabled.",
				"apijs": "i3GEO.navega.mostraRosaDosVentos() e i3GEO.eventos.MOUSEPARADO"
			},
			"59": {
				"titulo": {
					"pt": "Aproximar",
					"es": "Aproximar",
					"en": "Zoom in"
				},
				"diretorio": "i3geo/classesjs/classe_navega.js",
				"categoria": "7",
				"pt": "Aproxima o mapa tendo como refer&ecirc;ncia o ponto central. A aproxima&ccedil;&atilde;o ocorre por um fator fixo, modificando a escala atual.",
				"es": "Aproxima el mapa teniendo como referencia el punto central. El acercamiento ocurre a trav&eacute;s de un factor fijo que modifica la escala actual.",
				"en": "It allows you to zoom in the map using a central point as a reference. Zooming in is done by a fixed factor that modifies the current scale.",
				"apijs": "i3GEO.navega.zoomin()"
			},
			"60": {
				"titulo": {
					"pt": "Afastar",
					"es": "Alejar",
					"en": "Zoom out"
				},
				"diretorio": "i3geo/classesjs/classe_navega.js",
				"categoria": "7",
				"pt": "Afasta o mapa tendo como refer&ecirc;ncia o ponto central. O afastamento ocorre por um fator fixo, modificando a escala atual.",
				"es": "Aleja el mapa teniendo como referencia el punto central. El alejamiento ocurre a trav&eacute;s de un factor fijo que modifica la escala actual.",
				"en": "It allows you to zoom out the map using a central point as a reference. Zooming out is done by a fixed factor that modifies the current scale.",
				"apijs": "i3GEO.navega.zoomout()"
			},
			"61": {
				"titulo": {
					"pt": "Aproximar regi&atilde;o",
					"es": "Zoom por rect&aacute;ngulo",
					"en": "Zoom by rectangle"
				},
				"diretorio": "i3geo/classesjs/classe_navega.js",
				"categoria": "7",
				"pt": "Ao ativar essa op&ccedil;&atilde;o deve-se desenhar um ret&acirc;ngulo sobre o mapa abrangendo a regi&atilde;o que se quer enquadrar a &aacute;rea de visualiza&ccedil;&atilde;o. O resultado &eacute; a aproxima&ccedil;&atilde;o do mapa em uma determinada regi&atilde;o.<br>Para desenhar o ret&acirc;ngulo deve-se clicar em um ponto do mapa e arrastar o mouse. A medida que isso ocorre, &eacute; desenhado um ret&acirc;ngulo sobre o mapa.",
				"es": "Al activar esta opci&oacute;n se debe dibujar un rect&aacute;ngulo sobre el mapa que abarque el &aacute;rea que se quiere acercar. El resultado es el acercamiento del mapa a un a&eacute;rea determinada.<br>Para dibujar el rect&aacute;ngulo se debe hacer clic en un punto del mapa y arrastrar el rat&oacute;n. A medida que esto ocurre se dibuja un rect&aacute;ngulo sobre el mapa.",
				"en": "When you enable this option you must draw a rectangle on the map that encompasses the area that you want to zoom in. As a result, you can zoom in to a specific area on the map.<br>Click on a point on the map and drag the mouse to draw a rectangle. As you move the mouse the rectangle will be drawn.",
				"apijs": "i3GEO.navega.zoomBox"
			},
			"62": {
				"titulo": {
					"pt": "Definir escala",
					"es": "Definir escala",
					"en": "Set scale"
				},
				"diretorio": "i3geo/classesjs/classe_navega.js",
				"categoria": "7",
				"pt": "A altera&ccedil;&atilde;o da escala do mapa &eacute; uma das formas de aproximar ou afastar a visualiza&ccedil;&atilde;o. Nessa op&ccedil;&atilde;o, para alterar a escala deve-se digitar o novo valor do denominador da escala que ser&aacute; aplicado.",
				"es": "El cambio de escala es una de las formas de acercar o alejar la vista del mapa. En esta opci&oacute;n, para cambiar la escala se debe introducir el nuevo valor del denominador de la escala que se aplicar&aacute;.",
				"en": "Scale changing is one of the ways to zoom in or out the map. Enter a new denominator scale value to change the scale.",
				"apijs": "i3GEO.navega.aplicaEscala(locaplic,sid,escala)"
			},
			"63": {
				"titulo": {
					"pt": "Centralizar em um ponto",
					"es": "Centrar en un punto",
					"en": "Center on a point"
				},
				"diretorio": "i3geo/classesjs/classe_navega.js",
				"categoria": "7",
				"pt": "Essa op&ccedil;&atilde;o desloca o centro do mapa atual para um determinado ponto com coordenadas conhecidas. A escala do mapa n&atilde;o &eacute; alterada.<br>Para usar essa opera&ccedil;&atilde;o, digite as coordenadas desejadas nos campos de formul&aacute;rio utilizados para mostrar a coordenada geogr&aacute;fica atual do mouse.",
				"es": "Esta opci&oacute;n desplaza el centro del mapa actual a un punto determinado de coordenadas conocidas. La escala del mapa no se cambia.<br>Para utilizar esta operaci&oacute;n, escriba las coordenadas deseadas en los campos de formulario utilizados para mostrar la coordenada geogr&aacute;fica actual del rat&oacute;n.",
				"en": "This option moves the center of the current map to a specific point of known coordinates. The map scale won't change.<br>In order to perform this operation, enter the coordinates you want to use on the form fields used to display current geographic coordinates of the mouse.",
				"apijs": "i3GEO.navega.zoomponto(locaplic,sid,x,y)"
			},
			"64": {
				"titulo": {
					"pt": "Aproximar ou afastar din&acirc;mico",
					"es": "Acercar o alejar din&aacute;mico",
					"en": "Dynamic zoom in or out "
				},
				"diretorio": "i3geo/classesjs/classe_barradebotoes.js",
				"categoria": "7",
				"pt": "A opera&ccedil;&atilde;o de zoom din&acirc;mico permite afastar ou aproximar o mapa por meio de um controle deslizante. O usu&aacute;rio move um controle para cima ou para baixo e ao soltar o mouse o mapa &eacute; modificado.",
				"es": "La operaci&oacute;n de zoom din&aacute;mico permite alejar o acercar el mapa a trav&eacute;s de un control deslizante. El usuario mueve un control hacia arriba o hacia abajo. Al soltar el rat&oacute;n el mapa habr&aacute; cambiando.",
				"en": "Dynamic zoom allows you to zoom in out the map through a slider. The user moves up or down a control. When you release the mouse the map will change.",
				"apijs": "i3GEO.barraDeBotoes.ativaBarraDeZoom()"
			},
			"65": {
				"titulo": {
					"pt": "Zoom pr&oacute;ximo ou anterior",
					"es": "Zoom siguiente o anterior",
					"en": "Zoom last or next"
				},
				"diretorio": "i3geo/classesjs/classe_gadgets.js",
				"categoria": "7",
				"pt": "Ao navegar pelo mapa as posi&ccedil;&otilde;es obtidas s&atilde;o armazenadas em mem&oacute;ria. Essa op&ccedil;&atilde;o permite reestabelecer a abrang&ecirc;ncia espacial anterior ou posterior, se houver, de forma sequencial.<br>Essa opera&ccedil;&atilde;o n&atilde;o restaura a situa&ccedil;&atilde;o do mapa apenas modifica a abrang&ecirc;ncia espacial com base nos temas vis&iacute;veis no mapa atual.",
				"es": "Al navegar por el mapa, las posiciones obtenidas se almacenan en la memoria. Esta opci&oacute;n permite reestablecer la extensi&oacute;n espacial anterior o posterior (si existe) de forma secuencial.<br>Esta operaci&oacute;n no restaura el contexto del mapa solo modifica la extensi&oacute;n espacial sobre la base de los temas visibles en el mapa actual.",
				"en": "Map views are stored in memory when you browse the map. This option allows you to sequentially go back to the previous extent or go to next extent.<br>This operation does not restore the map context. It only modifies the spatial extent based on themes visible on the current map.",
				"apijs": "i3GEO.gadgets.mostraHistoricoZoom(id)"
			},
			"66": {
				"titulo": {
					"pt": "Mapa de refer&ecirc;ncia",
					"es": "Mapa de referencia",
					"en": "Overview map"
				},
				"diretorio": "i3geo/classesjs/classe_maparef.js",
				"categoria": "7",
				"pt": "O mapa de refer&ecirc;ncia consiste em uma imagem com escala diferente do corpo do mapa atual, permitindo que a abrang&ecirc;ncia geogr&aacute;fica atual seja mostrada em um contexto mais amplo. A navega&ccedil;&atilde;o pode ser feito sobre o mapa de refer&ecirc;ncia, deslocando-se o ret&acirc;ngulo que mostra a abrang&ecirc;ncia atual para um outro local.<br>O mapa de refer&ecirc;ncia pode ser fixo ou n&atilde;o. O mapa de refer&ecirc;ncia din&acirc;mico pode ser montado tendo como base as camadas vistas no mapa atual. Nesse caso, a topon&iacute;mia especificada e a simbologia podem gerar mapas com pouca visibilidade.",
				"es": "El mapa de referencia consiste en una imagen con una escala diferente a la del mapa actual, permitiendo que la extensi&oacute;n geogr&aacute;fica actual se muestre en un contexto m&aacute;s amplio. La navegaci&oacute;n se puede hacer sobre el mapa de referencia, desplazando a otro lugar el rect&aacute;ngulo que muestra la extensi&oacute;n actual.<br>El mapa de referencia puede ser fijo o no. El mapa de referencia din&aacute;mico se puede crear bas&aacute;ndose en las capas visibles del mapa actual. En este caso, la toponimia especificada y la simbolog&iacute;a pueden generar mapas con poca visibilidad.",
				"en": "An overview map is an image that have a scale different from the current map scale. The overview map allows to display the current geographical extent in a wider context. Map browsing can be done on the reference map by moving to another place the rectangle that shows the current extent.<br>The overview map can be fixed or not. A dynamic overview map can be created based on visible layers of the current map. In this case, specific toponymy and symbology can generate blurred maps.",
				"apijs": "i3GEO.maparef"
			},
			"67": {
				"titulo": {
					"pt": "Extens&atilde;o total",
					"es": "Zoom general",
					"en": "Full extent"
				},
				"diretorio": "",
				"categoria": "7",
				"pt": "Ao iniciar o mapa, a primeira extens&atilde;o geogr&aacute;fica utilizada para mostrar o mapa &eacute; armazenada em mem&oacute;ria. Essa op&ccedil;&atilde;o permite aplicar essa extens&atilde;o ao mapa atual, restaurando a abrang&ecirc;ncia geogr&aacute;fica inicial.<br>A aplica&ccedil;&atilde;o da extens&atilde;o total n&atilde;o restaura a situa&ccedil;&atilde;o inicial de camadas ligadas e desligadas, mantendo a situa&ccedil;&atilde;o do mapa atual.",
				"es": "Al iniciar el mapa, la primera extensi&oacute;n geogr&aacute;fica utilizada para mostrar el mapa se almacena en la memoria. Esta opci&oacute;n permite aplicar esta extensi&oacute;n al mapa actual, restaurando la extensi&oacute;n geogr&aacute;fica inicial.<br>La aplicaci&oacute;n del zoom general no restaura la situaci&oacute;n inicial de las capas encendidas y apagadas. Solo mantiene el contexto del mapa actual.",
				"en": "When you start the map, the first geographical extent used to display the map is stored in memory. This option allows you to apply this extension to the current map and restore the starting geographical extent.<br>Full extent extension does not restore layers that were turned on and off. It only maintains the context of the current map.",
				"apijs": ""
			},
			"68": {
				"titulo": {
					"pt": "Google Maps",
					"es": "Google Maps",
					"en": "Google Maps"
				},
				"diretorio": "i3geo/ferramentas/googlemaps",
				"categoria": "7",
				"pt": "Essa op&ccedil;&atilde;o mostra em uma janela interna o mapa produzido pelo Google Maps. A janela &eacute; sincronizada com o mapa mostrado no i3Geo, permitindo que a navega&ccedil;&atilde;o em um ou noutro modifique os dois mapas.<br>Al&eacute;m das op&ccedil;&otilde;es de tipo de mapa &eacute; poss&iacute;vel tra&ccedil;ar rotas no Google Maps e mostrar nessa janela o mapa visto no i3Geo. Ao tra&ccedil;ar uma rota, o resultado &eacute; inclu&iacute;do no i3Geo como uma nova camada, que pode inclusive ser obtida via download. Quando o mapa do i3Geo &eacute; inclu&iacute;do no mapa do Google, os pol&iacute;gonos com s&iacute;mbolos n&atilde;o transparentes podem encubrir o mapa, nesse caso, altere a legenda das camadas para permitir a visualiza&ccedil;&atilde;o correta.",
				"es": "Esta opci&oacute;n muestra en una ventana interna el mapa producido por Google Maps. La ventana se sincroniza con el mapa mostrado en i3Geo, permitiendo que la navegaci&oacute;n en uno u otro modifique los dos mapas.<br>Adem&aacute;s de las opciones de tipo de mapa, es posible trazar rutas en Google Maps y mostrar en esa ventana el mapa visto en i3Geo. Al trazar una ruta, el resultado se incluye en i3Geo como una capa nueva, que puede incluso ser obtenida a trav&eacute;s de la descarga. Cuando el mapa de i3Geo se incluye en el mapa de Google, los pol&iacute;gonos con s&iacute;mbolos no transparentes pueden cubrir el mapa, en cuyo caso, cambie la leyenda de las capas para permitir la visualizaci&oacute;n correcta.",
				"en": "This option shows in an internal window Google Maps. This window is synchronized with the map shown in i3Geo, so both windows will go to the same location at the same time when you zoom or pan one of the maps.<br>In addition to map type options, it is possible to draw routes on Google Maps and display in the Google Maps window maps visualized in i3Geo. When drawing a route, the result is added to i3Geo as a new layer, that can even be downloaded. When an i3Geo map is added to a Google map, polygons with non-transparent symbols can overlap the map, in this case, change layer legend to achieve the desired effect.",
				"apijs": "i3GEO.configura.funcoesBotoes a chave de acesso da API do Google Maps &eacute; definida em ms_configura.php"
			},
			"69": {
				"titulo": {
					"pt": "Visualiza&ccedil;&atilde;o 3d",
					"es": "Visualizaci&oacute;n 3d",
					"en": "3d visualization"
				},
				"diretorio": "i3geo/ferramentas/3d",
				"categoria": "7",
				"pt": "A visualiza&ccedil;&atilde;o em 3d gera um arquivo no formato 'wrl' considerando a abrang&ecirc;ncia espacial do mapa atual. Para a gera&ccedil;&atilde;o do modelo &eacute; utilizado um mapa de fundo com a representa&ccedil;&atilde;o da altimetria, esse mapa &eacute; obtido por meio de um servi&ccedil;o WMS baseado nos dados SRTM.<br>Para ver o modelo 3d &eacute; necess&aacute;rio a instala&ccedil;&atilde;o de um plugin no navegador, ou ent&atilde;o, deve-se salvar o arquivo para visualiza&ccedil;&atilde;o em algum outro software. O modelo 3d &eacute; simplificado, permitindo apenas a navega&ccedil;&atilde;o b&aacute;sica.",
				"es": "La visualizaci&oacute;n en 3D genera un archivo en el formato 'wrl' con la extensi&oacute;n espacial del mapa actual. Para la generaci&oacute;n del modelo 3D se utiliza un mapa base con datos de alturas. Ese mapa se obtiene por medio de un servicio WMS basado en datos SRTM.<br>Para ver el modelo 3D es necesario instalar un plugin en el navegador, o bien, se debe guardar el archivo para su visualizaci&oacute;n en alg&uacute;n otro software. El modelo 3D se simplifica permitiendo solo la navegaci&oacute;n b&aacute;sica.",
				"en": "3D visualization generates a file in 'wrl' format with the spatial extent of the current map. In order to create a 3D model, a base map with height data will be used. This map is obtained through a WMS service based on SRTM data.<br>It is necessary to install a plugin in the browser to visualize a 3D model. You can also save the 'wrl'  file to open it in a software that support 3D viewing. A 3D model is simplified to allow basic navigation.",
				"apijs": "i3GEO.configura.funcoesBotoes"
			},
			"70": {
				"titulo": {
					"pt": "Identificar",
					"es": "Identificar",
					"en": "Identify"
				},
				"diretorio": "i3geo/ferramentas/identifica",
				"categoria": "8",
				"pt": "Com essa ferramenta ativa pode-se clicar em um elemento do mapa e visualizar os atributos associados. Quando a janela &eacute; aberta, deve-se escolher o tema que ser&aacute; identificado em uma lista. Al&eacute;m dos temas, s&atilde;o mostrados alguns sistemas especiais que permitem a busca de dados em fun&ccedil;&atilde;o da coordenada clicada, por exemplo, &eacute; poss&iacute;vel abrir uma p&aacute;gina do IBGE com informa&ccedil;&otilde;es sobre munic&iacute;pios.<br>Alguns temas permitem a identifica&ccedil;&atilde;o sem o clique no mapa, os dados s&atilde;o mostrados quando o mouse &eacute; estacionado sobre um ponto no mapa. Em 'Buscadores web' &eacute; mostrada uma lista de sistemas que permitem a busca de dados por meio de coordenadas. A guia propriedades permite definir a toler&acirc;ncia de busca, ou seja, quantos pixels ser&atilde;o considerados entorno do ponto clicado.",
				"es": "Con esta herramienta activa se puede hacer clic en una entidad del mapa y ver sus atributos asociados. Cuando la ventana se abre, se debe elegir de una lista el tema que ser&aacute; identificado. Adem&aacute;s de los temas, se muestran algunos sistemas especiales que permiten la b&uacute;squeda de datos en funci&oacute;n de la coordenada pulsada, por ejemplo, es posible abrir el sitio web del IBGE (Instituto Brasile&ntilde;o de Geograf&iacute;a y Estad&iacute;stica) con informaciones sobre municipios.<br>Algunos temas permiten la identificaci&oacute;n sin hacer clic en el mapa, los datos se muestran cuando el rat&oacute;n est&aacute; detenido sobre un punto en el mapa. En &quot;Buscadores web&quot; se muestra una lista de sistemas que permiten la b&uacute;squeda de datos a trav&eacute;s de coordenadas. La pesta&ntilde;a propiedades permite definir la tolerancia de b&uacute;squeda, es decir, cu&aacute;ntos p&iacute;xeles se considerar&aacute;n alrededor del punto de clic.",
				"en": "When this tool is active you can click on a map feature and see its attributive data. When the window opens, you must select from a list a theme that will be identified. In addition to themes, it is shown some special systems that allow to search for data according to a clicked coordinate, for example, it is possible to open the IBGE (Brazilian Institute of Geography and Statistics) website to obtain information about counties.<br>Some themes can be identified without clicking on the map, the data is displayed when the mouse is hovered over a point on the map. On 'Web search engines' there is a list of systems that allow you to search for data through coordinates. Properties tab allows you to define a search tolerance, that is, how many pixels will be considered around a clicked point.",
				"apijs": "i3GEO.configura.funcoesBotoes"
			},
			"71": {
				"titulo": {
					"pt": "Busca r&aacute;pida",
					"es": "B&uacute;squeda r&aacute;pida",
					"en": "Quick search"
				},
				"diretorio": "i3geo/ferramentas/buscarapida",
				"categoria": "8",
				"pt": "Essa op&ccedil;&atilde;o permite localizar dados com base em palavras ou frases, por exemplo 'S&atilde;o Paulo'. A busca &eacute; feita nos temas do mapa ou em um Web Service cujo banco de dados pode variar em cada instala&ccedil;&atilde;o do i3Geo. Quando um lugar &eacute; encontrado, uma nova janela &eacute; mostrada na tela com o resultado. Clicando-se nos links dispon&iacute;veis, o mapa &eacute; deslocado para o lugar definido e uma nova camada &eacute; adicionada ao mapa.<br>A busca &eacute; feita tamb&eacute;m no Web Service do Google, permitindo a localiza&ccedil;&atilde;o de endere&ccedil;os. Utilize as propriedades para definir se a busca ser&aacute; feita ou n&atilde;o nos temas existentes no mapa. Apenas os temas que tiverem sido preparados pelo administrador do i3Geo pode ser pesquisado.",
				"es": "Esta opci&oacute;n permite localizar datos con base a palabras o frases, por ejemplo 'San Pablo'. La b&uacute;squeda se realiza en los temas del mapa o en un Servicio Web cuya base de datos puede variar en cada instalaci&oacute;n de i3Geo. Cuando se encuentra un lugar, una ventana nueva con el resultado se abre en la pantalla. Al hacer clic en los v&iacute;nculos disponibles, el mapa se desplazar&aacute; al lugar definido y se a&ntilde;adir&aacute; una capa nueva al mapa.<br>La b&uacute;squeda se realiza tambi&eacute;n en el servicio web de Google, permitiendo la localizaci&oacute;n de direcciones. Utilice las propiedades para definir si la b&uacute;squeda se har&aacute; o no en los temas del mapa. Solo se puede buscar en los temas que han sido dispuestos por el administrador de i3Geo.",
				"en": "This option allows you to locate data based on words or phrases, for example 'Saint Paul'. Searching is done in map themes or in a Web Service whose database may vary between i3Geo installations. When a location is found, a new window will be open showing results on the screen. By clicking on available links, the map will move to a given location and a new layer will be added to the map.<br>Searching is also done in Google web service. This allows you to locate addresses. Modify properties to define whether or not searching will be done on map themes. You can only search on the themes that have been set up by the i3Geo administrator.",
				"apijs": "i3GEO.gadgets.mostraBuscaRapida(id)"
			},
			"72": {
				"titulo": {
					"pt": "Localizar IP",
					"es": "Localizar IP",
					"en": "Find IP"
				},
				"diretorio": "i3geo/classesjs/classe_navega.js",
				"categoria": "8",
				"pt": "Ao clicar nesse &iacute;cone &eacute; mostrado um ponto no mapa identificando a coordenada geogr&aacute;fica da localiza&ccedil;&atilde;o do usu&aacute;rio.<br>Essa fun&ccedil;&atilde;o &eacute; baseada em uma tabela de correspond&ecirc;ncia entre o n&uacute;mero IP e localidades. A localiza&ccedil;&atilde;o ser&aacute; mais precisa quanto for essa tabela de correspond&ecirc;ncia.",
				"es": "Al hacer clic en este icono se muestra un punto en el mapa identificando la coordenada geogr&aacute;fica de la ubicaci&oacute;n del usuario.<br>Esta funci&oacute;n se basa en una tabla de coincidencias entre el n&uacute;mero de la IP y las localidades. La ubicaci&oacute;n ser&aacute; m&aacute;s precisa en la medida en que haya m&aacute;s coincidencias.",
				"en": "When you click on this icon, it will be displayed on the map a point identifying coordinates of the user location.<br>This function is based on a table of coincidences between a IP number and localities. The more the coincidences the best the accuracy.",
				"apijs": "i3GEO.navega.zoomIP()"
			},
			"73": {
				"titulo": {
					"pt": "Wikipedia",
					"es": "Wikipedia",
					"en": "Wikipedia"
				},
				"diretorio": "i3geo/ferramentas/wiki",
				"categoria": "8",
				"pt": "A <a href='https://es.wikipedia.org/wiki/Wikipedia:Portada' target='_blank' >Wikipedia</a> &eacute; uma base de conhecimento livre. Alguns dos artigos existentes s&atilde;o georreferenciados, permitindo sua busca por regi&atilde;o geogr&aacute;fica. Essa ferramenta abre uma janela sobre o mapa procurando resultados na Wikipedia para a regi&atilde;o de abrang&ecirc;ncia do mapa.<br>Para maior performance, o mapa deve estar na escala 1:500.000 ou maior. Ao navegar no mapa, a lista de lugares &eacute; atualizada.",
				"es": "<a href='http://pt.wikipedia.org/wiki/P%C3%A1gina_principal' target='_blank' >Wikipedia</a> es una base de conocimiento libre. Algunos de los art&iacute;culos existentes est&aacute;n georreferenciados, permitiendo su b&uacute;squeda por regi&oacute;n geogr&aacute;fica. Esta herramienta abre una ventana sobre el mapa que permite buscar resultados en Wikipedia para la regi&oacute;n de cobertura del mapa.<br>Para mayor rendimiento, el mapa debe estar a escala 1: 500.000 o mayor. Al navegar por el mapa se actualiza la lista de lugares.",
				"en": "<a href='https://en.wikipedia.org/wiki/Main_Page' target='_blank'>Wikipedia</a> is a is a free encyclopedia. Some of the existing articles are georeferenced. This allows you to search for data by geographic region. This tool opens a window on the map that allows you to search for data of the region displayed on the map in Wikipedia.<br>For better performance, the map should be at a scale of 1: 500,000 or greater. When you browse the map the list of places is refreshed.",
				"apijs": "i3GEO.configura"
			},
			"74": {
				"titulo": {
					"pt": "Localizar fotos",
					"es": "Buscar fotos",
					"en": "Search photos"
				},
				"diretorio": "i3geo/ferramentas/buscafotos",
				"categoria": "8",
				"pt": "Existem v&aacute;rios servi&ccedil;os na Internet que permitem cadastrar e visualizar fotos georreferenciadas. Essa ferramenta procura fotos para a regi&atilde;o de abrang&ecirc;ncia do mapa nos servi&ccedil;os Panor&acirc;mio, Flicker e Locr.<br>Para maior performance, o mapa deve estar na escala 1:150.000 ou maior.Ao passar o mouse sobre a foto, a sua localiza&ccedil;&atilde;o &eacute; mostrada no mapa.<br>Essa op&ccedil;&atilde;o necessita de uma API do Google Maps. Consulte o administrador do sistema. O c&oacute;digo da API deve constar no arquivo de configura&ccedil;&atilde;o do i3Geo.",
				"es": "Existen varios servicios en Internet que permiten registrar y ver fotos georreferenciadas. Esta herramienta busca fotos para la regi&oacute;n de cobertura del mapa en los servicios Panoramio, Flicker y Locr.<br>Para mayor rendimiento, el mapa debe estar a escala 1: 150.000 o mayor. Al pasar el rat&oacute;n sobre la foto su ubicaci&oacute;n se muestra en el mapa.<br>Esta opci&oacute;n requiere una API de Google Maps. Consulte al administrador del sistema. El c&oacute;digo de la API debe estar presente en el archivo de configuraci&oacute;n de i3Geo.",
				"en": "There are several services on the Internet that allow you to register and view georeferenced photos. This tool searches for photos of the region displayed on the map in Panoramio, Flicker and Locr services.<br>For better performance, the map should be at a scale of 1: 150,000 or greater. When you hover the mouse over a photo its location is shown on the map.<br>This option requires a Google Maps API. Ask the system administrator. The API code must be included in the i3Geo configuration file.",
				"apijs": "i3GEO.configura"
			},
			"75": {
				"titulo": {
					"pt": "Conflu&ecirc;ncias",
					"es": "Confluencias",
					"en": "Confluences"
				},
				"diretorio": "i3geo/ferramentas/confluence",
				"categoria": "8",
				"pt": "O projeto 'Confluences' registra expedi&ccedil;&otilde;es aos lugares na terra cuja coordenada geogr&aacute;fica corresponde ao cruzamento de 1 grau por 1 grau. Essa ferramenta permite localizar as conflu&ecirc;ncias no mapa que est&aacute; sendo visto e abrir a p&aacute;gina correspondente.<br>O mapa deve estar pelo menos na escala 1:2.000.000 para que as conflu&ecirc;ncias sejam mostradas.",
				"es": "El proyecto 'Confluences' registra las expediciones a los lugares en la Tierra cuyas coordenadas geogr&aacute;ficas corresponden al cruce de 1 grado por 1 grado. Esta herramienta permite localizar las confluencias en el mapa que se est&aacute; visualizando y abrir la p&aacute;gina correspondiente.<br>El mapa debe estar al menos en la escala 1: 2.000.000 para que las confluencias puedan ser mostradas.",
				"en": "'Confluences' project registers expeditions to places on the Earth whose geographical coordinates correspond to the intersection of 1 degree by 1 degree. This tool allows you to locate confluences on the map that is being visualized and open the corresponding webpage.<br>The map must be at least at a scale 1: 2,000,000 so that confluences can be displayed.",
				"apijs": "i3GEO.navega.dialogo.confluence"
			},
			"76": {
				"titulo": {
					"pt": "Conex&atilde;o WMS-T",
					"es": "Conexi&oacute;n WMS-T",
					"en": "WMS-T connection"
				},
				"diretorio": "i3geo/ferramentas/wmstime",
				"categoria": "4",
				"pt": "Uma conex&atilde;o WMS-T permite que dados dispon&iacute;veis em outros servidores sejam inclu&iacute;dos como camadas no i3Geo. Na ferramenta de conex&atilde;o &eacute; mostrada uma lista de endere&ccedil;os previamente cadastrados, mas pode-se digitar um outro endere&ccedil;o qualquer, desde que seja um servi&ccedil;o no padr&atilde;o WMS-T. Ap&oacute;s ser escolhido o servi&ccedil;o, deve-se definir o per&iacute;odo das imagens e o intervalo desejado (di&aacute;rio, mensal ou anual).<br>Ap&oacute;s definido o per&iacute;odo, a ferramenta far&aacute; a busca das imagens para sua apresenta&ccedil;&atilde;o em sequ&ecirc;ncia. Ao parar a anima&ccedil;&atilde;o, a imagem mostrada poder&aacute; ser acrescentada ao mapa como uma nova camada. A visualiza&ccedil;&atilde;o das imagens s&oacute; &eacute; poss&iacute;vel ap&oacute;s a carga de todas as datas selecionadas. Caso seja necess&aacute;rio cancelar a carga de uma ou mais datas, deve-se clicar em 'parar' na lista de imagens que est&atilde;o sendo carregadas.",
				"es": "Una conexi&oacute;n WMS-T permite que los datos disponibles en otros servidores se incluyan como capas en i3Geo. En la herramienta de conexi&oacute;n se muestra una lista de direcciones previamente registradas, pero se puede ingresar otra direcci&oacute;n cualquiera, siempre que sea un servicio en el est&aacute;ndar WMS-T. Despu&eacute;s de haber elegido el servicio, se debe definir el per&iacute;odo de tiempo de las im&aacute;genes y el intervalo deseado (diario, mensual o anual).<br>Despu&eacute;s de definir el per&iacute;odo de tiempo, la herramienta buscar&aacute; las im&aacute;genes para su presentaci&oacute;n en secuencia. Al detener la animaci&oacute;n la imagen mostrada se puede a&ntilde;adir al mapa como una capa nueva. La visualizaci&oacute;n de las im&aacute;genes solo es posible despu&eacute;s de haber cargado todas las fechas seleccionadas. Si es necesario cancelar la carga de una o m&aacute;s fechas, se debe hacer clic en 'parar' en la lista de im&aacute;genes que se est&aacute;n cargando.",
				"en": "WMS-T connection allows you to include data available on other servers as layers in i3Geo. On the connection tool is displayed a list of previously registered addresses, but you can enter any other address, provided it is a service in WMS-T standard. After choosing the service, you must define a time period of images and an interval (daily, monthly or yearly) you want to use.<br>After defining a time period, this tool will search for images to depict them sequentially. When you stop the animation, the displayed image can be added to the map as a new layer. Image visualization is only possible after loading all selected dates. If you need to cancel the loading of one or more dates, click on 'stop' on the list of images that are loading.",
				"apijs": "i3GEO.arvoreDeTemas"
			},
			"78": {
				"titulo": {
					"pt": "Zoom para a sele&ccedil;&atilde;o",
					"es": "Zoom a la selecci&oacute;n",
					"en": "Zoom to selected"
				},
				"diretorio": "i3geo/classesjs/classe_tema.js",
				"categoria": "5",
				"pt": "Ajusta a extens&atilde;o geogr&aacute;fica do mapa tendo como base os elementos selecionados de um tema.<br>Essa op&ccedil;&atilde;o &eacute; mostrada como um pequeno &iacute;cone, localizado ao lado do nome do tema, quando este possuir sele&ccedil;&atilde;o.",
				"es": "Ajusta la extensi&oacute;n geogr&aacute;fica del mapa teniendo como base las entidades seleccionadas de un tema.<br>Cuando el tema tiene una entidad selecciona esta opci&oacute;n se muestra como un peque&ntilde;o icono situado junto al nombre del tema.",
				"en": "It adjusts the map extent based on selected features of a theme.<br>When a theme has a selected feature this option will be displayed as a small icon next to the theme name.",
				"apijs": "i3GEO.tema.zoomsel(idtema)"
			},
			"79": {
				"titulo": {
					"pt": "Exporta SLD",
					"es": "Exporta SLD",
					"en": "Export SLD"
				},
				"diretorio": "i3geo/classesjs/classe_tema.js",
				"categoria": "5",
				"pt": "Exporta a legenda atual do tema para o formato SLD. O XML &eacute; mostrado na tela.<br>O formato SLD &eacute; utilizado em clientes WMS. Essa fun&ccedil;&atilde;o objetiva auxiliar a constru&ccedil;&atilde;o de web Services OGC.",
				"es": "Exporta la leyenda actual del tema al formato SLD. El XML se muestra en la pantalla.<br>El formato SLD es empleado en clientes WMS. Esta funci&oacute;n tiene como objetivo auxiliar la construcci&oacute;n del Servicio web OGC.",
				"en": "It exports the current legend of the theme in SLD format. The XML file is displayed on the screen.<br>SLD format is used by WMS clients. This tool helps you to build OGC Web Services.",
				"apijs": "i3GEO.tema.dialogo.sld(idtema) Esta op&ccedil;&atilde;o n&atilde;o possu&iacute; um diret&oacute;rio em i3geo/ferramentas. O XML &eacute; gerado diretamente na tela pelo programa classesphp/mapa_controle.php"
			},
			"80": {
				"titulo": {
					"pt": "Inserir gr&aacute;fico interativamente",
					"es": "Insertar gr&aacute;fico interactivamente",
					"en": "Insert chart interactively"
				},
				"diretorio": "i3geo/ferramentas/inseregrafico",
				"categoria": "5",
				"pt": "Insere gr&aacute;ficos em um elemento de um tema de forma interativa.<br>Para inserir gr&aacute;ficos no mapa, &eacute; necess&aacute;rio escolher os atributos do tema que ser&atilde;o considerados para a gera&ccedil;&atilde;o do gr&aacute;fico. Feito isso, clique sobre um elemento do tema utilizado e o gr&aacute;fico ser&aacute; inserido no mapa na forma de um novo tema.",
				"es": "Inserta gr&aacute;ficos de una entidad de un tema de forma interactiva.<br>Para insertar gr&aacute;ficos en el mapa es necesario elegir los atributos del tema que ser&aacute;n considerados para la generaci&oacute;n del gr&aacute;fico. Hecho esto, haga clic en una entidad del tema utilizado y el gr&aacute;fico se insertar&aacute; en el mapa en la forma de un tema nuevo.",
				"en": "It inserts interactively charts of a theme feature.<br>In order to add charts to the map it is necessary to select attributes of a theme that will be used to create a chart. When you have done so, click on a feature of a selected theme and the chart will be added to the map as a new theme.",
				"apijs": "i3GEO.mapa.dialogo.cliqueGrafico()"
			},
			"81": {
				"titulo": {
					"pt": "Converter tema em KML",
					"es": "Convertir tema en KML",
					"en": "Convert theme to KML"
				},
				"diretorio": "i3geo/ferramentas/convertekml",
				"categoria": "5",
				"pt": "Convertendo um tema em KML &eacute; poss&iacute;vel utilizar outros softwares para visualizar os dados. O i3Geo permite isso de duas maneiras, a primeira utiliza um WMS embutido dentro de um KML, ou seja, os dados s&atilde;o vistos como uma imagem raster georreferenciada, sendo que as coordenadas e atributos n&atilde;o s&atilde;o acess&iacute;veis diretamente.Dessa forma, grandes volumes de dados podem ser utilizados, pois n&atilde;o ocorre o download dos arquivos.<p>A segunda maneira converte os dados de um tema em arquivos KML compactados contendo as coordenadas e atributos dos elementos que comp&otilde;em o tema.<br>KML &eacute; um padr&atilde;o internacional e n&atilde;o &eacute; espec&iacute;fico do i3Geo. Conforme as caracter&iacute;sticas de cada servidor onde o i3Geo estiver instalado, o KML poder&aacute; permanecer dispon&iacute;vel por per&iacute;odos de tempo vari&aacute;veis. Para usar o KML no Google Earth, utilize a op&ccedil;&atilde;o desse software chamada 'adicionar link de rede'",
				"es": "Al convertir un tema en KML es posible utilizar otro software para visualizar los datos. En i3Geo esto es posible de dos maneras.  La primera utiliza un WMS incrustado dentro de un KML, o sea, los datos se ven como una imagen raster georreferenciada, haciendo que las coordenadas y atributos no sean accesibles directamente. De esta forma, grandes vol&uacute;menes de datos se pueden utilizar ya que no se descargan los archivos.<p>La segunda forma convierte los datos de un tema en archivos KML comprimidos que contienen las coordenadas y atributos de las entidades que conforman el tema.<br>KML es un est&aacute;ndar internacional y no es espec&iacute;fico de i3Geo. De acuerdo con las caracter&iacute;sticas de cada servidor donde est&aacute; instalado i3Geo, el KML puede permanecer disponible por per&iacute;odos de tiempo variables. Para utilizar KML en Google Earth utilice la opci&oacute;n de este software llamada 'agregar v&iacute;nculo de red'",
				"en": "When you transform a theme into a KML it is possible to use other software to visualize data. In i3Geo this is possible in two ways. The first method uses a WMS embedded inside a KML, that is, data is rendered as a georeferenced raster image, in consequence, coordinates and attributes are not directly accessible. In this way, large amount of data can be used since you do not need to download files.<p>The second method transforms data of a theme into compressed KML files that contain coordinates and attributes of features that make up a theme.<br>KML is an international standard and is not specific to i3Geo. According to specifications of the server where i3Geo is installed, a KML can remain available for varying periods of time. To use a KML on Google Earth use the option of this software called 'add network link'",
				"apijs": "i3GEO.mapa.dialogo.convertekml()"
			},
			"82": {
				"titulo": {
					"pt": "Download",
					"es": "Descargar",
					"en": "Download"
				},
				"diretorio": "i3geo/ferramentas/download",
				"categoria": "2",
				"pt": "Permite o download de um tema escolhido. No caso de dados vetoriais derivados de outros temas ou camadas com elementos selecionados, os dados s&atilde;o sempre fornecidos no formato 'shapefile'. Nos outros casos, o arquivo fornecido depender&aacute; da configura&ccedil;&atilde;o de cada camada, mas, por padr&atilde;o, os dados s&atilde;o fornecidos em 'shapefile'",
				"es": "Permite la descarga de un tema elegido. En el caso de datos vectoriales derivados de otros temas o capas con entidades seleccionadas, los datos se suministran siempre en el formato 'shapefile'. En los dem&aacute;s casos, el archivo proporcionado depender&aacute; de la configuraci&oacute;n de cada capa, pero de forma predeterminada, los datos se proporcionan en 'shapefile'",
				"en": "It allows you to download a selected theme. In the case of vector data derived from other themes or layers with select features, data is always supplied in shapefile format. In other cases, delivered file format will depend on the configuration of each layer, but by default, data is provided in 'shapefile' format",
				"apijs": "i3GEO.tema.dialogo.download()"
			},
			"83": {
				"titulo": {
					"pt": "Inserir texto interativamente",
					"es": "Insertar texto interactivamente",
					"en": "Insert text interactively"
				},
				"diretorio": "i3geo/ferramentas/inseretxt",
				"categoria": "5",
				"pt": "Insere textos em local do mapa de forma interativa.<br>Voc&ecirc; pode inserir um texto espec&iacute;fico no mapa simplesmente digitando o texto na janela da ferramenta e clicando no local desejado no mapa, ou ainda utilizar os atributos de uma camada para capturar o texto da regi&atilde;o clicada.<br>Na guia 'Propriedades' voc&ecirc; pode alterar algumas configura&ccedil;&otilde;es do texto, como cor, tamanho, fonte etc.",
				"es": "Insertar textos en alg&uacute;n lugar del mapa de forma interactiva.<br>Puede introducir un texto espec&iacute;fico en el mapa simplemente escribiendo el texto en la ventana de la herramienta y haciendo clic en la ubicaci&oacute;n que desee en el mapa, o utilice los atributos de una capa para capturar el texto de la regi&oacute;n sobre la que se ha hecho clic.<br>En la ficha &lsquo;Propiedades&rsquo;, usted puede hacer algunos ajustes del texto como el color, el tama&ntilde;o, la fuente, etc.",
				"en": "It inserts interactively texts somewhere on the map.<br>You can enter a text on the map by simply typing the text in the window of this tool and clicking on a desired location on the map. You can also use layer attributes to capture the text of a region on which you clicked.<br>On the 'Properties' tab, you can modify some text settings such as color, size, font, etc.",
				"apijs": "i3GEO.mapa.dialogo.cliqueTexto()"
			},
			"83a": {
				"titulo": {
					"pt": "Inserir ponto interativamente",
					"es": "Insertar punto interactivamente",
					"en": "Insert point interactively"
				},
				"diretorio": "i3geo/ferramentas/inserexy2",
				"categoria": "5",
				"pt": "Insere pontos em local do mapa de forma interativa.<br>Para inserir pontos &eacute; necess&aacute;rio selecionar um tema edit&aacute;vel. Caso seu mapa n&atilde;o possua nenhum tema edit&aacute;vel ou queira criar um novo, clique em &lsquo;Criar um tema edit&aacute;vel&rsquo;.<br>Existem 4 formas de se inserir pontos no mapa:<br>1- Manualmente, na guia &lsquo;Tema&rsquo;, incluindo os pontos no mapa a partir de cliques na localiza&ccedil;&atilde;o desejada;<br>2 - Na guia &lsquo;Direc/dist&rsquo; informando um &acirc;ngulo e uma dist&acirc;ncia em km a partir de um ponto inicial;<br>3 - Digitando os valores das coordenadas x e y na guia &lsquo;Digitar&rsquo;;<br>4 - Colando uma lista de pares de coordenadas x e y separadas por espa&ccedil;o e com sinal de negativo para coordenadas oeste e sul na guia &lsquo;Colar&rsquo;.<br>Para alterar a proje&ccedil;&atilde;o das coordenadas inseridas acesse a guia &lsquo;Configura&ccedil;&otilde;es&rsquo;. A proje&ccedil;&atilde;o padr&atilde;o &eacute; WGS 84.<br>Voc&ecirc; pode ainda converter a lista de coordenadas criadas para uma lista em formato WKT ou utilizar os pontos para criar temas lineares e poligonares. Na guia &lsquo;Coordenadas&rsquo; voc&ecirc; pode ver a lista de pares de coordenadas criados por voc&ecirc;.",
				"es": "Inserta puntos en el mapa de forma interactiva.<br>Para insertar puntos es necesario seleccionar un tema editable. Si su mapa no tiene ning&uacute;n tema editable o desea crear uno nuevo haga clic en 'Crear un tema editable'.<br>Existen 4 formas de insertar puntos en el mapa:<br>1- Manualmente, en la pesta&ntilde;a 'Tema', se incluyen los puntos en el mapa a partir de clics sobre el sitio deseado;<br>2 - En la pesta&ntilde;a 'Direc/dist', ingresando los valores del &aacute;ngulo y distancia en km desde un punto inicial;<br>3 - Introduciendo los valores de las coordenadas x e y en la pesta&ntilde;a 'Introducir';<br>4 &ndash; En la pesta&ntilde;a 'Pegar', subiendo una lista de pares de coordenadas x e y separadas por espacio y con signo de negativo para coordenadas oeste y sur.<br>Para cambiar la proyecci&oacute;n de las coordenadas insertadas acceda a la pesta&ntilde;a 'Configuraci&oacute;n'. La proyecci&oacute;n est&aacute;ndar es WGS 84.<br>Tambi&eacute;n puede convertir la lista de coordenadas creadas a una lista en formato WKT o utilizar los puntos para crear temas de l&iacute;neas y de pol&iacute;gonos. En la ficha 'Coordenadas', puede ver la lista de pares de coordenadas creadas por usted.",
				"en": "It inserts points on the map interactively.<br>In order to insert points, you should select an editable theme. If your map does not have an editable theme or you want to create a new one, click on 'Create an editable theme'.<br>There are 4 ways to insert points on the map:<br>1- Manually, on the 'Theme' tab. Click on different locations on the map to add points;<br>2 - On the 'Direc/dist' tab. Enter values of angle and distance in km from a starting point;<br>3 - Entering  x and y coordinate values on the 'Enter' tab;<br>4 - On the 'Paste' tab, upload a list of x and y coordinate pairs separated by space and with negative sign for west and south coordinates.<br>Go to the 'Configuration' tab to change the projection of inserted coordinates The standard projection is WGS 84.<br>You can also transform a list of created coordinates into a list in WKT format or use points to create line-based and polygon-based themes. On the 'Coordinates' tab, you can see the list of coordinate pairs created by you.",
				"apijs": ""
			},
			"84": {
				"titulo": {
					"pt": "Gr&aacute;fico interativo",
					"es": "Gr&aacute;fico interactivo",
					"en": "Interactive chart"
				},
				"diretorio": "i3geo/ferramentas/graficointerativo1",
				"categoria": "3",
				"pt": "Gerador de representa&ccedil;&atilde;o gr&aacute;fica de dados tabulares. Abre uma janela flutuante onde o usu&aacute;rio pode escolher os dados e o tipo de gr&aacute;fico desejado. Os dados s&atilde;o baseados em um dos temas existentes no mapa.<br>Existem v&aacute;rias op&ccedil;&otilde;es de tratamento dos dados que permitem, por exemplo, mostrar os percentuais ou os dados brutos. Pode-se ainda ativar a navega&ccedil;&atilde;o din&acirc;mica, o que permite atualizar o gr&aacute;fico conforme &eacute; feita a navega&ccedil;&atilde;o sobre o mapa.<br>O usu&aacute;rio deve escolher primeiramente qual tipo de gr&aacute;fico quer criar, depois insere os valores dos eixos x e y. O gr&aacute;fico ser&aacute; gerado na janela. Por fim, o usu&aacute;rio pode salv&aacute;-lo como uma imagem .png ou um arquivo .csv.",
				"es": "Generador de representaci&oacute;n gr&aacute;fica de datos tabulados. Abre una ventana flotante donde el usuario puede elegir los datos y el tipo de gr&aacute;fico deseado. Los datos se basan en uno de los temas del mapa.<br>Existen varias opciones de tratamiento de datos que permiten, por ejemplo, mostrar los porcentajes o los datos brutos. Se puede incluso habilitar la navegaci&oacute;n din&aacute;mica, lo que permite actualizar el gr&aacute;fico conforme se hace la navegaci&oacute;n sobre el mapa.<br>El usuario debe elegir primero el tipo de gr&aacute;fico quiere crear, despu&eacute;s inserta los valores de los ejes x e y. El gr&aacute;fico se generar&aacute; en la ventana. Por &uacute;ltimo, el usuario puede guardarlo como una imagen .png o un archivo .csv.",
				"en": "",
				"apijs": "i3GEO.analise.dialogo.graficoInterativo1()"
			},
			"85": {
				"titulo": {
					"pt": "Miniaturas",
					"es": "Miniaturas",
					"en": "Thumbnails"
				},
				"diretorio": "i3geo/ferramentas/carouseltemas",
				"categoria": "6",
				"pt": "Abre uma janela flutuante que mostra imagens miniatura de cada tema existente na &aacute;rvore de temas. O usu&aacute;rio pode clicar em uma das imagens para adicionar o tema ao mapa atual.<br>As miniaturas devem existir previamente para aparecerem nessa ferramenta. Para gerar as miniaturas, o administrador do i3Geo pode usar o sistema de administra&ccedil;&atilde;o.",
				"es": "Abre una ventana flotante que muestra im&aacute;genes en miniatura de cada tema del &aacute;rbol de temas. El usuario puede hacer clic en una de las im&aacute;genes para agregar el tema al mapa actual.<br>Las miniaturas deben estar previamente en el sistema para aparecer en esta herramienta. Para generar las miniaturas el administrador de i3Geo puede utilizar el sistema de administraci&oacute;n.",
				"en": "It opens a floating window that shows thumbnails of each theme on the theme tree. The user can click on one of the thumbnails to add a theme to the current map.<br>Thumbnails must be previously in the system to use them. The i3Geo administrator can use the management system to generate thumbnails.",
				"apijs": "i3GEO.arvoreDeTemas.dialogo.carouselTemas()"
			},
			"86": {
				"titulo": {
					"pt": "Editor SQL",
					"es": "Editor SQL",
					"en": "SQL editor"
				},
				"diretorio": "i3geo/ferramentas/editorsql",
				"categoria": "5",
				"pt": "Permite modificar o SQL utilizado para compor os dados referentes ao tema. Apenas temas baseados em bancos de dados podem utilizar essa fun&ccedil;&atilde;o, sendo que o administrador do i3Geo pode bloque&aacute;-la utilizando do sistema de administra&ccedil;&atilde;o. As fun&ccedil;&otilde;es SQL de modifica&ccedil;&atilde;o de dados n&atilde;o s&atilde;o suportadas (UPDATE, INSERT, DELETE, etc.)<br>O Mapserver utiliza uma express&atilde;o na linguagem SQL para definir os dados que ir&atilde;o compor um tema. A edi&ccedil;&atilde;o do SQL possibilita o uso de express&otilde;es customizadas, baseadas na sintaxe SQL que o banco de dados utilizado suportar. A janela de di&aacute;logo permite ainda listar as colunas dispon&iacute;veis bem como os dados de cada coluna, facilitando a defini&ccedil;&atilde;o do novo SQL.",
				"es": "Permite modificar el SQL utilizado para consultar los datos de un tema. Solo los temas estructurados en bases de datos pueden utilizar esta funci&oacute;n ya que el administrador de i3Geo puede bloquearla utilizando el sistema de administraci&oacute;n. Las funciones SQL de modificaci&oacute;n de datos (UPDATE, INSERT, DELETE, etc.) no son admitidas.<br>Mapserver utiliza una expresi&oacute;n en el lenguaje SQL para definir los datos que conforman un tema. La edici&oacute;n de SQL permite el uso de expresiones personalizadas basadas en la sintaxis SQL que admitan la base de datos utilizada. La ventana de di&aacute;logo tambi&eacute;n permite enumerar las columnas disponibles, as&iacute; como los datos de cada columna, facilitando la definici&oacute;n del SQL nuevo.",
				"en": "It allows you to modify a SQL used to query data of a theme. Only themes structured in databases can use this function since the i3Geo administrator can block it using the management system. SQL functions for data modification (UPDATE, INSERT, DELETE, etc.) are not supported.<br>Mapserver uses an expression in SQL language to define data that make up a theme. Editing a SQL allows you to use custom expressions based on the SQL syntax that support the database you want to use. The dialog box also allows you to list available columns, as well as data of each column. This helps you with building a new SQL.",
				"apijs": "i3GEO.tema.dialogo.editorsql()"
			},
			"87": {
				"titulo": {
					"pt": "Rede Metar",
					"es": "Red Metar",
					"en": "Metar network"
				},
				"diretorio": "i3geo/ferramentas/metar",
				"categoria": "8",
				"pt": "A rede <a href='http://weather.noaa.gov/' target='_blank' >metar</a> reune dados de esta&ccedil;&otilde;es meteorol&oacute;gicas espalhadas por toto o mundo. Essa ferramenta mostra as esta&ccedil;&otilde;es existentes na extens&atilde;o geogr&aacute;fica do mapa.<br>Os dados da rede Metar s&atilde;o acessados indiretamente por meio dos Web Services do site Geonames.",
				"es": "La red  <a href='http://weather.noaa.gov/' target='_blank' >Metar</a> re&uacute;ne datos de estaciones meteorol&oacute;gicas esparcidas por todo el mundo. Esta herramienta muestra las estaciones existentes en la extensi&oacute;n geogr&aacute;fica del mapa.<br>Se accede indirectamente a los datos de la red Metar a trav&eacute;s de los Servicios Web del sitio Geonames.",
				"en": "<a href='http://weather.noaa.gov/' target='_blank'>Metar</a>  network gathers data from meteorological stations scattered throughout the world. This tool displays existing stations in the map extent.<br>You can access indirectly Metar network data through Web Services of Geonames website.",
				"apijs": "i3GEO.navega.dialogo.metar"
			},
			"88": {
				"titulo": {
					"pt": "Linha do tempo",
					"es": "L&iacute;nea del tiempo",
					"en": "Timeline"
				},
				"diretorio": "i3geo/ferramentas/linhadotempo",
				"categoria": "3",
				"pt": "Constr&oacute;i um gr&aacute;fico do tipo 'linha do tempo' tendo como fonte dos dados a tabela de atributos de um tema. Veja: <a href='http://www.simile-widgets.org/timeline/' target=_blank >Simline</a><br>Ao navegar pelo mapa, o gr&aacute;fico &eacute; atualizado sendo utilizado apenas os dados existentes na extens&atilde;o do mapa. Ao passar o mouse sobre um dos nomes mostrados no gr&aacute;fico, &eacute; indicado a posi&ccedil;&atilde;o no mapa. Ao ser clicado um &iacute;cone no gr&aacute;fico, abre-se um bal&atilde;o com informa&ccedil;&otilde;es adicionais, podendo incluir links e imagens. O gr&aacute;fico s&oacute; &eacute; mostrado para os temas que estiverem configurados pelo administrador do i3Geo.",
				"es": "Construye un gr&aacute;fico del tipo 'l&iacute;nea del tiempo' teniendo como fuente de los datos la tabla de atributos de un tema. Ver: <a href='http://www.simile-widgets.org/timeline/' target=_blank >Simline</a><br>Al navegar por el mapa el gr&aacute;fico se actualiza utilizando solo los datos de su extensi&oacute;n actual. Al pasar el rat&oacute;n sobre uno de los nombres mostrados en el gr&aacute;fico, se indica la posici&oacute;n en el mapa. Al hacer clic sobre un icono del gr&aacute;fico se abre un recuadro con informaci&oacute;n adicional, en donde usted puede incluir enlaces e im&aacute;genes. El gr&aacute;fico solo se presenta para los temas que est&aacute;n configurados por el administrador de i3Geo.",
				"en": "It creates a 'timeline' chart using as data source the table of attributes of a theme. See: <a href='http://www.simile-widgets.org/timeline/' target=_blank >Simline</a><br>When you browse the map the chart is updated using only data displayed on the current map extent. When you hover the mouse over one of the names shown in the chart, the position on the map will be highlighted. When you click on a chart icon it will be open a box with additional information, you can also add links and images to this box. A 'timeline' chart can only be used for themes that are configured by the i3Geo administrator.",
				"apijs": "i3GEO.configura"
			},
			"89": {
				"titulo": {
					"pt": "Tipo de imagem",
					"es": "Tipo de imagen",
					"en": "Image Type"
				},
				"diretorio": "i3geo/ferramentas/outputformat",
				"categoria": "1",
				"pt": "Modifica o tipo de imagem utilizada na gera&ccedil;&atilde;o do mapa.<br>Modifica o par&acirc;metro OUTPUTFORMAT do mapa em uso permitindo-se escolher entre PNG e JPEG com tecnologia de gera&ccedil;&atilde;o AGG ou GD.",
				"es": "Modifica el tipo de imagen utilizada en la generaci&oacute;n del mapa.<br>Modifica el par&aacute;metro OUTPUTFORMAT del mapa en uso, permiti&eacute;ndole elegir entre PNG y JPEG con tecnolog&iacute;a de generaci&oacute;n AGG o GD.",
				"en": "It modifies the image type used to build a map.<br>It modifies the OUTPUTFORMAT parameter of the map in use. It also allows you to choose between PNG and JPEG with AGG or GD generation technology.",
				"apijs": "i3GEO.mapa.dialogo.outputformat()"
			},
			"90": {
				"titulo": {
					"pt": "Cortina",
					"es": "Cortina",
					"en": "Swipe"
				},
				"diretorio": "i3geo/ferramentas/cortina",
				"categoria": "5",
				"pt": "Permite mostrar e esconder uma camada existente no mapa em um movimento cont&iacute;nuo. O efeito 'cortina' permite comparar um tema com outro.",
				"es": "Permite mostrar y ocultar una capa existente en el mapa con un movimiento continuo tipo 'cortina'. El efecto 'cortina' permite comparar un tema con otro.",
				"en": "It allows to show and hide an existing layer on the map with a continuous movement named 'swipe'. 'Swipe' effect allows you to compare one theme with another.",
				"apijs": "i3GEO.tema.dialogo.cortina()"
			},
			"91": {
				"titulo": {
					"pt": "Aplicar SLD",
					"es": "Aplicar SLD",
					"en": "Apply SLD"
				},
				"diretorio": "i3geo/classesjs/classe_tema.js",
				"categoria": "5",
				"pt": "Aplica um arquivo XML, no formato SLD, ao tema ativo.<br>SLD &eacute; um formato padr&atilde;o que permite definir filtros e simbologia. V&aacute;rios softwraes permitem criar arquivos nesse padr&atilde;o.",
				"es": "Aplica un archivo XML en formato SLD al tema activo.<br>SLD es un formato est&aacute;ndar que permite definir filtros y simbolog&iacute;a. Varios softwares permiten crear archivos en este est&aacute;ndar.",
				"en": "It applies an XML file in SLD format to the active theme.<br>SLD is a standard format that allows you to define filters and symbology. Several software allow you to create files in this standard.",
				"apijs": "i3GEO.tema.dialogo.aplicarsld()"
			},
			"92": {
				"titulo": {
					"pt": "Salvar o mapfile",
					"es": "Guardar el mapfile",
					"en": "Save mapfile"
				},
				"diretorio": "i3geo/ferramentas/salvamapfile",
				"categoria": "5",
				"pt": "Salva as defini&ccedil;&otilde;es da camada no arquivo mapfile de origem.<br>Essa op&ccedil;&atilde;o s&oacute; &eacute; ativada para usu&aacute;rios que s&atilde;o administradores. Permite que a camada seja alterada, por exemplo, modificando-se a legenda, e que o resultado seja salvo nas defini&ccedil;&otilde;es originais da camada.",
				"es": "Guarda la configuraci&oacute;n de la capa en el archivo mapfile de origen.<br>Esta opci&oacute;n solo est&aacute; habilitada para los usuarios que son administradores. Permite modificar la capa, por ejemplo, alterar la leyenda y guardar los cambios en la configuraci&oacute;n original de la capa.",
				"en": "It saves a layer configuration in its source mapfile.<br>This option is only enabled for users who are administrators. It allows you to modify a layer, for example, modifying the legend and saving changes in the original configuration of a layer.",
				"apijs": "i3GEO.tema.dialogo.salvaMapfile()"
			},
			"93": {
				"titulo": {
					"pt": "Coment&aacute;rios",
					"es": "Comentarios",
					"en": "Comments"
				},
				"diretorio": "i3geo/ferramentas/comentarios",
				"categoria": "5",
				"pt": "Mostra os coment&aacute;rios existentes sobre o tema e permite ao usu&aacute;rio inserir novos.<br>Para entar com um coment&aacute;rio, o usu&aacute;rio precisa ser autenticado em alguma das redes sociais compat&iacute;veis com a rotina de login dispon&iacute;vel no i3Geo",
				"es": "Muestra los comentarios existentes sobre el tema y permite al usuario insertar nuevos.<br>Para ingresar un comentario el usuario necesita estar registrado en alguna de las redes sociales compatibles con la rutina de inicio de sesi&oacute;n disponible en i3Geo",
				"en": "It shows existing comments about a theme and allows the user to insert new ones.<br>In order to enter a comment, the user needs to be registered in any of the social networks compatible with the login routine available in i3Geo",
				"apijs": "i3GEO.tema.dialogo.comentario()"
			},
			"94": {
				"titulo": {
					"pt": "Centro m&eacute;dio",
					"es": "Centro medio",
					"en": "Mid center"
				},
				"diretorio": "i3geo/ferramentas/centromassa",
				"categoria": "3",
				"pt": "O centro m&eacute;dio &eacute; uma medida da distribui&ccedil;&atilde;o de um conjunto de pontos. Sendo definido por Gerardi & Silva (1980) como: o ponto que minimiza a soma das dist&acirc;ncias quadr&aacute;ticas a todos os outros pontos do plano.",
				"es": "El centro medio es una medida de la distribuci&oacute;n de un conjunto de puntos. Siendo definido por Gerardi & Silva (1980) como: el punto que minimiza la suma de las distancias cuadr&aacute;ticas a todos los otros puntos del plano.",
				"en": "Middle-center is a measure of the distribution of a set of points. It is defined by Gerardi & Silva (1980) as: the point that minimizes the sum of quadratic distances to all other points of the plane.",
				"apijs": "i3GEO.analise.dialogo.centromassa()"
			},
			"95": {
				"titulo": {
					"pt": "Temas mais populares",
					"es": "Temas m&aacute;s populares",
					"en": "Most popular themes"
				},
				"diretorio": "",
				"categoria": "4",
				"pt": "Cada vez que um usu&aacute;rio adiciona uma camada ao mapa, por meio do cat&aacute;logo de temas, &eacute; feito um registro no banco de dados de administra&ccedil;&atilde;o. Esse registro &eacute; cumulativo e permite classificar os temas conforme sua popularidade.",
				"es": "Cada vez que un usuario a&ntilde;ade una capa al mapa a trav&eacute;s del cat&aacute;logo de temas, se realiza un registro en la base de datos de administraci&oacute;n. Este registro es acumulativo y permite clasificar los temas seg&uacute;n su frecuencia de uso.",
				"en": "Each time a user adds a layer to the map through the theme catalog, a record is included in the administration database. This record is cumulative and allows you to classify themes according to their frequency of use.",
				"apijs": "i3GEO.arvoreDeTemas"
			},
			"96": {
				"titulo": {
					"pt": "Gr&aacute;fico de perfil",
					"es": "Gr&aacute;fico de perfil",
					"en": "Profile chart"
				},
				"diretorio": "",
				"categoria": "3",
				"pt": "Cria um gr&aacute;fico de perfil com base em um conjunto de dados contendo os valores de Z.<br>Os valores de Z podem ser obtidos de um tema ou de um servi&ccedil;o do tipo Google API",
				"es": "Crea un gr&aacute;fico de perfil basado en un conjunto de datos que contiene los valores de Z.<br>Los valores de Z se pueden obtener de un tema o de un servicio de tipo API de Google",
				"en": "It creates a profile chart based on a data set containing Z values.<br>Z values can be obtained from a theme or from a Google API service",
				"apijs": "i3GEO.analise"
			},
			"97": {
				"titulo": {
					"pt": "Filtro de camadas",
					"es": "Filtro de capas",
					"en": "Layer filter"
				},
				"diretorio": "",
				"categoria": "7",
				"pt": "Filtra as camadas que s&atilde;o mostradas na &aacute;rvore de camadas conforme as caracter&iacute;sticas de cada uma.",
				"es": "Filtra las capas del &aacute;rbol de capas seg&uacute;n las caracter&iacute;sticas de cada una.",
				"en": "It filters layers of the layer tree according to the characteristics of each one. ",
				"apijs": "i3GEO.arvoreDeCamadas.dialogo.filtro"
			},
			"98": {
				"titulo": {
					"pt": "Importar WMC",
					"es": "Importar WMC",
					"en": "Import WMC"
				},
				"diretorio": "i3geo/ferramentas/importarwmc",
				"categoria": "4",
				"pt": "Adiciona ao mapa camadas definidas em um arquivo XML no padr&atilde;o WMC 'Web Map Context'. O WMC permite que mapas sejam transferidos entre aplica&ccedil;&otilde;es.<br>O arquivo XML pode estar em um servidor ou pode ser feito o upload para o servidor do i3Geo",
				"es": "Agrega al mapa capas definidas en un archivo XML en el est&aacute;ndar WMC 'Web Map Context'. El WMC permite que los mapas se transfieran entre aplicaciones.<br>El archivo XML puede estar en un servidor o se puede subir al servidor de i3Geo",
				"en": "It adds to the map layers defined in an XML file in the WMC 'Web Map Context' standard. The WMC allows you to transfer maps between applications.<br>The XML file can be on a server or it can be uploaded to the i3Geo server",
				"apijs": "i3GEO.arvoreDeTemas.dialogo.importarwmc()"
			},
			"100": {
				"titulo": {
					"pt": "Upload KML",
					"es": "Cargar KML",
					"en": "Upload KML"
				},
				"diretorio": "i3geo/ferramentas/uploadkml",
				"categoria": "4",
				"pt": "Permite que o usu&aacute;rio fa&ccedil;a o upload de um arquivo KML ou KMZ para o servidor para que seja acrescentado como uma camada ao mapa.<br>O arquivo &eacute; armazenado no servidor temporariamente. &Eacute; necess&aacute;rio que o usu&aacute;rio saiba qual o tipo de elementos existentes no arquivo KML e qual o nome do folder que ser&aacute; utilizado.",
				"es": "Permite al usuario subir un archivo KML o KMZ al servidor para agregarlo como una capa al mapa.<br>El archivo se almacena en el servidor temporalmente. Es necesario que el usuario sepa cu&aacute;l es el tipo de entidades del archivo KML y cu&aacute;l es el nombre de la carpeta que se utilizar&aacute;.",
				"en": "It allows the user to upload a KML or KMZ file to the server to add it as a layer to the map.<br>This file is temporarily stored on the server. It is necessary that the user knows what type of feature the KML file is and what is the name of the folder that will be used.",
				"apijs": "i3GEO.arvoreDeTemas.dialogo.uploadkml()"
			},
			"101": {
				"titulo": {
					"pt": "Temporizador",
					"es": "Temporizador",
					"en": "Timer"
				},
				"diretorio": "",
				"categoria": "5",
				"pt": "Aplica um temporizador que atualiza uma determinada camada ap&oacute;s um intervalo de tempo e de forma cont&iacute;nua. Para finalizar o temporizador, digite o ou vazio e aplique novamente.",
				"es": "Aplica un temporizador que actualiza de forma continua una determinada capa luego de haber transcurrido un intervalo de tiempo. Para finalizar el temporizador introduzca un cero (0) o un espacio vac&iacute;o y vuelva a aplicarlo.",
				"en": "It applies a timer that continuously updates a certain layer after a time interval has elapsed. Enter a zero (0) or an empty space and reapply the timer to stop it.",
				"apijs": "i3GEO.tema.temporizador()"
			},
			"102": {
				"titulo": {
					"pt": "Opacidade interativa",
					"es": "Opacidad interactiva",
					"en": "Interactive opacity"
				},
				"diretorio": "i3geo/ferramentas/opacidademapa",
				"categoria": "7",
				"pt": "Altera a opacidade da camada selecionada de forma interativa. Aplica-se aos temas que n&atilde;o est&atilde;o definidos como 'fundo'. A altera&ccedil;&atilde;o &eacute; feita diretamente no objeto HTML, sendo que o efeito &eacute; imediato.",
				"es": "Cambia la opacidad de la capa seleccionada de forma interactiva. Se aplica a los temas que no se definen como 'fondo'. El cambio se realiza directamente en el objeto HTML y el efecto es inmediato.",
				"en": "It changes the opacity of a selected layer interactively. It is applied to themes that are not 'basemap'. This change is made directly in the HTML object and the effect is immediate.",
				"apijs": "i3GEO.mapa.dialogo.opacidade()"
			},
			"103": {
				"titulo": {
					"pt": "Upload de GPX",
					"es": "Cargar GPX",
					"en": "Upload GPX"
				},
				"diretorio": "i3geo/ferramentas/uploadgpx",
				"categoria": "4",
				"pt": "Permite que um arquivo do tipo GPX, normalmente gerado por programas que utilizam GPS, seja enviado ao servidor e inclu&iacute;do no mapa como uma nova camada. O arquivo GPX ser&aacute; armazenado no servidor onde o i3geo est&aacute; instalado e permanecer&aacute; l&aacute; at&eacute; que os arquivos tempor&aacute;rios sejam apagados.<br>N&atilde;o utilize essa op&ccedil;&atilde;o se existir alguma restri&ccedil;&atilde;o ao uso do arquivo e se a pol&iacute;tica de acesso aos dados, definidas pela entidade que hospeda o i3geo, n&atilde;o for compat&iacute;vel com essas restri&ccedil;&otilde;es.",
				"es": "Permite que un archivo de tipo GPX, normalmente generado por programas que utilizan GPS, sea enviado al servidor e incluido en el mapa como una capa nueva. El archivo GPX se almacenar&aacute; en el servidor donde est&aacute; instalado i3geo y permanecer&aacute; ah&iacute; hasta que se borren los archivos temporales.<br>No utilice esta opci&oacute;n si hay alguna restricci&oacute;n en uso del archivo y si la pol&iacute;tica de acceso a datos, definida por la entidad que aloja i3geo, no es compatible con estas condiciones.",
				"en": "It allows you to upload a GPX file (usually generated by programs that use GPS) to the server and add it to the map as a new layer. The GPX file will be stored on the server where i3geo is installed and will remain there until temporary files are deleted.<br>Do not use this option if there is any restriction on the use of this file and if the data access policy, defined by the organization hosting i3geo, is not compatible with these conditions.",
				"apijs": "i3GEO.arvoreDeTemas.dialogo.uploadgpx()"
			},
			"104": {
				"titulo": {
					"pt": "Upload de KML",
					"es": "Carga de KML",
					"en": "Upload KML"
				},
				"diretorio": "i3geo/ferramentas/uploadkml",
				"categoria": "4",
				"pt": "Permite que um arquivo do tipo KML, seja enviado ao servidor e inclu&iacute;do no mapa como uma nova camada. O arquivo KML ser&aacute; armazenado no servidor onde o i3geo est&aacute; instalado e permanecer&aacute; l&aacute; at&eacute; que os arquivos tempor&aacute;rios sejam apagados.<br>N&atilde;o utilize essa op&ccedil;&atilde;o se existir alguma restri&ccedil;&atilde;o ao uso do arquivo e se a pol&iacute;tica de acesso aos dados, definidas pela entidade que hospeda o i3geo, n&atilde;o for compat&iacute;vel com essas restri&ccedil;&otilde;es.",
				"es": "Permite que un archivo del tipo KML sea enviado al servidor e incluido en el mapa como una capa nueva. El archivo KML se almacenar&aacute; en el servidor donde se instala i3geo y permanecer&aacute; ah&iacute; hasta que se borren los archivos temporales.<br>No utilice esta opci&oacute;n si hay alguna restricci&oacute;n en uso del archivo y si la pol&iacute;tica de acceso a datos, definida por la entidad que aloja i3geo, no es compatible con estas condiciones.",
				"en": "It allows you to upload a KML file to the server and add it to the map as a new layer. The KML file will be stored on the server where i3geo is installed and will remain there until temporary files are deleted.<br>Do not use this option if there is any restriction on the use of this file and if the data access policy, defined by the organization hosting i3geo, is not compatible with these conditions.",
				"apijs": "i3GEO.arvoreDeTemas.dialogo.uploadkml()"
			},
			"105": {
				"titulo": {
					"pt": "Conex&atilde;o KML",
					"es": "Conexi&oacute;n KML",
					"en": "KML connection"
				},
				"diretorio": "i3geo/ferramentas/carregakml",
				"categoria": "4",
				"pt": "Cria um novo layer com base no endere&ccedil;o (url) de um arquivo KML ou a partir de um registro na lista de conex&otilde;es KML predefinida no sistema de administra&ccedil;&atilde;o. O layer &eacute; baseado em uma conex&atilde;o OGR.<br>S&atilde;o criadas 3 novas camadas no mapa, uma para pontos, uma para linhas e outra para os pol&iacute;gonos. N&atilde;o necessariamente existir&atilde;o elementos nas tr&ecirc;s camadas.",
				"es": "Crea una capa nueva basada en la direcci&oacute;n (url) de un archivo KML, o desde un registro de la lista de conexiones KML predeterminada en el sistema de administraci&oacute;n. La capa se basa en una conexi&oacute;n OGR.<br>Se crean tres capas nuevas en el mapa, una para puntos, una para l&iacute;neas y otra para los pol&iacute;gonos. No necesariamente existir&aacute;n entidades en las tres capas.",
				"en": "It creates a new layer based on an address (url) of a KML file, or from a record of the KML connection list predetermined in the management system. The layer is based on an OGR connection.<br>Three new layers will be created on the map, one for points, one for lines and another for polygons. The three layers will not necessarily contain features.",
				"apijs": "i3GEO.arvoreDeTemas.carregakml()"
			},
			"106": {
				"titulo": {
					"pt": "Conex&atilde;o GeoJson",
					"es": "Conexi&oacute;n GeoJson",
					"en": "GeoJson connection"
				},
				"diretorio": "i3geo/ferramentas/conectargeojson",
				"categoria": "4",
				"pt": "Cria um novo layer com base no endere&ccedil;o (url) de um arquivo no formato GeoJson. O layer &eacute; baseado em uma conex&atilde;o OGR.<br>S&atilde;o criadas 3 novas camadas no mapa, uma para pontos, uma para linhas e outra para os pol&iacute;gonos. N&atilde;o necessariamente existir&atilde;o elementos nas tr&ecirc;s camadas.",
				"es": "Crea una capa nueva basada en la direcci&oacute;n (url) de un archivo en formato GeoJson. La capa se basa en una conexi&oacute;n OGR.<br>Se crean tres capas nuevas en el mapa, una para puntos, una para l&iacute;neas y otra para los pol&iacute;gonos. No necesariamente existir&aacute;n entidades en las tres capas.",
				"en": "It creates a new layer based on an address (url) of a file in GeoJson format. The layer is based on an OGR connection.<br>Three new layers will be created on the map, one for points, one for lines and another for polygons. The three layers will not necessarily contain features.",
				"apijs": "i3GEO.arvoreDeTemas.conectargeojson()"
			},
			"107": {
				"titulo": {
					"pt": "Anima&ccedil;&atilde;o",
					"es": "Animaci&oacute;n",
					"en": "Animation"
				},
				"diretorio": "i3geo/ferramentas/animacao",
				"categoria": "1",
				"pt": "Mostra camadas em uma sequ&ecirc;ncia definida pelo usu&aacute;rio e em um determinado intervalo de tempo. As camadas s&atilde;o automaticamente desligadas e ligadas, formando uma sequ&ecirc;ncia que proporciona um efeito de anima&ccedil;&atilde;o",
				"es": "Muestra las capas en una secuencia definida por el usuario y en un intervalo de tiempo determinado. Las capas se desconectan y conectan autom&aacute;ticamente para formar una secuencia que proporciona un efecto de animaci&oacute;n",
				"en": "It shows layers in a sequence and time interval defined by the user. Layers are automatically disconnected and connected to create a sequence that produce an animation effect",
				"apijs": "i3GEO.mapa.dialogo.animacao()"
			},
			"109": {
				"titulo": {
					"pt": "Busca de metadados na INDE",
					"es": "B&uacute;squeda de metadatos en INDE",
					"en": "Metadata search on INDE"
				},
				"diretorio": "i3geo/ferramentas/buscainde",
				"categoria": "8",
				"pt": "Busca metadados no banco de dados da Infraestrutura Nacional de Dados Espaciais (INDE) do Brasil.<br>A busca ainda &eacute; experimental, permitindo apenas a localiza&ccedil;&atilde;o dos registros, sem que o tema possa ser adicionado diretamente ao mapa.",
				"es": "Busca metadatos en la base de datos de la Infraestructura Nacional de Datos Espaciales (INDE) de Brasil.<br>La b&uacute;squeda todav&iacute;a es experimental, permitiendo solamente la localizaci&oacute;n de los registros sin que el tema pueda ser agregado directamente al mapa.",
				"en": "It searches for metadata in the database of the National Spatial Data Infrastructure (INDE) of Brazil.<br>Searching is still experimental, so it allows you only to locate records without adding themes to the map.",
				"apijs": "i3GEO.arvoreDeTemas.dialogo.buscainde()"
			},
			"110": {
				"titulo": {
					"pt": "Remove camadas em lote",
					"es": "Elimina las capas por lotes",
					"en": "Remove layers in batch"
				},
				"diretorio": "i3geo/ferramentas/excluirarvore",
				"categoria": "6",
				"pt": "Lista as camadas que est&atilde;o no mapa para que o usu&aacute;rio escolha quais deseja remover. As camadas utilizadas no in&iacute;cio do mapa aparecem desmarcadas na lista.",
				"es": "Presenta una lista de las capas que est&aacute;n en el mapa para que el usuario elija cu&aacute;l desea quitar. Las capas utilizadas al principio del mapa aparecen como no marcadas en la lista.",
				"en": "It shows a list of layers that are on the map so that you can select which layer you want to delete. Layers in use at the beginning of the map are not ticked on the list.",
				"apijs": "i3GEO.arvoreDeCamadas.dialogo.excluir()"
			},
			"111": {
				"titulo": {
					"pt": "Localiza regi&otilde;es cadastradas",
					"es": "Localiza regiones registradas",
					"en": "Locate registered regions"
				},
				"diretorio": "i3geo/ferramentas/metaestat",
				"categoria": "6",
				"pt": "Lista as regi&otilde;es cadastradas no sistema de metadados estat&iacute;sticos conforme a hierarquia definida. Conforme uma regi&atilde;o &eacute; escolhida, o mapa tem a extens&atilde;o geogr&aacute;fica alterada, destacando a escolha. Essa mesma ferramenta &eacute; usada para aplicar filtros. Os filtros funcionam apenas nas camadas que forem oriundas da aplica&ccedil;&atilde;o de gera&ccedil;&atilde;o de cartogramas estat&iacute;sticos.",
				"es": "Presenta una lista de las regiones registradas en el sistema de metadatos estad&iacute;sticos de acuerdo a la jerarqu&iacute;a definida. Cuando se selecciona una regi&oacute;n se altera la extensi&oacute;n geogr&aacute;fica del mapa, destac&aacute;ndose de esta manera la selecci&oacute;n. Esta herramienta se utiliza tambi&eacute;n para aplicar filtros. Los filtros solo funcionan en las capas que se derivan de la aplicaci&oacute;n que genera cartogramas estad&iacute;sticos.",
				"en": "It shows a list of regions registered in the statistical metadata system according to a defined hierarchy. When you select a region, the map extent is modified and the selection is highlighted. This tool is also used to apply filters. Filters only work on layers derived from the application that creates statistical cartograms.",
				"apijs": "i3GEO.mapa.dialogo.locregiao()"
			},
			"112": {
				"titulo": {
					"pt": "&Aacute;rvore de endere&ccedil;os WMS Metaestat",
					"es": "&Aacute;rbol de direcciones WMS Metaestat",
					"en": "Web address tree of WMS Metaestat"
				},
				"diretorio": "classe_arvoredetemas.js",
				"categoria": "4",
				"pt": "Mostra os WMS cuja origem &eacute; o sistema de metadados estat&iacute;sticos. Esse sistema apresenta cartogramas gerados de forma din&acirc;mica no padr&atilde;o WMS-Time.",
				"es": "Muestra los WMS cuyo origen es el sistema de metadatos estad&iacute;sticos. Este sistema presenta cartogramas generados de forma din&aacute;mica en el est&aacute;ndar WMS-Time.",
				"en": "It shows WMS originated from the statistical metadata system. This system shows cartograms dynamically created according to the WMS-Time standard.",
				"apijs": "i3GEO.arvoreDeTemas.listaWMSmetaestat(node)"
			},
			"113": {
				"titulo": {
					"pt": "Marcador",
					"es": "Marcador",
					"en": "Bookmark"
				},
				"diretorio": "classe_marcador.js",
				"categoria": "7",
				"pt": "Os marcadores permitem armazenar a regi&atilde;o de abrang&ecirc;ncia do mapa que est&aacute; sendo visto para que seja poss&iacute;vel voltar a essa regi&atilde;o. Para cinar as op&ccedil;&otilde;es de marca&ccedil;&atilde;o utilize a op&ccedil;&atilde;o Marcadores existente no menu suspenso. O menu permite remover marcadores, exportar, importar e converter em shapefile. Os marcadores s&atilde;o mantidos como cookies no navegador, por isso, ao limpar o seu hist&oacute;rico os registros podem ser perdidos. Para evitar isso, exporte seus marcadores como texto e depois importe-os novamente.",
				"es": "Los marcadores permiten almacenar la vista actual del mapa de manera de poder navegar de regreso a esa &aacute;rea. Para obtener las opciones de marcaci&oacute;n utilice la opci&oacute;n Marcadores en el men&uacute; desplegable. El men&uacute; permite eliminar, exportar e importar marcadores, as&iacute; como convertir en shapefile. Los marcadores se mantienen como cookies en el navegador, por lo que al borrar su historial se pueden perder los registros. Para evitar esto, exporte sus marcadores como texto y luego importe de nuevo.",
				"en": "Bookmarks allow you to store the current view of the map in order to browse back to that area. Use the Bookmarks option in the drop-down menu to create a bookmark. This menu allows you to delete, export and import bookmarks, as well as convert to shapefile. Bookmarks are kept as cookies in the browser, so when you delete your history your records are deleted too. To avoid this, export your bookmarks as text and then import them again.",
				"apijs": "i3GEO.marcador.prompt()"
			},
			"114": {
				"titulo": {
					"pt": "Visualizador INDE",
					"es": "Visualizador INDE",
					"en": "INDE viewer "
				},
				"diretorio": "i3geo/ferramentas/vinde",
				"categoria": "7",
				"pt": "Essa ferramenta apresenta os servi&ccedil;os WMS cadastrados no servidor da Infraestrutura Nacional de Dados Espaciais do Brasil. O usu&aacute;rio pode escolher diferentes camadas para visualiza&ccedil;&atilde;o e consulta.",
				"es": "Esta herramienta presenta los servicios WMS registrados en el servidor de la Infraestructura Nacional de Datos Espaciales de Brasil. El usuario puede elegir diferentes capas para la visualizaci&oacute;n y la consulta.",
				"en": "This tool shows WMS services registered on the server of the National Spatial Data Infrastructure of Brazil. The user can select different layers for viewing and consulting.",
				"apijs": "i3GEO.arvoreDeTemas.dialogo.vinde()"
			},
			"115": {
				"titulo": {
					"pt": "Prefer&ecirc;ncias",
					"es": "Preferencias",
					"en": "Preferences"
				},
				"diretorio": "i3geo/ferramentas/preferencias",
				"categoria": "1",
				"pt": "Guarda as prefer&ecirc;ncias do usu&aacute;rio em rela&ccedil;&atilde;o aos par&acirc;metros que controlam a interface do mapa.<br>O usu&aacute;rio pode definir as prefer&ecirc;ncias para a interface do mapa, por exemplo, as configura&ccedil;&otilde;es iniciais de menu e ferramentas, temas que iniciam abertos, extens&atilde;o inicial do mapa etc. As informa&ccedil;&otilde;es de prefer&ecirc;ncias ficam armazenadas como cookies do navegador e podem ser restauradas para as configura&ccedil;&otilde;es iniciais por meio da bot&atilde;o ''Limpar'' ou pela limpeza dos cookies diretamente pelo navegador. Para que as escolhas afetem de forma permanente o mapa, &eacute; necess&aacute;rio incluir o c&oacute;digo javascript diretamente no HTML da interface do mapa. A op&ccedil;&atilde;o 'c&oacute;digo' ir&aacute; mostrar esse c&oacute;digo",
				"es": "Guarda las preferencias del usuario en relaci&oacute;n a los par&aacute;metros que controlan la interfaz del mapa.<br>El usuario puede definir las preferencias para la interfaz de mapa, por ejemplo, las configuraciones iniciales de men&uacute; y herramientas, temas que inician abiertos, extensi&oacute;n inicial del mapa, etc. La informaci&oacute;n de preferencias se almacena como cookies del navegador y se puede restaurar a la configuraci&oacute;n inicial mediante el bot&oacute;n ''Borrar'' o la limpieza de las cookies directamente en el navegador. Para que las opciones afecten de forma permanente al mapa, es necesario incluir el c&oacute;digo javascript directamente en el HTML de la interfaz del mapa. La opci&oacute;n 'c&oacute;digo' mostrar&aacute; este c&oacute;digo",
				"en": "It saves user preferences relating to parameters that control the map interface.<br>The user can define preferences for the map interface, for example, initial settings of menus and tools, themes that will start open, initial map extent, etc. Preference data is stored as cookies and can be restored to the initial configuration by clicking on the ''Delet'' button or cleaning cookies directly in the browser. If you want the preferences to keep on the map interface, you must include the javascript code shown by the 'code' option. This code should be included in the HTML file of the map interface",
				"apijs": "i3GEO.mapa.dialogo.preferencias()"
			},
			"116": {
				"titulo": {
					"pt": "Upload de s&iacute;mbolo",
					"es": "Carga de s&iacute;mbolo",
					"en": "Upload symbol"
				},
				"diretorio": "i3geo/ferramentas/uploadsimbolo",
				"categoria": "4",
				"pt": "Envia para o servidor um arquivo de imagem que poder&aacute; ser utilizado como s&iacute;mbolo nas legendas das camadas",
				"es": "Env&iacute;a al servidor un archivo de imagen que se puede utilizar como s&iacute;mbolo en las leyendas de las capas",
				"en": "It uploads to the server an image file that will be used as symbol for layer legends",
				"apijs": ""
			},
			"117": {
				"titulo": {
					"pt": "SAIKU",
					"es": "SAIKU",
					"en": "SAIKU"
				},
				"diretorio": "i3geo/ferramentas/saiku",
				"categoria": "5",
				"pt": "Abre o sistema Saiku que permite o cruzamento de vari&aacute;veis estat&iacute;sticas. O Saiku utiliza o sistema de metadados estat&iacute;sticos para gerar cubos tridimensionais que permitem ao cruzamento de dados tabulares, gera&ccedil;&atilde;o de gr&aacute;ficos e relat&oacute;rios. O usu&aacute;rio deve adicionar ao mapa pelo menos uma camada com localidades originadas do sistema de metadados. Os elementos dessa camada que estiverem selecionados ser&atilde;o utilizados como filtro no Saiku.<br>As vari&aacute;veis cruzadas no Saiku podem gerar artefatos como tabelas, gr&aacute;ficos, relat&oacute;rios e mapas que podem ser visualizados no i3Geo utilizando o bot&atilde;o 'Atualiza o mapa' presente na ferramenta de integra&ccedil;&atilde;o entre os sistemas.",
				"es": "Abre el sistema Saiku que permite el cruce de variables estad&iacute;sticas. Saiku utiliza el sistema de metadatos estad&iacute;sticos para generar cubos tridimensionales que permiten el cruce de datos tabulados y crear gr&aacute;ficos e informes. El usuario debe agregar al mapa al menos una capa con localidades generadas por el sistema de metadatos. Las entidades seleccionadas de esta capa se utilizar&aacute;n como filtro en el Saiku.<br>Las variables cruzadas en Saiku pueden generar objetos como tablas, gr&aacute;ficos, informes y mapas que se pueden ver en i3Geo utilizando el bot&oacute;n 'Actualizar el mapa' presente en la herramienta de integraci&oacute;n entre los sistemas.",
				"en": "It opens the Saiku system that allows you to intersect statistical variables. Saiku uses the statistical metadata system to create three-dimensional cubes that allow you to intersect data in tables and create charts and reports. The user must add to the map at least one layer with localities generated by the metadata system. Features selected from this layer will be used as filter in the Saiku.<br>Intersected variables in Saiku can generate objects such as tables, charts, reports and maps that can be visualized in i3Geo using the 'Update map' button located on the integration tool between systems.",
				"apijs": ""
			},
			"118": {
				"titulo": {
					"pt": "Geolocation",
					"es": "Geolocalizaci&oacute;n",
					"en": "Geolocation"
				},
				"diretorio": "i3geo/ferramentas/geolocal",
				"categoria": "6",
				"pt": "Captura as coordenadas da posi&ccedil;&atilde;o atual do usu&aacute;rio a partir do navegador. As coordenadas s&atilde;o capturadas individualmente ou por um intervalo de tempo. Os dados s&atilde;o mostrados em uma lista e no mapa.<br>&Eacute; necess&aacute;rio que o usu&aacute;rio permita ao navegador identificar a sua localiza&ccedil;&atilde;o.",
				"es": "Captura las coordenadas de la posici&oacute;n actual del usuario desde el navegador. Las coordenadas se capturan individualmente o por intervalo de tiempo. Los datos se muestran en una lista y en el mapa.<br>Es necesario que el usuario permita al navegador identificar su ubicaci&oacute;n.",
				"en": "It captures coordinates of the user's current location using the browser. Coordinates will be captured individually or by time interval. Data will be displayed on a list and on the map.<br>It is necessary that the user allows the browser to identify his/her location.",
				"apijs": "i3GEO.mapa.dialogo.geolocal()"
			},
			"119": {
				"titulo": {
					"pt": "Cria uma c&oacute;pia",
					"es": "Crea una copia",
					"en": "Create a copy"
				},
				"diretorio": "i3geo/classesjs/classe_camadas.js",
				"categoria": "5",
				"pt": "Cria uma c&oacute;pia de uma camada existente no mapa e adiciona com novo nome.",
				"es": "Crea una copia de una capa existente en el mapa y la agrega con nombre nuevo.",
				"en": "It creates a copy of an existing layer on the map and add it with a new name.",
				"apijs": "i3GEO.tema.copia(idtema)"
			},
			"120": {
				"titulo": {
					"pt": "V&iacute;ncula dados entre tabelas",
					"es": "V&iacute;ncula datos entre tablas",
					"en": "Link data between tables"
				},
				"diretorio": "i3geo/ferramentas/tabela/index.js",
				"categoria": "5",
				"pt": "Op&ccedil;&atilde;o utilizada na ferramenta tabela que pemrite vincular a listagem de registros entre tabelas que estejam em diferentes janelas flutuantes. Ao abrir duas tabelas de atributos, a janela de v&iacute;nculos permite definir quais as tabelas ser&atilde;o vinculadas e quais as colunas de liga&ccedil;&atilde;o. Ao marcar um registro em uma tabela, os registros semelhantes s&atilde;o marcados nas tabelas vinculadas.",
				"es": "Opci&oacute;n utilizada en la herramienta de tabla que permite enlazar el listado de registros entre tablas que est&aacute;n en diferentes ventanas flotantes. Al abrir dos tablas de atributos la ventana de v&iacute;nculos permite definir cu&aacute;les tablas se vincular&aacute;n y cu&aacute;les son las columnas de conexi&oacute;n. Al marcar un registro en una tabla los registros similares se marcar&aacute;n en las tablas vinculadas.",
				"en": "Option used on the table tool that allows you to link list of records between tables that are in various floating windows. When you open two attribute tables, a link window will allow you to define which tables will be linked and which are the connection columns. When you tick a record in a table, similar records will be ticked in the connected tables.",
				"apijs": ""
			},
			"121": {
				"titulo": {
					"pt": "Mapa de calor",
					"es": "Mapa de calor",
					"en": "Heatmap"
				},
				"diretorio": "i3geo/ferramentas/heatmap/index.js",
				"categoria": "3",
				"pt": "Obt&eacute;m os dados de um tema pontual, linear ou poligonal e calcula para toda a &aacute;rea vis&iacute;vel os prov&aacute;veis valores. O resultado &eacute; uma representa&ccedil;&atilde;o cont&iacute;nua dos valores em classes de cores. O c&aacute;lculo da camada &eacute; feito diretamente no navegador utilizando-se um programa em javascript.<br>A ferramenta adiciona um novo tema ao mapa contendo o mapa de calor e utiliza como refer&ecirc;ncia para a cria&ccedil;&atilde;o da legenda as classes da camada original. No caso de camadas lineares ou poligonais, ser&aacute; considerado o centroide de cada elemento.",
				"es": "Obtiene los datos de un tema de puntos, de l&iacute;neas o de pol&iacute;gonos y calcula para toda el &aacute;rea visible los valores probables. El resultado es una representaci&oacute;n continua de los valores en clases de colores. El c&aacute;lculo de la capa se hace directamente en el navegador utilizando un programa en javascript.<br>La herramienta agrega un tema nuevo al mapa que contiene el mapa de calor y lo utiliza como referencia para crear la leyenda de las clases de la capa original. En el caso de las capas de l&iacute;neas y pol&iacute;gonos, se considerar&aacute; el centroide de cada entidad.",
				"en": "It obtains data from a point, line or polygon-based theme and calculates probable values for the entire visible area. The result is a continuous depiction of values in color classes. The layer computation is done directly in the browser using a javascript program.<br>This tool adds a new theme to the map that contains a heatmap and uses it as reference to create the legend of the original layer classes. In the case of the layers of lines and polygons, the centroid of each feature will be considered.",
				"apijs": "i3GEO.mapa.dialogo.heatmap()"
			},
			"122": {
				"titulo": {
					"pt": "MarkerCluster",
					"es": "MarkerCluster",
					"en": "MarkerCluster"
				},
				"diretorio": "i3geo/ferramentas/markercluster/index.js",
				"categoria": "3",
				"pt": "Cria uma camada vetorial com pontos que s&atilde;o agrupados conforme a proximidade. Os pontos agrupados s&atilde;o representados com um s&iacute;mbolo especial e &eacute; mostrado um texto indicando o total de pontos.",
				"es": "Crea una capa vectorial con puntos que se agrupan seg&uacute;n su proximidad. Los puntos agrupados se representan con un s&iacute;mbolo especial y se muestra un texto que indica el total de puntos.",
				"en": "It creates a vector layer with points that are grouped according to their proximity. Grouped points are depicted by a special symbol and it is displayed a text indicating the total number of points.",
				"apijs": "i3GEO.mapa.dialogo.markercluster()"
			},
			"123": {
				"titulo": {
					"pt": "Congela a vis&atilde;o atual",
					"es": "Congela la vista actual",
					"en": "Freeze current view"
				},
				"diretorio": "i3geo/ferramentas/congelamapa/openlayers.php",
				"categoria": "6",
				"pt": "Abre uma nova janela com a visualiza&ccedil;&atilde;o atual do mapa, mantendo o n&iacute;vel de zoom e as camadas ativas.<br>O mapa &eacute; mostrado na forma de uma imagem, ou seja, mant&eacute;m os elementos do mapa est&aacute;ticos mesmo que se desative as camadas ou altere a regi&atilde;o de visualiza&ccedil;&atilde;o do mapa original. Esta ferramenta &eacute; &uacute;til quando se deseja manter uma determinada regi&atilde;o do mapa sempre vis&iacute;vel enquanto se navega pelas demais regi&otilde;es do mesmo.",
				"es": "Abre una ventana nueva con la vista actual del mapa en la que se mantiene el nivel de zoom y las capas activas.<br>El mapa se visualiza en la forma de una imagen, es decir, mantiene los elementos de un mapa est&aacute;tico, aun cuando se desactiven las capas o cambie la vista del mapa original. Esta herramienta es &uacute;til cuando se desea mantener una determinada &aacute;rea del mapa siempre visible mientras se navegue hacia otras zonas del mismo.",
				"en": "It opens a new window that shows the current view of the map and keeps a certain zoom level and active layers.<br>The map is displayed as an image, that is, it is technically a static map, even when you turn off or change the view of the original map. This tool is useful when you want to keep a certain area of the map always visible while browsing to other areas of the map.",
				"apijs": "i3GEO.mapa.dialogo.congelaMapa();"
			},
			"124": {
				"titulo": {
					"pt": "Cartogramas estat&iacute;sticos",
					"es": "Cartogramas estad&iacute;sticos",
					"en": "Statistical cartograms"
				},
				"diretorio": "i3geo/ferramentas/metaestat/index.js",
				"categoria": "9",
				"pt": "A ferramenta Cartogramas Estat&iacute;sticos &eacute; utilizada como uma integra&ccedil;&atilde;o entre o mapa interativo e o sistema de metadados estat&iacute;sticos.<br>Voc&ecirc; pode construir uma camada a partir da escolha do tipo de limite geogr&aacute;fico, tipo de classifica&ccedil;&atilde;o e par&acirc;metros constantes no sistema de metadados estat&iacute;sticos. Basta selecionar os componentes da camada e clicar em ''Adiciona'.<p>As vari&aacute;veis, medidas de vari&aacute;veis e par&acirc;metros s&atilde;o definidos no m&oacute;dulo &lsquo;Metaest&rsquo; do sistema de administra&ccedil;&atilde;o do i3Geo.",
				"es": "La herramienta Cartogramas Estad&iacute;sticos se utiliza como una integraci&oacute;n entre el mapa interactivo y el sistema de metadatos estad&iacute;sticos.<br>Usted puede construir una capa a partir de la selecci&oacute;n del tipo de l&iacute;mite geogr&aacute;fico, tipo de clasificaci&oacute;n y par&aacute;metros constantes en el sistema de metadatos estad&iacute;sticos. Solo tiene que seleccionar los componentes de la capa y hacer clic en '' Agregar '.<p>Las variables, medidas de variables y par&aacute;metros se definen en el m&oacute;dulo Metaest del sistema de administraci&oacute;n de i3Geo.",
				"en": "The Statistical Cartograms tool is used as an integration between an interactive map and the statistical metadata system.<br>You can build a layer by selecting a type of geographic boundary, type of classification and constant parameters in the statistical metadata system. Just select layer components and click on ''Add''.<p>Variables, measures of variables and parameters are defined in the Metaest module of the i3Geo management system.",
				"apijs": "i3GEO.mapa.dialogo.metaestat();"
			},
			"125": {
				"titulo": {
					"pt": "Aplicativos estat&iacute;sticos cadastrados",
					"es": "Aplicaciones estad&iacute;sticas registradas",
					"en": "Registered statistical applications"
				},
				"diretorio": "i3geo/ferramentas/metaestat/listamapas.js",
				"categoria": "9",
				"pt": "Lista os mapas cadastrados pelo publicador de mapas do sistema de metadados estat&iacute;sticos, apresentando as diferentes op&ccedil;&otilde;es de interface para abri-los.",
				"es": "Presenta una lista de los mapas registrados por el publicador de mapas del sistema de metadatos estad&iacute;sticos. Muestra tambi&eacute;n las diferentes opciones de interfaz para abrirlos.",
				"en": "It shows a list of maps registered by the map publisher of the statistical metadata system. It also shows different interface options to open them.",
				"apijs": "i3GEO.mapa.dialogo.metaestatListaMapas();"
			},
			"126": {
				"titulo": {
					"pt": "Layer KML (plugin)",
					"es": "Layer KML (plugin)",
					"en": "Layer KML (plugin)"
				},
				"diretorio": "i3geo/classesjs/classe_plugin.js",
				"categoria": "4",
				"pt": "Plugin que permite configurar um mapfile contendo um layer cujos dados ser&atilde;o inseridos no mapa como uma camada em KML. O KML deve ser fornecido como uma url, podendo estar em qualquer servidor, local ou externo.",
				"es": "Plugin que permite configurar un mapfile que contiene una capa cuyos datos ser&aacute;n insertados en el mapa como una capa en KML. El KML debe ser suministrado como una url, pudiendo estar en cualquier servidor local o remoto.",
				"en": "Plugin that allows you to configure a mapfile that contains a layer whose data will be inserted in the map as a KML layer. The KML can be on any local or remote server and must be added as a URL.",
				"apijs": ""
			},
			"127": {
				"titulo": {
					"pt": "Layer parametrizado (plugin)",
					"es": "Layer parametrizado (plugin)",
					"en": "Parameterized layer (plugin)"
				},
				"diretorio": "i3geo/classesjs/classe_plugin.js",
				"categoria": "4",
				"pt": "Esse plugin permite que o item DATA, que define a fonte dos dados, seja parametrizado, utilizando-se palavras chave de substitui&ccedil;&atilde;o. Ao adicionar a camada ao mapa, um formul&aacute;rio &eacute; criado de forma autom&aacute;tica para que o usu&aacute;rio escolha os par&acirc;metros que ir&atilde;o definir a origem dos dados.",
				"es": "Este plugin permite que el elemento DATA que define la fuente de los datos sea parametrizado utilizando palabras claves de sustituci&oacute;n. Al agregar la capa al mapa un formulario se crea autom&aacute;ticamente para que el usuario elija los par&aacute;metros que definen el origen de los datos.",
				"en": "This plugin allows the DATA element that defines data source to be parameterized using substitution keywords. When you add a layer to the map, a form is automatically created so that the user can select parameters that define data source.",
				"apijs": ""
			},
			"128": {
				"titulo": {
					"pt": "Depend&ecirc;ncia da escala",
					"es": "Dependencia de la escala",
					"en": "Scale dependency"
				},
				"diretorio": "i3geo/ferramentas/mmscale.js",
				"categoria": "7",
				"pt": "Define par&acirc;metros que modificam o comportamento de uma camada em fun&ccedil;&atilde;o da escala do mapa ou da abrang&ecirc;ncia espacial.",
				"es": "Define par&aacute;metros que modifican el comportamiento de una capa en funci&oacute;n de la escala del mapa o de la extensi&oacute;n espacial.",
				"en": "It defines parameters that modify the behavior of a layer according to the map scale or the spatial extent.",
				"apijs": "i3GEO.tema.dialogo.mmscale();"
			},
			"131": {
				"titulo": {
					"pt": "Par&acirc;metros",
					"es": "Par&aacute;metros",
					"en": "Parameters"
				},
				"diretorio": "i3geo/ferramentas/parametrossql",
				"categoria": "5",
				"pt": "Os par&acirc;metros s&atilde;o definidos pelo administrador do sistema para retornar uma cl&aacute;usula espec&iacute;fica da camada, como um filtro. Dessa forma, o usu&aacute;rio deve escolher quais par&acirc;metros deseja passar para a camada para visualizar apenas a parte do dado que lhe interessa.",
				"es": "Los par&aacute;metros son definidos por el administrador del sistema para devolver una cl&aacute;usula espec&iacute;fica de la capa como un filtro. De esta forma, el usuario debe elegir cu&aacute;les par&aacute;metros desea pasar a la capa para visualizar solo la parte del dato que le interesa.",
				"en": "Parameters are defined by the system administrator to return a specific clause of a layer as a filter. In this way, the user must select which parameters he/she wants to pass to a layer in order to visualize only data he/she is interested in.",
				"apijs": ""
			},
			"132": {
				"titulo": {
					"pt": "Fun&ccedil;&otilde;es especiais para as etiquetas de informa&ccedil;&atilde;o",
					"es": "",
					"en": ""
				},
				"diretorio": "i3geo/ferramentas/funcaojstip",
				"categoria": "5",
				"pt": "Quando o usu&aacute;rio clica no mapa &eacute; mostrado uma etiqueta com informa&ccedil;&otilde;es. Essa etiqueta apresenta os dados obtidos da tabela de atributos das camadas e pode tamb&eacute;m mostrar links para fun&ccedil;&otilde;es especiais, que executam programas Javascript. Essas fun&ccedil;&otilde;es s&atilde;o definidas em cada camada por meio do sistema de administra&ccedil;&atilde;o e ficam armazenadas como uma string no formato JSON no METADATA chamado FUNCOESJS. Esse JSON cont&eacute;m os elementos tipo (se for layer o link para a fun&ccedil;&atilde;o ficar&aacute; no n&iacute;vel do tema e se for registro ficar&aacute; no n&iacute;vel do registro),titulo (nome que ser&aacute; mostrado na etiqueta), script (endere&ccedil;o do javascript que ser&aacute; inclu&iacute;do no mapa e que cont&eacute;m a fun&ccedil;&atilde;o que ser&aacute; executada), funcao (nome da fun&ccedil;&atilde;o que ser&aacute; executada), parametros (lista de nomes de colunas cujos valores ser&atilde;o enviadas como par&acirc;metros da fun&ccedil;&atilde;o)",
				"es": "",
				"en": "",
				"apijs": ""
			},
			"134": {
				"titulo": {
					"pt": "Layer GeoJson (plugin)",
					"es": "Layer GeoJson (plugin)",
					"en": "Layer GeoJson (plugin)"
				},
				"diretorio": "i3geo/classesjs/classe_plugin.js",
				"categoria": "4",
				"pt": "Plugin que permite configurar um mapfile contendo um layer cujos dados ser&atilde;o inseridos no mapa como uma camada em GeoJson. O GeoJson deve ser fornecido como uma url, podendo estar em qualquer servidor, local ou externo.",
				"es": "",
				"en": "",
				"apijs": ""
			}
		},
		"categorias": {
			"1": {
				"titulo": {
					"pt": "Propriedades do mapa",
					"es": "Propiedades del mapa",
					"en": "Map properties"
				},
				"observacao": {
					"pt": "Funcionalidades que permitem alterar caracter&iacute;sticas gerais do mapa, como tamanho e filtro de cores.",
					"es": "Funcionalidades que permiten cambiar las caracter&iacute;sticas generales del mapa como el tama&ntilde;o y el filtro de color.",
					"en": "Functionalities that allow you to change main characteristics of a map such as size and color filter."
				}
			},
			"2": {
				"titulo": {
					"pt": "Arquivos",
					"es": "Archivos",
					"en": "Files"
				},
				"observacao": {
					"pt": "",
					"es": "",
					"en": ""
				}
			},
			"3": {
				"titulo": {
					"pt": "An&aacute;lise geogr&aacute;fica",
					"es": "An&aacute;lisis geogr&aacute;fico",
					"en": "Geographical analysis"
				},
				"observacao": {
					"pt": "",
					"es": "",
					"en": ""
				}
			},
			"4": {
				"titulo": {
					"pt": "Inclus&atilde;o de camadas",
					"es": "Inclusi&oacute;n de capas",
					"en": "Layer adding"
				},
				"observacao": {
					"pt": "O i3Geo utiliza um conceito de camadas dispon&iacute;veis no mapa e camadas adicionais. Camadas dispon&iacute;veis s&atilde;o as que podem ser consultadas, visualizadas e modificadas, compondo uma lista separada das camadas adicionais. Normalmente as camadas dispon&iacute;veis s&atilde;o um conjunto menor em rela&ccedil;&atilde;o ao total de temas que podem ser utilizados. Novos temas podem ser adicionados ao mapa por meio das op&ccedil;&otilde;es existentes na lista de temas, normalmente posicionada na guia '+Temas'.",
					"es": "i3Geo utiliza el concepto de capas disponibles en el mapa y capas adicionales. Las capas disponibles son las que pueden ser consultadas, visualizadas y modificadas, conformando una lista aparte de las capas adicionales. Normalmente las capas disponibles son un conjunto menor en relaci&oacute;n al total de temas que pueden ser utilizados. Los temas nuevos se pueden agregar al mapa a trav&eacute;s de las opciones de la lista de temas, normalmente ubicadas en la pesta&ntilde;a '+Temas'.",
					"en": "i3Geo uses the principle of layers available on the map and additional layers. Available layers are those that can be queried, visualized and modified. They make up a separate list of additional layers. Available layers are usually a smaller set in relation to the number of themes that can be used. New themes can be added to the map through the options on the list of themes. This options are usually located on the '+ Themes' tab."
				}
			},
			"5": {
				"titulo": {
					"pt": "Opera&ccedil;&otilde;es sobre um tema",
					"es": "Operaciones sobre un tema",
					"en": "Operations on a theme"
				},
				"observacao": {
					"pt": "Uma das caracter&iacute;sticas do i3Geo &eacute; a possibilidade de modifica&ccedil;&atilde;o das camadas vistas no mapa. As op&ccedil;&otilde;es que permitem isso s&atilde;o mostradas normalmente na lista de camadas dispon&iacute;veis no mapa atual. Essa lista &eacute; mostrada como uma &aacute;rvore hier&aacute;rquica sendo que cada camada &eacute; um dos n&oacute;s. Expandindo-se esse n&oacute;, tem-se acesso &agrave;s opera&ccedil;&otilde;es.",
					"es": "Una de las caracter&iacute;sticas de i3Geo es la posibilidad de modificar las capas visualizadas en el mapa. Las opciones que permiten esto se presentan normalmente en la lista de capas disponibles en el mapa actual. Esta lista se muestra como un &aacute;rbol jer&aacute;rquico en el que cada capa es uno de los nodos. Al expandirse ese nodo se tiene acceso a las operaciones.",
					"en": "One of the features of i3Geo is the possibility of modifying layers displayed on the map. The options that allow you to do this are usually shown on the list of available layers on the current map. This list is shown as a hierarchical tree in which each layer is a node. When you expand a node you will have access to operations."
				}
			},
			"6": {
				"titulo": {
					"pt": "Opera&ccedil;&otilde;es sobre o mapa",
					"es": "Operaciones sobre el mapa",
					"en": "Operations on the map"
				},
				"observacao": {
					"pt": "",
					"es": "",
					"en": ""
				}
			},
			"7": {
				"titulo": {
					"pt": "Navega&ccedil;&atilde;o",
					"es": "Navegaci&oacute;n",
					"en": "Browsing"
				},
				"observacao": {
					"pt": "As fun&ccedil;&otilde;es de navega&ccedil;&atilde;o permitem alterar a escala do mapa e modificar a abrang&ecirc;ncia espacial. Esse tipo de mudan&ccedil;a, principalmente de escala, afeta o contexto do mapa, modificando seu comportamento. Algumas camadas podem ser sens&iacute;veis &agrave; escala, mostrando ou n&atilde;o determinados elementos. Quando uma camada possuir muitos elementos, &eacute; aconselh&aacute;vel seu desligamento at&eacute; que a regi&atilde;o desejada seja encontrada. Algumas interfaces possuem mecanismos distintos de navega&ccedil;&atilde;o, como Google e openLayers. A lista abaixo contempla apenas a interface padr&atilde;o.",
					"es": "Las funciones de navegaci&oacute;n permiten cambiar la escala del mapa y modificar la extensi&oacute;n espacial. Este tipo de cambio, principalmente &eacute;l de la escala, afecta el contexto del mapa que modifica su comportamiento. Dependiendo de la escala, la visualizaci&oacute;n de algunas capas puede ser afectada ya que se puede o no visualizar determinadas entidades. Cuando una capa tiene muchas entidades es aconsejable apagarlas hasta que el &aacute;rea deseada sea ubicada. Algunas interfaces poseen mecanismos distintos de navegaci&oacute;n tal como Google y OpenLayers. La lista siguiente solo contempla la interfaz predeterminada.",
					"en": "Browsing functionalities allow you to change the map scale and extent. This type of change, especially scale, affects the map context that modifies the map behavior. Depending on the scale, the visibility of some layers may be affected since certain features may or may not be displayed. When a layer has many feature it is advisable to turn them off until the desired area is located. Some interfaces have different browsing mechanisms such as Google and OpenLayers. The following list only considers the default interface."
				}
			},
			"8": {
				"titulo": {
					"pt": "Pesquisa",
					"es": "B&uacute;squeda",
					"en": "Search"
				},
				"observacao": {
					"pt": "",
					"es": "",
					"en": ""
				}
			},
			"9": {
				"titulo": {
					"pt": "Metadados estat&iacute;sticos",
					"es": "Metadatos estad&iacute;sticos",
					"en": "Statistical metadata"
				},
				"observacao": {
					"pt": "",
					"es": "",
					"en": ""
				}
			}
		}
	}
}
