<html>
<body>
<pre>

<a href="ms_criamapa.php?temasa=biomashp estadosl" target="blank">
ms_criamapa.php?temasa=biomashp estadosl | temasa - lista, separada por espa&ccedil;os, com os nomes dos arquivos map que ser&atilde;o adicionados ao mapa. Se o arquivo map n&atilde;o estiver no diret&oacute;rio i3geo/temas, o nome deve incluir o caminho completo no servidor. O arquivo map pode conter mais de um layer pois todos os existentes ser&atilde;o adicionados ao mapa. Por default, todos os layers encontrados nos mapfiles s&atilde;o adicionados ao mapa com o status de desenho em OFF.
</a>

<a href="ms_criamapa.php?temasa=biomashp estadosl&layers=biomashp" target="blank">
ms_criamapa.php?temasa=biomashp estadosl&amp;layers=biomashp | layers - lista, separada por espa&ccedil;os, com os nomes dos layers que ser&atilde;o ligados. A lista deve conter os nomes dos layers e n&atilde;o os nomes dos mapfiles acrescentados ao mapa. Por exemplo, ao adicionar com "temasa" um mapfile chamado "transporte" que contenha os layers "estradas" e "ferrovias" os dois layers ser&atilde;o adicionados ao mapa. Para que esses dois layers fiquem vis&iacute;veis no mapa deve-se utilizar &amp;layers=estradas ferrovias.
</a>
<a href="ms_criamapa.php?desligar=estados" target="blank">
ms_criamapa.php?desligar=estados | desligar - lista com os nomes dos temas que ser&atilde;o for&ccedil;ados a inicializar desligados, ou seja, com STATUS OFF
</a>

<a href="ms_criamapa.php?mapext=-63.252544 -34.336482 -43.952964 -23.813048" target="blank">
ms_criamapa.php?mapext=-63.252544 -34.336482 -43.952964 -23.813048 | mapext - extensao geografica que ser&aacute; utilizada. Por padr&atilde;o, a extens&atilde;o geogr&aacute;fica &eacute; definida para abranger o Brasil todo. Para alterar o padr&atilde;o deve-se utilizar o par&acirc;metro mapext para especificar a nova abrang&ecirc;ncia. Essa abrang&ecirc;ncia deve ser definida em coordenadas no formato d&eacute;cimos de grau e na proje&ccedil;&atilde;o geogr&aacute;fica. Exemplo: &amp;mapext=-54 -30 -50 -12. Observe que a ordem dos valores s&atilde;o xmin ymin xmax ymax
</a>

<a href="ms_criamapa.php?interface=geral.htm" target="blank">
ms_criamapa.php?interface=geral.htm | interface - nome da interface que ser&aacute; utilizada para abrir o mapa. As interfaces s&atilde;o arquivos HTML que podem estar no diret&oacute;rio aplicmap. Por default, utiliza-se o geral.htm. Vc pode copiar esse html e alter&aacute;-lo para customizar o mapa. Para chamar o html customizado, utilize ms_criamapa.php?interface=meumapa.htm
</a>

<a href="ms_criamapa.php?perfil=teste" target="blank">
ms_criamapa.php?perfil=teste | perfil - perfil utilizado para restringir os menus de temas. O menu com os temas mostrados no i3geo s&atilde;o definidos no arquivo menutemas/menutemas.xml. Nesse arquivo,pode-se utilizar um elemento &lt;PERFIL&gt;&lt;/PERFIL&gt; indicando que o tema apenas ser&aacute; mostrado em perfis espec&iacute;ficos. Por exempo: ms_criamapa.php?perfil=usu&aacute;rio1
</a>

<a href="ms_criamapa.php?pontos=-54 -12 -45 -37.55&nometemapontos=teste de pontos" target="blank">
ms_criamapa.php?pontos=-54 -12 -45 -37.55&amp;nometemapontos=teste de pontos | pontos - lista de coordenadas x e y que ser&atilde;o adicionadas como pontos no mapa.
nometemapontos - nome do tema de pontos
</a>

<a href="ms_criamapa.php?linhas=-54 -12 -45 -37.55 -40 -12&nometemalinhas=teste de linhas" target="blank">
ms_criamapa.php?linhas=-54 -12 -45 -37.55 -40 -12&amp;nometemalinhas=teste de linhas | linhas - lista de coordenadas x e y que ser&atilde;o adicionadas como linhas no mapa. As coordenadas de linhas diferentes devem ser separadas por ",", por exemplo: -54 -12 -50 -12,-50 -1 -50 -2 -50 -3
nometemalinhas - nome do tema de linhas
</a>

<a href="ms_criamapa.php?poligonos=-54 -12 -45 -37.55 -40 -12&nometemapoligonos=teste de poligonos" target="blank">
ms_criamapa.php?poligonos=-54 -12 -45 -37.55 -40 -12&amp;nometemapoligonos=teste de poligonos | poligonos - lista de coordenadas x e y que ser&atilde;o adicionadas como pol&iacute;gonos no mapa. As coordenadas dos v&eacute;rtices de pol&iacute;gonos diferentes devem ser separadas por ",".
nometemapoligonos - nome do tema de pol&iacute;gonos
</a>

<a href="ms_criamapa.php?nometemawkt=wkt&wkt=POLYGON ((-56.1874569701050040 -15.2281419679940000, -51.4796050149779990 -10.7049116581660010, -50.8334292564310030 -17.0743584209850000, -56.1874569701050040 -15.2281419679940000))" target="blank">
wkt - insere elementos no mapa com coordenadas definidas em wkt
nometemawkt - nome do tema em wkt
</a>

<a href="ms_criamapa.php?idioma=en" target="blank">
ms_criamapa.php?idioma=en | idioma - idioma da interface (veja os idiomas dispon&iacute;veis em classe_idioma.js)
</a>

<a href="ms_criamapa.php?interface=googlemaps.phtml&kmlurl=http://gmaps-samples.googlecode.com/svn/trunk/ggeoxml/cta.kml" target="blank">
ms_criamapa.php?interface=googlemaps.phtml&amp;kmlurl=http://gmaps-samples.googlecode.com/svn/trunk/ggeoxml/cta.kml 0| kmlurl - url de um arquivo KML que ser&aacute; incluido no mapa. V&aacute;lido apenas na interface google maps
</a>

<a href="ms_criamapa.php?srs_wms=EPSG:4618&&image_wms=image/png&versao_wms=1.1.0&url_wms=http://mapas.mma.gov.br/i3geo/ogc.php?tema=bioma&layer_wms=bioma&style_wms=&nome_wms=bioma" target="blank">
url_wms - endere&ccedil;o de um WMS (ser&aacute; incluido como uma camada no mapa)
layer_wms - nome do layer
style_wms - estilo do layer
nome_wms - nome da camada (titulo)
srs_wms - c&oacute;digo da proje&ccedil;&atilde;o
image_wms - tipo de imagem dispon&iacute;vel
versao_wms - Vers&atilde;o do WMS (necess&aacute;rio quando da inclus&atilde;o de uma camada WMS diretamente pela URL)
</a>

</pre>
</body>
</html>