<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Frameset//EN" "http://www.w3.org/TR/html4/frameset.dtd">
<html>
<head>
<title>Cliente WMS</title>
<meta name="description" content="Mapa interativo do MMA"> 
<meta name="keywords" content="WMS OGC mapa sig gis webmapping geo geoprocessamento interativo meio ambiente MMA cartografia geografia"> 
<meta name="robots" content="index,follow">
<!-- Leitura dos arquivos de estilos -->
<link rel="stylesheet" type="text/css" href="css/geral.css">
<link rel="stylesheet" type="text/css" href="css/i3geo_ferramentas45.css">
<style type="text/css">.yuibutton button{padding-left:2em;background:url(imagens/tic.png) 5% 50% no-repeat;}</style>
<style>
P 
{COLOR: #2F4632;text-align: justify;font-size: 12px;font-family: Verdana, Arial, Helvetica, sans-serif;}
#banner
{position:absolute;top:0px;left:0px;}
#arvoreMenu
{width:200px;position:absolute;top:30px;left:0px;}
#corpo
{width:555px;position:absolute;top:30px;left:200px;background:rgb(250,250,250);}
.corpo
{width:555px;position:absolute;top:30px;left:200px;background:rgb(250,250,250);}
#i3geo_wscliente_id_mapa
{width: 450px;height: 450px;border: 0px solid black;}
.listaServico
{border:1px solid black;text-align:center;height:260px;overflow:auto;width:530px;background-color:rgb(250,250,250)}
.listaAjuda
{left:0px;border:0px solid black;text-align:center;height:320px;overflow:auto;width:100%;}
</style>
<!-- Leitura dos programas javaScript. Pode-se ler os arquivos n&atilde;o compactados, bastando excluir a palavra _compacto -->
<script type="text/javascript" src="classesjs/wscliente.js"></script>
</head>
<body style="background-color:white;overflow:auto;" class="yui-navset">
<div id=banner ><img src="imagens/barrasuperior_geradordelinks_2006.jpg" width="765" ></div>
<!-- aqui vai o menu de op&ccedil;&otilde;es -->
<div id=arvoreMenu ></div>
<!-- aqui vai o corpo da aplica&ccedil;&atilde;o -->

<div id=corpo style="background-color:rgb(250,250,250)">
<H1>Cliente de web services</H1>
<p>Selecione uma op&ccedil;&atilde;o na &aacute;rvore ao lado.
<br><p>Veja no item "ajuda" algumas defini&ccedil;&otilde;es sobre "web services" e suas potencialidades.
<p>O "WSCliente" foi desenvolvido pelo Minist&eacute;rio do Meio Ambiente e faz parte do pacote "i3Geo". Licenciado sob GPL,
o "i3Geo" pode ser obtido no endere&ccedil;o <a href="http://www.softwarepublico.gov.br">Portal do software p&uacute;blico</a>.
<p>Com o "WSCliente" &eacute; poss&iacute;vel acessar servi&ccedil;os que retornam mapas, sendo utilizado para cadastrar, divulgar e
verificar os servi&ccedil;os dispon&iacute;veis.
<p>A lista de Web Services &eacute; mantida por meio do sistema de administra&ccedil;&atilde;o do i3Geo.
<div style="background-color:white;left:0px"><img src="imagens/i3geo1bw.jpg" /></div>
</div>

<!-- texto da ajuda sobre web services -->
<div id=oquews style='display:none;'>
<div class=listaAjuda >
<p>Um web service &eacute; um componente, ou unidade lógica de aplica&ccedil;&atilde;o, acess&iacute;vel atrav&eacute;s de protocolos padr&otilde;es de Internet.
<p>Como componentes esses servi&ccedil;os possuem uma funcionalidade que pode ser reutilizada sem a preocupa&ccedil;&atilde;o de como &eacute; implementada. O modo de acesso &eacute; diferente de alguns modelos anteriores, onde os componentes eram acessados atrav&eacute;s de protocolos espec&iacute;ficos, como o DCOM, RMI ou IIOP.
<p>Web Services combinam os melhores aspectos do desenvolvimento baseado em componentes e a Web.
<p>H&aacute; algumas especifica&ccedil;&otilde;es e tecnologias definidas para a constru&ccedil;&atilde;o ou utiliza&ccedil;&atilde;o de Web services. Essas especifica&ccedil;&atilde;o e tecnologias endere&ccedil;am para os seguintes requisitos para o desenvolvimento baseado em servi&ccedil;os: uma forma comum de representar dados um formato de mensagens comum e extens&iacute;vel uma linguagem de descri&ccedil;&atilde;o do servi&ccedil;o, comum e extens&iacute;vel um mecanismo para localizar os servi&ccedil;os localizados em um Web site espec&iacute;fico um mecanismo para descobrir os provedores de servi&ccedil;o.
<p>O XML &eacute; a escolha natural para o modo de representa&ccedil;&atilde;o dos dados. Muitas especifica&ccedil;&otilde;es utilizam o XML para representa&ccedil;&atilde;o dos dados, assim como os XML Schemas para descrever os tipos dos dados. 
<p>O SOAP (Simple Object Access Protoco) &eacute; um protocolo leve para troca de informa&ccedil;&otilde;es. Parte da sua especifica&ccedil;&atilde;o &eacute; composta por um conjunto de regras de como utilizar o XML para representar os dados. Outra parte define o formato de mensagens, conven&ccedil;&otilde;es para representar as chamadas de procedimento remoto (RPCs) utilizando o SOAP, e associa&ccedil;&otilde;es ao protocolo HTTP.
<p>O WSDL (Web Services Description Language) &eacute; uma linguagem baseada em XML, com a finalidade de documentar as mensagens o Web service aceita e gera. Esse mecanismo padr&atilde;o facilita a interpreta&ccedil;&atilde;o dos contratos pelos desenvolvedores e ferramentas de desenvolvimento. 
<p>Tamb&eacute;m &eacute; necess&aacute;ria uma forma de localiza&ccedil;&atilde;o dos Web services. O protocolo Disco (Discovery Protocol) define um formato para o documento discovery e um protocolo para devolver esse documento, possibilitando a localiza&ccedil;&atilde;o dos servi&ccedil;os em um web site conhecido. No entanto, &eacute; comum que n&atilde;o se saiba as URLs onde os servi&ccedil;os podem ser encontrados. O UDDI (Universal Description, Discovery, and Integration) &eacute; um mecanismo para os fornecedores anunciarem a exist&ecirc;ncia de seus servi&ccedil;os, e para os consumidores localizarem os servi&ccedil;os de seu interesse. 
<p>Podemos definir, resumidamente, um XML Web service como um servi&ccedil;o de software publicado na Web atrav&eacute;s do SOAP, descrito com um arquivo WSDL e registrado em UDDI.
<p>Fonte: <a href='http://www.iweb.com.br'>IWEB</a>
</div></div>
<!-- texto da ajuda sobre ogc -->
<div id=oqueogc style='display:none;'>
<div class=listaAjuda >
<p>O <a href='http://www.opengeospatial.org/'>OGC - Open Geospatial Consortium, Inc</a> &eacute; uma institui&ccedil;&atilde;o que congrega empresas, órg&atilde;os governamentais e universidades com o objetivo de definir padr&otilde;es na &aacute;rea de geotecnologias.
<p>Uma das a&ccedil;&otilde;es do OGC &eacute; a defini&ccedil;&atilde;o de "web services" voltados para a informa&ccedil;&atilde;o cartogr&aacute;fica. Com o estabelecimento desses padr&otilde;es &eacute; poss&iacute;vel a cria&ccedil;&atilde;o de softwares que realizam a integra&ccedil;&atilde;o de dados.
<p>Os principais padr&otilde;es definidos pelo OGC s&atilde;o:
<p><b>GML - Geography Markup Language:</b> padr&atilde;o XML para arquivos de dados cartogr&aacute;ficos vetoriais.
<p><b>WMS - Web Map Service:</b> padr&atilde;o de "web service" que fornece mapas digitais na forma de imagens.
<p><b>WFS - Web Feature Service:</b>: padr&atilde;o de "web service" que fornece dados no formato GML.
<p><b>WCS - Web Coverage Service:</b> padr&atilde;o de "web service" que aprimora o padr&atilde;o WMS fornecendo imagens com valores que indicam propriedades geogr&aacute;ficas e n&atilde;o apenas valores referentes a uma determinada cor.  
</div></div>
<!-- texto da ajuda sobre ws cartografico -->
<div id=oquecarto style='display:none;'>
<div class=listaAjuda >
<p>Em cartografia existem padr&otilde;es definidos pelo <a href='http://www.opengeospatial.org/'>OGC</a> que possibilitam o acesso a dados geogr&aacute;ficos na forma de mapas digitais, os chamados "web services cartogr&aacute;ficos".
<p>Com essa tecnologia &eacute; poss&iacute;vel acessar bancos de dados que estejam em qualquer servidor de dados da Internet sem a necessidade de download de arquivos.
<p>Um programa de computador, rodando na Internet ou no computador do usu&aacute;rio, estabelece o acesso aos v&aacute;rios servi&ccedil;os de fornecimento de dados (web services), integrando em um mesmo mapa digital temas armazenados de forma descentralizada.
<p>A grande vantagem dessa tecnologia &eacute; a possibilidade de acesso aos dados diretamente do respons&aacute;vel por sua manuten&ccedil;&atilde;o. Dessa forma, tem-se mapas com a melhor atualiza&ccedil;&atilde;o poss&iacute;vel. Outra vantagem &eacute; o fato de n&atilde;o ser necess&aacute;rio armazenar em um mesmo servidor de arquivos um volume grande de dados.

</div></div>
<!-- escolher um wms -->
<div id=RSSwms style='display:none' class=corpo >
	<p><b>Digite o endere&ccedil;o do servi&ccedil;o ou selecione da lista:</b>
	<p>(após selecionar o servi&ccedil;o clique em 'listar temas' para ver os temas dispon&iacute;veis)</p>
	<br><input type=text value='' name=enderecowms id=enderecowms size=80 />
	<div onclick='$i3geo_wscliente.listatemas()' ><br><input id=botao1 type=button value='Escolher um tema&nbsp;&nbsp;' class=executar size=25  /></div>
	<p><b>Lista de servi&ccedil;os cartogr&aacute;ficos cadastrados (clique para selecionar)</b><br>
	<div class=listaServico id=resultadoRSSwms ></div>
</div>

<!-- escolher um servi&ccedil;o de dados -->
<div id=RSSws style='display:none;' class=corpo>
	<p><b>Digite o endere&ccedil;o do servi&ccedil;o ou selecione da lista:</b>(ap&oacute;s selecionar o servi&ccedil;o clique em 'Escolher fun&ccedil;&atilde;o' para ver as op&ccedil;&otilde;es dispon&iacute;veis)
	<p><input type=text value='' name=enderecows id=enderecows size=80 onchange="registraws(this.value)"/>
	<div onclick='$i3geo_wscliente.listafuncoes()'><p><input id=botao2 type=button value='Escolher fun&ccedil;&atilde;o&nbsp;&nbsp;' class=executar size=25  /></div>
	<p><b>Lista de servi&ccedil;os cadastrados (clique para selecionar)</b><br>
	<div class=listaServico id=resultadoRSSws ></div>
</div>
<script src="ferramentas/i3geo_tudo_compacto.js.php" type="text/javascript"></script>
<script src="classesjs/i3geo_tudo_compacto45.js.php" type="text/javascript"></script>
</body>
<script>
/*
wscliente.htm

Esse aplicativo permite ao usu&aacute;rio ver a lista de servi&ccedil;os cadastrados no i3geo e acess&aacute;-los para testes.

About: Licen&ccedil;a

I3Geo Interface Integrada de Ferramentas de Geoprocessamento para Internet

Direitos Autorais Reservados (c) 2006 Minist&eacute;rio do Meio Ambiente Brasil
Desenvolvedor: Edmar Moretti edmar.moretti@mma.gov.br

Este programa &eacute; software livre; voc&ecirc; pode redistribu&iacute;-lo
e/ou modific&aacute;-lo sob os termos da Licen&ccedil;a P&uacute;blica Geral
GNU conforme publicada pela Free Software Foundation;

Este programa &eacute; distribu&iacute;do na expectativa de que seja &uacute;til,
por&eacute;m, SEM NENHUMA GARANTIA; nem mesmo a garantia impl&iacute;cita
de COMERCIABILIDADE OU ADEQUA&Ccedil;&Atilde;O A UMA FINALIDADE ESPEC&Iacute;FICA.
Consulte a Licen&ccedil;a P&uacute;blica Geral do GNU para mais detalhes.
Voc&ecirc; deve ter recebido uma cópia da Licen&ccedil;a P&uacute;blica Geral do
GNU junto com este programa; se n&atilde;o, escreva para a
Free Software Foundation, Inc., no endere&ccedil;o
59 Temple Street, Suite 330, Boston, MA 02111-1307 USA.

Veja:

<wscliente.js>

File: i3geo/wscliente.htm

Note:

Para iniciar o wscliente pode-se incluir na url par&acirc;metros indicando o tipo de servi&ccedil;o e o endere&ccedil;o do mesmo.

Por exemplo

i3geo/wscliente.htm?wms,endereco_servico

*/
var g_locaplic = i3GEO.util.protocolo()+"://"+window.location.host+"/i3geo";
var i3geo_wscliente_configura = new i3geo_wscliente_configura
(
	g_locaplic,
	"corpo",
	"enderecows",
	"enderecowms",
	new Array(g_locaplic+"/admin/xmlservicosws.php"),
	new Array(g_locaplic+"/admin/xmlservicoswms.php")
);
i3geo_wscliente_inicia(i3geo_wscliente_configura);
document.body.style.backgroundColor="white";
</script>
</html>
