<html><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>Inicializa o i3Geo via URL ms_criamapa.php - i3Geo</title><link rel="stylesheet" type="text/css" href="../styles/main.css"><script language=JavaScript src="../javascript/main.js"></script><script language=JavaScript src="../javascript/prettify.js"></script></head><body class="FramedContentPage" onLoad="NDOnLoad();prettyPrint();"><script language=JavaScript><!--
if (browserType) {document.write("<div class=" + browserType + ">");if (browserVer) {document.write("<div class=" + browserVer + ">"); }}// --></script>

<!--  Generated by Natural Docs, version 1.51 -->
<!--  http://www.naturaldocs.org  -->

<!-- saved from url=(0026)http://www.naturaldocs.org -->




<div id=Content><div class="CSection"><div class=CTopic id=MainTopic><h1 class=CTitle><a name="Inicializa_o_i3Geo_via_URL_ms_criamapa.php"></a>Inicializa o i3Geo via URL ms_criamapa.php</h1><div class=CBody><p>Esse &eacute; o programa principal de inicializa&ccedil;&atilde;o, podendo ser chamado diretamente pelo navegador web.</p><p>Cria os diret&oacute;rios tempor&aacute;rios em ms_tmp, incluindo o mapfile (<a href="http://mapserver.org/mapfile/index.html#mapfile" class=LURL target=_top>http://mapserver.org/mapfile/index.html#mapfile</a>) que ser&aacute; a base para o funcionamento do mapa.</p><p>Com o uso de par&acirc;metros &eacute; poss&iacute;vel alterar o processo padr&atilde;o de cria&ccedil;&atilde;o do mapa, como por exemplo, podem ser adicionadas novas camadas ou modificada a abrang&ecirc;ncia espacial do mapa.</p><p>A inicializa&ccedil;&atilde;o padr&atilde;o abrir&aacute; uma interface HTML com todas as funcionalidades dispon&iacute;veis, por&eacute;m &eacute; poss&iacute;vel escolher qualquer outro HTML para a apresenta&ccedil;&atilde;o do mapa.</p><p>No diret&oacute;rio i3geo/interface est&atilde;o os arquivos HTML que formatam a apresenta&ccedil;&atilde;o do mapa.&nbsp; Al&eacute;m desses arquivos, podem ser criados outros, conforme a necessidade do usu&aacute;rio.</p><p>Os par&acirc;metros podem ser utilizados na chamada do i3geo via navegador, p.e.,</p><p><a href="http://localhost/i3geo/ms_criamapa.php?temasa=estadosl" class=LURL target=_top>http://localhost<wbr>/i3geo<wbr>/ms_criamapa.php?temasa=estadosl</a></p><p>A ordem dos par&acirc;metros n&atilde;o &eacute; importante, mas o primeiro deve ser precedido de &ldquo;?&rdquo;.&nbsp; Os demais par&acirc;metros devem ser acrescentados sempre precedidos de &ldquo;&&rdquo;, p.e.,</p><p><a href="http://localhost/i3geo/ms_criamapa.php?temasa=estadosl" class=LURL target=_top>http://localhost<wbr>/i3geo<wbr>/ms_criamapa.php?temasa=estadosl</a> bioma&layers=estadosl bioma</p><p>Caso a inicializa&ccedil;&atilde;o do i3geo ocorra por um outro programa PHP, o ms_criamapa.php deve ser executado via include.&nbsp; Nesse caso, os par&acirc;metros devem ser especificados como vari&aacute;veis, p.e.,</p><p>$temasa=&rdquo;bioma&rdquo;;</p><p>include(&ldquo;ms_criamapa.php&rdquo;);</p><h4 class=CHeading>Observa&ccedil;&otilde;es</h4><p>Os cookies passados ao servidor s&atilde;o eliminados com a linha</p><p>$_COOKIE = array();</p><p>Se a sua aplica&ccedil;&atilde;o precisa de cookies, comente essa linha do programa.</p><p>A interface HTML padr&atilde;o de abertura do mapa &eacute; definido em uma vari&aacute;vel no arquivo ms_configura.php, podendo ser alterada se necess&aacute;rio.</p><h4 class=CHeading>Link</h4><p><a href="http://localhost/i3geo/ms_criamapa.php" class=LURL target=_top>http://localhost/i3geo/ms_criamapa.php</a></p><h4 class=CHeading>Licen&ccedil;a</h4><p>GPL2</p><p>i3Geo Interface Integrada de Ferramentas de Geoprocessamento para Internet</p><p>Direitos Autorais Reservados &copy; 2006 Minist&eacute;rio do Meio Ambiente Brasil Desenvolvedor: Edmar Moretti <a href="#" onClick="location.href='mai' + 'lto:' + 'edmar.'&nbsp; + 'moretti' + '@' + 'gmai' + 'l.com'; return false;" class=LEMail>edmar.<span style="display: none">.nosp@m.</span>moretti<span>@</span>gmai<span style="display: none">.nosp@m.</span>l.com</a></p><p>Este programa &eacute; software livre; voc&ecirc; pode redistribu&iacute;-lo e/ou modific&aacute;-lo sob os termos da Licen&ccedil;a P&uacute;blica Geral GNU conforme publicada pela Free Software Foundation;</p><p>Este programa &eacute; distribu&iacute;do na expectativa de que seja &uacute;til, por&eacute;m, SEM NENHUMA GARANTIA; nem mesmo a garantia impl&iacute;cita de COMERCIABILIDADE OU ADEQUA&Ccedil;&Atilde;O A UMA FINALIDADE ESPEC&Iacute;FICA.&nbsp; Consulte a Licen&ccedil;a P&uacute;blica Geral do GNU para mais detalhes.&nbsp; Voc&ecirc; deve ter recebido uma c&oacute;pia da Licen&ccedil;a P&uacute;blica Geral do GNU junto com este programa; se n&atilde;o, escreva para a Free Software Foundation, Inc., no endere&ccedil;o 59 Temple Street, Suite 330, Boston, MA 02111-1307 USA.</p><!--START_ND_SUMMARY--><div class=Summary><div class=STitle>Summary</div><div class=SBorder><table border=0 cellspacing=0 cellpadding=0 class=STable><tr class="SMain"><td class=SEntry><a href="#Inicializa_o_i3Geo_via_URL_ms_criamapa.php" >Inicializa o i3Geo via URL ms_criamapa.php</a></td><td class=SDescription>Esse &eacute; o programa principal de inicializa&ccedil;&atilde;o, podendo ser chamado diretamente pelo navegador web.</td></tr><tr class="SGroup SIndent1"><td class=SEntry><a href="#Arquivos" >Arquivos</a></td><td class=SDescription></td></tr><tr class="SArquivo SIndent2 SMarked"><td class=SEntry><a href="#i3geo/ms_criamapa.php" >i3geo/<wbr>ms_criamapa.php</a></td><td class=SDescription></td></tr></table></div></div><!--END_ND_SUMMARY--></div></div></div>

<div class="CGroup"><div class=CTopic><h3 class=CTitle><a name="Arquivos"></a>Arquivos</h3></div></div>

<div class="CArquivo"><div class=CTopic><h3 class=CTitle><a name="i3geo/ms_criamapa.php"></a>i3geo/<wbr>ms_criamapa.php</h3><div class=CBody><h4 class=CHeading>Par&acirc;metros</h4><table border=0 cellspacing=0 cellpadding=0 class=CDescriptionList><tr><td class=CDLEntry>base</td><td class=CDLDescription>arquivo mapfile que servir&aacute; de base para a cria&ccedil;&atilde;o do mapa.&nbsp; Por default, s&atilde;o utilizados os arquivos existentes em i3geo/aplicmap (geral1windows, geral1,...)&nbsp; Essa vari&aacute;vel pode ser definida em ms_configura tamb&eacute;m.&nbsp; Se n&atilde;o estiver definida em nenhum lugar, o i3Geo tentar&aacute; descobrir o arquivo adequado a ser utilizado.&nbsp; Voc&ecirc; pode utilizar essa op&ccedil;&atilde;o para abrir um mapa com as camadas que voc&ecirc; quiser, mas para evitar redund&acirc;ncias, prefira o uso de &temasa</td></tr><tr><td class=CDLEntry>temasa</td><td class=CDLDescription>lista, separada por espa&ccedil;os, com os nomes dos arquivos map ou gvsig que ser&atilde;o adicionados ao mapa.&nbsp; Se o arquivo n&atilde;o estiver no diret&oacute;rio i3geo/temas, o nome deve incluir o caminho completo no servidor.&nbsp; O arquivo pode conter mais de um layer pois todos os existentes ser&atilde;o adicionados ao mapa.&nbsp; Por default, todos os layers encontrados nos mapfiles s&atilde;o adicionados ao mapa com o status de desenho em OFF.</td></tr><tr><td class=CDLEntry>layers</td><td class=CDLDescription>lista, separada por espa&ccedil;os, com os nomes dos layers que ser&atilde;o ligados.&nbsp; A lista deve conter os nomes dos layers e n&atilde;o os nomes dos mapfiles acrescentados ao mapa.&nbsp; Por exemplo, ao adicionar com &ldquo;temasa&rdquo; um mapfile chamado &ldquo;transporte&rdquo; que contenha os layers &ldquo;estradas&rdquo; e &ldquo;ferrovias&rdquo; os dois layers ser&atilde;o adicionados ao mapa.&nbsp; Para que esses dois layers fiquem vis&iacute;veis no mapa deve-se utilizar &layers=estradas ferrovias.</td></tr><tr><td class=CDLEntry>desligar</td><td class=CDLDescription>lista com os nomes dos temas que ser&atilde;o for&ccedil;ados a inicializar desligados, ou seja, com STATUS OFF</td></tr><tr><td class=CDLEntry>mapext</td><td class=CDLDescription>extensao geografica que ser&aacute; utilizada.&nbsp; Por padr&atilde;o, a extens&atilde;o geogr&aacute;fica &eacute; definida para abranger o Brasil todo.&nbsp; Para alterar o padr&atilde;o deve-se utilizar o par&acirc;metro mapext para especificar a nova abrang&ecirc;ncia.&nbsp; Essa abrang&ecirc;ncia deve ser definida em coordenadas no formato d&eacute;cimos de grau e na proje&ccedil;&atilde;o geogr&aacute;fica.&nbsp; Exemplo: &mapext=-54 -30 -50 -12.&nbsp; Observe que a ordem dos valores s&atilde;o xmin ymin xmax ymax</td></tr><tr><td class=CDLEntry>executa</td><td class=CDLDescription>programa ou fun&ccedil;&atilde;o em php que ser&aacute; executado via include.&nbsp; O include &eacute; feito no final do processo de inicializa&ccedil;&atilde;o quando a vari&aacute;vel $tmpfname j&aacute; est&aacute; definida.&nbsp; Essa vari&aacute;vel guarda o nome do arquivo mapfile que ser&aacute; utilizado pelo i3geo.</td></tr><tr><td class=CDLEntry>interface</td><td class=CDLDescription>nome da interface que ser&aacute; utilizada para abrir o mapa.&nbsp; As interfaces s&atilde;o arquivos HTML que podem estar no diret&oacute;rio aplicmap.&nbsp; Por default, utiliza-se o geral.htm.&nbsp; Vc pode copiar esse html e alter&aacute;-lo para customizar o mapa.&nbsp; Para chamar o html customizado, utilize ms_criamapa.php?interface=meumapa.htm</td></tr><tr><td class=CDLEntry>perfil</td><td class=CDLDescription>perfil utilizado para restringir os menus de temas. ms_criamapa.php?perfil=usu&aacute;rio1</td></tr><tr><td class=CDLEntry>caminho</td><td class=CDLDescription>caminho relativo que indica o local onde a interface do mapa esta localizada.</td></tr><tr><td class=CDLEntry>pontos</td><td class=CDLDescription>lista de coordenadas x e y que ser&atilde;o adicionadas como pontos no mapa.</td></tr><tr><td class=CDLEntry>nometemapontos</td><td class=CDLDescription>nome do tema de pontos</td></tr><tr><td class=CDLEntry>linhas</td><td class=CDLDescription>lista de coordenadas x e y que ser&atilde;o adicionadas como linhas no mapa.&nbsp; As coordenadas de linhas diferentes devem ser separadas por &ldquo;,&rdquo;, por exemplo: -54 -12 -50 -12,-50 -1 -50 -2 -50 -3</td></tr><tr><td class=CDLEntry>nometemalinhas</td><td class=CDLDescription>nome do tema de linhas</td></tr><tr><td class=CDLEntry>poligonos</td><td class=CDLDescription>lista de coordenadas x e y que ser&atilde;o adicionadas como pol&iacute;gonos no mapa.&nbsp; As coordenadas dos v&eacute;rtices de pol&iacute;gonos diferentes devem ser separadas por &ldquo;,&rdquo;.</td></tr><tr><td class=CDLEntry>nometemapoligonos</td><td class=CDLDescription>nome do tema de pol&iacute;gonos</td></tr><tr><td class=CDLEntry>simbolo</td><td class=CDLDescription>nome do s&iacute;mbolo que ser&aacute; utilizado para desenhar os elementos inseridos (veja arquivo de s&iacute;mbolos em i3geo/symbols)</td></tr><tr><td class=CDLEntry>corsimbolo</td><td class=CDLDescription>cor do s&iacute;mbolo definido em RGB separados por espa&ccedil;o ou v&iacute;rgula</td></tr><tr><td class=CDLEntry>tamanhosimbolo</td><td class=CDLDescription>tamanho do s&iacute;mbolo em pixels</td></tr><tr><td class=CDLEntry>wkt</td><td class=CDLDescription>insere elementos no mapa com coordenadas definidas em wkt</td></tr><tr><td class=CDLEntry>nometemawkt</td><td class=CDLDescription>nome do tema em wkt</td></tr><tr><td class=CDLEntry>idioma</td><td class=CDLDescription>idioma da interface (veja os idiomas dispon&iacute;veis em classe_idioma.js)</td></tr><tr><td class=CDLEntry>kmlurl</td><td class=CDLDescription>url de um arquivo KML que ser&aacute; incluido no mapa.&nbsp; V&aacute;lido apenas na interface google maps</td></tr><tr><td class=CDLEntry>url_wms</td><td class=CDLDescription>endere&ccedil;o de um WMS (ser&aacute; incluido como uma camada no mapa)</td></tr><tr><td class=CDLEntry>layer_wms</td><td class=CDLDescription>nome do layer</td></tr><tr><td class=CDLEntry>style_wms</td><td class=CDLDescription>estilo do layer</td></tr><tr><td class=CDLEntry>nome_wms</td><td class=CDLDescription>nome da camada (titulo)</td></tr><tr><td class=CDLEntry>srs_wms</td><td class=CDLDescription>c&oacute;digo da proje&ccedil;&atilde;o</td></tr><tr><td class=CDLEntry>image_wms</td><td class=CDLDescription>tipo de imagem dispon&iacute;vel</td></tr><tr><td class=CDLEntry>versao_wms</td><td class=CDLDescription>Vers&atilde;o do WMS (necess&aacute;rio quando da inclus&atilde;o de uma camada WMS diretamente pela URL)</td></tr><tr><td class=CDLEntry>gvsiggvp</td><td class=CDLDescription>(depreciado na vers&atilde;o 4.7 - utilize o parametro temasa) endere&ccedil;o no servidor do arquivo de projeto gvSig (gvp) que ser&aacute; utilizado para construir o mapa (experimental)</td></tr><tr><td class=CDLEntry>gvsigview</td><td class=CDLDescription>lista com nomes de views existentes no projeto gvSig separado por virgula.&nbsp; Se for vazio, serao adicionadas todas as views.&nbsp; Exemplo (<a href="http://localhost/i3geo/ms_criamapa.php?gvsiggvp=c:" class=LURL target=_top>http://localhost<wbr>/i3geo<wbr>/ms_criamapa.php?gvsiggvp=c:</a>\temp\teste.gvp&gvsigview=Untitled - 0)</td></tr><tr><td class=CDLEntry>restauramapa</td><td class=CDLDescription>id do mapa armazenado no sistema de administracao e que ser&aacute; restaurado para ser aberto novamente (veja em i3geo/admin/html/mapas.html)</td></tr><tr><td class=CDLEntry>filtros</td><td class=CDLDescription>filtros podem ser adicionados incluindo o parametro da seguinte forma: &map_layer_&lt;nomedotema&gt;_filter=</td></tr></table><p>Exemplo de filtro</p><p><a href="http://localhost/i3geo/ms_criamapa.php?temasa=_lbiomashp&map_layer__lbiomashp_filter=" class=LURL target=_top>http://localhost<wbr>/i3geo<wbr>/ms_criamapa.php?temasa=_lbiomashp<wbr>&map_layer__lbiomashp_filter=</a>((&lsquo;[CD_LEGENDA]&rsquo;=&rsquo;CAATINGA&rsquo;))&temasa=_lbiomashp</p><p>no caso de camadas Postgis basta usar map_layer__lbiomashp_filter=cd_legenda=&rsquo;CAATINGA&rsquo;</p></div></div></div>

</div><!--Content-->



<!--START_ND_TOOLTIPS-->
<!--END_ND_TOOLTIPS-->

<script language=JavaScript><!--
if (browserType) {if (browserVer) {document.write("</div>"); }document.write("</div>");}// --></script></body></html>